{
    "intents": [
        {
            "tag": 50000,
            "patterns": "Flat",
            "responses": [
                "I am so sorry, friend. I can relate to a lot of what you are writing about, especially the part about being in a long-term relationship and waiting for the next step that never seems to come. It really, truly sucks. On top of that, I'm in a bad situation that life has thrown at me and that I can't do anything about... and it just makes you feel hopeless.\n\nSo what I'm saying is... I'm not in a place to really cheer you up, but I think I can relate. Please know that you are not alone. And maybe you will find some comfort in that. I'm sending you a hug, wherever you are.",
                "Sorry to hear you are going through this. Is there any support you can access through your employer? I've been a paramedic for almost 2 decades, and I can commiserate about seeing shitty and sad things. And life stuff on top of that can just be too much. I feel you there. Do you find any joy in any moments of the day? Or activities? I definitely suggest being heard out by a professional. Feeling validated in how you feel can be empowering.",
                "Thank you for taking time to respond. I think hopeless sums it up. I love my partner and would never leave but I am so bored. I feel like our relationship is standing still and I am envious of all my friends moving on. \n\nThank you - sending a hug right back at you.",
                "Thank you for replying. I'm not sure where to seek help at work - I have friends I can confide in but I almost feel stupid considering where I work! I don't really feel like I can confide in my manager she's not a very caring person! Struggling to find joy in much at the moment. I am so bored. My daily routine is the same every day. Perhaps I do need to see a professional. Thank you again.",
                "Some work places, especially large work spaces offer counselling (often 3rd party). If you have an HR department they should be able to help. Don't feel stupid, hospitals can be the hardest place to get help and support sometimes! Like the humans who work there come low on the list. It also could be \"burn out\" or \"compassion fatigue\", may be intertwined with depression or PTSD. That's where I professional can offer an unbiased educated opinion. Best wishes"
            ]
        },
        {
            "tag": 50001,
            "patterns": "I know what I need to do in order to stop my depression but depression is stoping me",
            "responses": [
                "Start small maybe with persons close to you, then a friend if you can. If you can't do these things it's alright but talk to a doctor and explain what you are feeling. Hope this few things helps.\nHope you feel better",
                "Start with going to the kitchen, then the yard, the gate, the end of the street, etc. Small steps",
                "I can't offer a simple answer, but knowledge that you are not alone. I am in a similar loop of knowing what would be good for me and finding the Inkling of motivation to get it done. The one thing that helps me is small goal, break em as far down as you can. You think you should go to the park? Make a goal to just get out your door, sit on a step for a bit. It can feel like a monumental effort somedays, but you have to keep fighting. You may fail, but Fail is just the First Attempt In Learning. I write this as much as a reminder to myself as it hopefully is help to you. I sincerely hope things get easier. You are a strong enough person to have made it this far, stay strong.",
                "Yes, one thing I read, that does seem to really help, is to make sure you don't have \"a zero day\", do something towards what you know will help. You don't have to go to a live band performance or something really off the deep end, but do 'something', so you don't have a zero day, then you can work from that, and take solace that you got that far, and maybe tomorrow, you might go farther. That kind of thinking has been incredibly helpful in my worst days. I hope it helps and stay strong.",
                "There is a really great book called the depression book, but looks depression from the perspective of Zen Buddhism. \n\nOne thing that I took away from that book was non-judgment towards myself. It even has a suggestion, to spend some time completely giving into your depression and throwing yourself a depression party where you just do whatever you need to feel completely comfortable. \n\nFirst off forgive yourself and given to whatever you need to feel comfortable and take the smallest tiniest step possible. Maybe that’s washing your hands, maybe that’s coming your hair, maybe that’s Making your bed even if the rest of the room is dirty. Do the littlest thing and don’t put pressure on yourself, and then do the next little thing, and then the next. And even if you can’t do it all in one day, be kind to yourself and thank yourself for trying.\n\nAlso, this is something that is so hard for me but that I try to do often which is ask for help let a friend know that you weren’t feeling well, don’t complain just let them know you’re having a hard time and that it would be really great for them to go for a walk with you if they can make time for you. Or do whatever activity that you think will be helpful.\n\nYou’re doing a great job, and you’re going to get there!"
            ]
        },
        {
            "tag": 50002,
            "patterns": "Is this really depression.",
            "responses": [
                "Well, I’m just a guy who’s been suffering from persistent severe depression for 15 years now, but even so (especially so, really), I’d never try to diagnose you based on a paragraph online. You might be depressed. There are enough things in what you’re saying that I think it’s a possibility. But more than that, I’d say there’s enough in what you’re saying to think that seeing a therapist might be really helpful. I’m not saying that in a sarcastic way, I just mean, some of what you say reads like some pretty textbook issues, but again, it’s just a paragraph online and I’m just a guy with experience but not, you know, training. :) \n\nThink about trying to find a therapist you like. Think of it like trying a thing on for size. No one says you have to keep going, but just give it a try for a little while.",
                "I feel like therapy isn’t really a help. I mean you simply talk out your issues with someone. But of course I haven’t tried it yet so I’m talking about it with little experience. But it just seems like these are petty issues that talking to a therapist would be a waste of time and money.",
                "They’re not petty issues. You don’t have to live a life where you feel like everyone is lying to you or feeling like you’re inadequate. It’s not weakness to look for help, it’s fucking brave.\n\nThere are lots of different schools of therapy. Talk therapy is what you’re describing and it’s helpful for some. There are others that are focused on helping you find coping skills for stuff, or dealing with trauma, or on just learning how to be mindful of things, and not holding onto shit that’s dragging you down. \n\nAnyway, I don’t mean to sound like I’m telling you what to do. Just that, if you were at all curious, you might find it worthwhile to take a look into it.",
                "No it’s fine I don’t mind people giving advice on what to do. To me therapy just seems like a waste but I’m saying that again having never been to a therapist. A lot of the time I think some of this is just a passing thing but it’s been probably a year now and has just been getting worse.",
                "i kinda relate to what you're saying as it happened to me years ago, and i can kind of recognize it as the beginning of my depression. if i were to describe depression from my experience, it's mostly just an empty void that sucks the life right out of you and leaves you like an empty husk, with occasional episodes of pain , bitterness and anger (mostly at night when i'm alone with my thoughts). \n\nmy advice is that you find a friend or two that you can kind of trust and try to develop your relationship further and get real with them. it takes courage and you'll probably be hurt a few times in doing so but that's the price to pay and i think it is worth it from my experience. and most importantly and i can't stress this enough.\n\nplease forget about how your problems might be petty . they are problems none the less and must be dealt with. every one has his demons and it's better to cut them before they get bigger. my advice is to approach the with humility and deal with them the best you can but with the will to solve it and \"transform\" in mind\n\ni understand the how you feel about the \" you're perfect how you are \" comments. they're terrible thing to say, completely idiotic and nihilistic. anyone can think of 20 things that they can change about themselves for the better if they consider the question seriously for even a second. saying that you're perfect already is like saying that you might aswell give up trying to better yourself since you'll never be better than this. so try not taking their compliments to heart.\n\nthe last thing i can say to you and i cannot stress this enough. be honest with others and with yourself. and make that an unbreakable rule. and face whatever comes your way voluntarily and don't shy away from things or hide, because people are much stronger than they think they are, and approach things with the good of yourself and those around you in mind.\n\nand if you wanna talk about things i won't mind if you send me a message. best of luck bud",
                "For me personally when I hurt I feel nothing at all. I haven’t really felt any emotion for a long long time now and haven’t cried due to sadness in years despite some awful things happening in my life.  Tides of meaninglessness and futility wash over me and drain me of any will to exist, and all I want to do is anything to numb the pain of existential dread, or at least replace it with some sensation; food, drink, sex, physical pain, anything is better than feeling that way. I don’t do these things for pleasure, I do them because they expedite my suffering"
            ]
        },
        {
            "tag": 50003,
            "patterns": "I was shallow all my life and it has cost me true love. I am now incredibly depressed and don’t want to go on anymore.",
            "responses": [
                "You weren't shallow. When look at this, I see someone who's taking up new opportunities. You're 18 with a business that makes a lot of money, and you're an athletic guy who takes care of themselves physically. You have a lot to be proud of. I despise using this word, but if anything, you can say you were ignorant. We all have tremendous opportunities that pass us by and we didn't even realize it until we look back. It's great that you had this vision of what high school would be, and it sucks that you couldn't achieve it. But honestly, high school is probably the worst place to find true love, since most people haven't matured enough to understand what it means to be in a loving relationship. Although you didn't like the way that girl looked, the real reason you turned her down was because you didn't want to be heartbroken, and you wanted something real; you didn't care about having a fling or having someone on your arm. Believe it or not, that shows tremendous character.\nIt's super difficult to see it now (I'm still struggling), but high school is not real life. Now that you're entering a new stage in your life, the system is different. You're going to be meeting people interested in the things you are and who can appreciate who you are as a person, and not as sometime to hang out with at lunch every day. It's hard to look back and know that you'll never be able to take that girl to prom and homecoming, but when you meet someone who you love and really loves you, it won't matter. It's all about looking forward. It's a hard pill to swallow, but try and put that dream on the shelf along with your past dreams of being a rockstar or an astronaut. In the end, you'll see that you having a dream like that shows you who you are and what you value. You can't see what you'll become if you don't stay to watch.\nHope you feel better soon, I'm right here with you! ❤️",
                "Honestly I don’t think I can put that dream away. I dreamed about that last year so much and worked so hard it’s to difficult to live with the fact that I just threw away the opportunity to have it when it was right in my face. I look at the past in disgust and the future doesn’t look bright at all. I need some kind of way to forgive myself. Maybe I am a romantic but the whole high school relationship just sounded like the best a relationship could get. Maybe it has been glorified that way to me by movies but I want to have moments like that with someone more than I want anything else on this earth. I just feel as if it is over. I just can’t take my life anymore. I need to end it or something."
            ]
        },
        {
            "tag": 50004,
            "patterns": "I don’t know where/how to turn to...",
            "responses": [
                "It's sad to read what you said. I've felt like that my entire life. I'm not really good with words much anymore. I'm in shut down mode. But I hope you can find the help you need.. Sorry if this was a waste of time typing this. Just know you aren't alone. Guess I should tell myself that too."
            ]
        },
        {
            "tag": 50005,
            "patterns": "Need some advice...",
            "responses": []
        },
        {
            "tag": 50006,
            "patterns": "What do you do when the one person you thought would understand/help you can’t when you finally decide to open up?",
            "responses": []
        },
        {
            "tag": 50007,
            "patterns": "I got really drunk and told everyone how suicidal I am. How can I fix my relationships? (17F)",
            "responses": [
                "You seems a resonable person, I'm pretty sure you'll find your way of neutralizing depressed moods and behaviour, keep in mind that things can go two ways: in some time (days or weeks) you'll start to feel better and think \"hey I was very sad for X reason but now I'm sorta ok\" or it could go worse in wich you'll think \"everything is shitty, I hate the decision I've take and the things I've gone through/happaned to me\". Either way you'll get better with time, you'll understand more of your personality and you'll do things that make you feel good about yourself. I don't know the reasons of your depression, could just be your brain trying to find a balance in serotonine or maybe something bad happaned and you didn't face it fully, you just tossed that in a corner of your mind. Either way, if these bad and awful feelings continue to arise, please seek help by talking with your parents or/and your school teachers. It's positive that you opened up to your bf. Don't be afraid to seek professional help, they're here fot that exact reason: differentiate a unbalance in hormones from \"mental scars\". The sooner you fight, earlier the healing.\nPlease take my words as an advice, not as absolute truth. I don't know future better than anyone else on Earth. \nTake care of yourself, you'll get better :)",
                "We all battle the chemistry we were born with. Commonly, a lack of seratonin can cause depression. The good news is that it is imminently treatable. A doctor can explain your options better than I can. Blue skies await!"
            ]
        },
        {
            "tag": 50008,
            "patterns": "I am depressed and lost. Anyway to come back?",
            "responses": [
                "This is more the people you know in terms of landing a job, connections will enhance the theme of things when finding  job, it's okay to feel what you're feeling. That being said, trying to find a job preferably in another country would be best, the opportunities are endless plus most of my Indian friends especially from Mumbai have flown from India to pursue better career possibilities. You have that option\n\n&amp;#x200B;\n\nThe going gets rough sometimes, embrace the negative moments in life when you hit a brick wall, try not to run away from it, it'll only make it worse, I'd focus mainly on identifying the depression itself, you can find a job man."
            ]
        },
        {
            "tag": 50009,
            "patterns": "On going Painful and boring routine",
            "responses": []
        },
        {
            "tag": 50010,
            "patterns": "Advice for Self-Aware Depression?",
            "responses": [
                "I read something the other day that explained this. Bessel Van der Kolk's *The Body Keeps the Score* is a really helpful book for anyone experiencing depression or PTSD.\n\nBasically, my layman's understanding was that the right brain, being the alarm system, will always activate ahead of the left brain, which is logical and counsels you to question your emotional reaction.\n\nI have the same struggle, knowing that yes, I'm meant to excercise and think positively and all that shit, but just not able to do it.\n\nWellbutrin helped immensely. And now that I have breathing space I can actually see why I couldn't do it: I just had absolutely no executive function spare to make myself wash dishes or brush my teeth. It was all being used up on surviving; not crying while doing something mildly unpleasant; scolding myself to smile and react normally in social situations; trying to feel positive emotions while talking to my husband instead of just sleepwalking through my days in a vascillating haze of anhedonia or emotional collapse.\n\nIn short, sometimes medications are useful emergency intervention and a welcome respite.",
                "You're a champion, Babe.",
                "All of that makes a lot of sense. I'm actually on Adderall now, which is a stimulant that I think increases dopamine levels as well. I've heard good things about Wellbutrin so I might ask my new doctor about it. \n\nI have an immense amount of difficulty with making decisions for myself right now. I got my Master's in Psychology but I cannot figure out where to go next or what to do. I can force myself to take small steps, but it boggles my mind how paralyzed I am. I should re-read Body Keeps the Score.\n\n\nThanks for your reply, I wish you the best with your own struggle with this."
            ]
        },
        {
            "tag": 50011,
            "patterns": "Can anyone help me feel less alone?",
            "responses": [
                "Hey, I'm here to talk about it if you want. I don't want you to feel like this.",
                "Mathematically perhaps it would help you feel less alone to know I too, frequently contemplate my own death? I tried and failed to read that Camus book about suicide, the myth of Sisyphus that I've heard long story short he argues that it's the most rational question to ask yourself, and the best answer is to smile and amuse yourself as you walk your unbearable burden up the mountain, over and over.\n\nThe real problem, especially when you're talking to someone intelligent (and I get the sense that you won't want to agree with this, but you're clearly very much so, having thought out every aspect of this impasse you're at, and written about it at eloquent length), is that the only actionable advice, that dispenses with aphorisms about it vaguely getting better, is so simple as to be maddening and cliche. Take care of yourself, try to breathe or meditate, or at least go about what you mindfully. Exercise, blah blah blah.... I don't know, a lot of that stuff, once I get over how much more tortured and sad I am than your average guy, a lot of it does really help, but it's really hard to change your habits.\n\nI still decide that I want to live each day. And I fall asleep bewildered, wondering how I can improve, and sometimes it occurs to me I don't feel the weight as often as I used to. Good luck.",
                "I find myself slipping into the void and it feels impossible to pull myself out. It usually happens when im left alone, when I don’t have to go to work and have no plans with my SO. It feels like im cornered and have to face the reality that I haven’t, and probably never amount to much. I really relate to your post about staying in bed all day watching videos when you’re not scheduled for work. I relate to having no motivation or interest in learning anything or trying anything new. I relate to how it comes and goes. When it comes, I feel doomed and like a waste of human life. And when it goes I feel guilty and question if i just made up the depression in my head and i’m just being dramatic for attention.. \nI’m 19f I may not have much useful guidance to offer but feel free to message me if you want someone to talk to."
            ]
        },
        {
            "tag": 50012,
            "patterns": "Is it depression or is it just that my life suck?",
            "responses": [
                "need monies for therapy in the greatest country in the world"
            ]
        },
        {
            "tag": 50013,
            "patterns": "I am depressed and dont know what to do.",
            "responses": [
                "These things can be very difficult to talk about, especially because most people think since they're a good person they'd recognize depression in someone. It's hard to explain that nothing is wrong, and you still feel horrible which is why you're saying it's a problem.  \n\n\nI'd suggest looking into how to see a psychologist or psychiatrist in your area to get checked out, I'd also suggest trying to gather some youtube videos or reddit posts that seem to resonate with you. It can be hard to explain on your own, so I found finding other sources that helped put things into words was very helpful for me for explaining to others.  \n\n\nWhat I liked about seeing a professional was that they were removed from my social circle, so when I was being honest about some of the fucked up thoughts I was having, it stayed between them and me if that's what I wanted.  \n\n\nI was miserable most of my life even though technically things around me were good, and even today it's hard to explain to some people that I was still depressed because none of that stuff matters for my clinical depression. It wasn't about how great people were to me, or the opportunities I had. I'm on medication now and I finally don't feel miserable all the time for no reason. I'm not saying that'll be the route you take, but I'm definitely glad I got seen because all the well meaning people in my life could not help me, and they (and also myself actually) couldn't understand how something external was not the problem.  \n\n\nI'm not saying your family won't be supportive, but there can be a big communication gap with this stuff."
            ]
        },
        {
            "tag": 50014,
            "patterns": "I need help",
            "responses": [
                "Hey man. \nI get what you’re going through and hope all works out. It’s not the end of the world, so just take it a day at a time. You have a place in this world so make it count, football maybe not be your forte, but there’s so much more to life than football. It’s what you make it, truly! \nHope all gets better.",
                "Please feel free to vent here. Or somewhere else online. Life can be painful. Just wanted to tell you I hear you.",
                "Thank you for the support I really appreciate it and I'll try to get better",
                "You'd be close to the first person I've heard that from, it feels better knowing some people will listen to me for once",
                "Anytime. You can reach out to me if you want.."
            ]
        },
        {
            "tag": 50015,
            "patterns": "Fuck I am depressed today",
            "responses": [
                "Me too.  Know your not the only one.",
                "hope you feel better!",
                "Me too man. Some days are ok. Others, getting up is hard. Today is the latter.\n\nI'm just so tired of this cycle you k ow? This constant ebb and flow. It hasn't gotten better. Sometimes I lose hope that it will.",
                "yeah...i've been doing better i thought...for the most part.  but last couple days....i wake up in the afternoon...feeling full of sludge.. my brain feels damaged...\n\nand i don't know what it is that i even want anymore \nmoney?  love?  freedom?  i feel  like a donkey that is losing interest in the carrot",
                "hope you're having a better day today.  do you have those sometimes?"
            ]
        },
        {
            "tag": 50016,
            "patterns": "i know why I am depressed, feel utterly helpless to fix anything at all",
            "responses": []
        },
        {
            "tag": 50017,
            "patterns": "Close to doing my senior year again",
            "responses": [
                "You take a breath and focus on getting yourself well. You focus on one thing that you can start to change now and look at what you can change for yourself.  You mention your mom denies you a therapist but have you told her all of this? Does your local hospital have a support group you can attend?",
                "I have a very busy schedule as of right now. After I sent this message I kinda had a breakdown and was sent to the social worker where they gave me a youth therapist. I can only see them for about 20 minutes once a week but it helps for as much as it could you know."
            ]
        },
        {
            "tag": 50018,
            "patterns": "I don't know what to do",
            "responses": [
                "From personal experience I felt like a failure,  had low energy, felt hopeless, lost interest in my favorite things such as school and tennis, I’d have mood swings, get irritated very easily, couldn’t concentrate on one task, and thoughts of suicide. Just look into those signs, and if you have any of them and having been feeling down for two weeks or more it’s likely you have depression and I would go to the nearest mental healthcare facility and schedule an intake. I hope that everything turns out okay for you and you can start your journey towards and positive, and more happy life.",
                "https://www.psycom.net/depression-definition-dsm-5-diagnostic-criteria/\n\nHere is the diagnostic criteria for depression, may help to look at it. You could also go see a mental health professional and tell them about your symptoms, they can evaluate and diagnose you"
            ]
        },
        {
            "tag": 50019,
            "patterns": "I often get bouts of sadness. My eyes feel heavy like I want to cry, but I can't. I lose all motivation to do anything. Am I depressed? Should I know why?",
            "responses": [
                "I feel exactly the same way. You’re not alone. My wife thinks I don’t love her either but this depression is much deeper than that",
                "Everyone who gets depression will experience it to varying degrees of sameness and difference. I myself rarely get the sad feeling, my funks usually are a complete lack of any emotions or care at all. I have experienced the sad depressed a few times though and it usually revolves around me spending far to much time over analyzing all my mistakes and short comings until I've convinced myself my wife would be better off without me. \n\nMy advice is this, don't try to fix the depression, fix the triggers. I worked construction, thought I loved it, but I realized I was always miserable so I switched jobs. My wife says I am far happier, my bouts of deep depression are rare and since I have a doctor I see who can issue me mood stabilizers when I do have those bouts, they are short lived. Depression can be bio chemical or situational and unless you are going to go get a full medical work up to figure things out, trying to identify which is yours can just make you more depressed. I do recommend a good psychologist, it can feel embarrassing to have one but the rewards are worth the discomfort."
            ]
        },
        {
            "tag": 50020,
            "patterns": "I think I've finally figured out how to tell when my depression is acting up and things I can do when it does.",
            "responses": [
                "Its great that you're able to make the distinction! This is pretty important.",
                "This is awesome and will help you manage for years to come. Keep paying attention to your symptoms and what makes it better/worse.",
                "It took a LONG time because I also have ADHD, so sometimes the symptoms can be somewhat similar.",
                "Teach me senpai! *-*"
            ]
        },
        {
            "tag": 50021,
            "patterns": "Boyfriend and I both have depression",
            "responses": [
                "I feel your pain. My wife and I both suffer from depression and anxiety. The best thing you can do is seek professional medical help. Whether it means getting put on medication or having therapy sessions, nothing has helped us more than speaking with a doctor. \nBest wishes and stay strong. Life is precious.",
                "I have been seeking  help but he really doesn't want to and it feels like it holds me back sometimes. Is that normal?",
                "Yes. My wife is 5 years older than me and went throw a lot of harder life experiences than me, so she had been on medication since before we met. I refused to seek help for a long time because it made me feel like less of a man to have to have some outside help to feel “normal”. What really helped me was having the uncomfortable conversations with her, breaking down in tears and finally calling a doctor. \nMaking the appointment was one of the hardest phone calls I’ve made and actually showing up to the appointment was even harder. \nThe real push for me was how much I care for and respect my wife’s opinion. The fact that I was making her sad and scared helped me fight through my own fear of accepting help. \nI’m almost at the year mark since I’ve been put on antidepressants and I’ve never felt better. It was a really rough journey to get where I am now but that one appointment saved my life.",
                "I’ll preface this with what I’m about to say is my own personal beliefs. \nIf it gets to the point where you are actively trying to better yourself, while at the same time trying to help your partner better themselves and they only drag you down with no sign of improvement, leave. Relationships need to have an equilibrium. If the scales stay tipped in either direction someone is going to suffer. \nAt one point I was the one dragging a partner down. She wanted me to get help and I refused but because she loved me she suffered for 3 years trying to save me. She finally had enough and left me. I was devastated and spiraled harder and lived in misery for awhile. All the while she fulfilled her dreams, became a nurse, met another guy and is currently living happily. \nSometimes you have to hurt the ones you love to better yourself. I am fortunate enough to have also ending up extremely happy (it was a 5 year journey) and with the women beyond my wildest dreams. \nI don’t know if my long winded replies are of any use to your situation but hopefully they help in some shape or form.",
                "I’m in the same boat, hold in there"
            ]
        },
        {
            "tag": 50022,
            "patterns": "Depressed child",
            "responses": [
                "If you are close with your parents, then I’d advise speaking with them (if you haven’t already) about what you are feeling. Things can seem worse when you are younger and feel a little powerless or uncertain about life. Getting help early could allow for things to get much better moving into adulthood. Therapy now could mean you can have a good chance at contentment in life going forward. I never use the word ‘happiness’ as it’s a fleeting thing. Happiness comes and goes relative to what we are experiencing in the moment. What people are really striving for is actually contentment, whether they realise it or not.\n\nSpeak with someone you trust, or  perhaps a doctor directly, if you feel uncertain about telling a parent. Things can get better. Being young can be really tough, but a lot of the time, adulthood brings confidence and determination, hobbies, relationships, goals, etc that can bring a level of contentment and makes life worthwhile. As I say, getting the right help now gives you a good chance at a contented life.",
                "I am 11 as well and am depressed to u can vent to me if u like i might understand",
                "I felt like this at your age. For me, these feelings never went away until I began getting help. But for the longest time, nobody took me seriously. \nI’m deeply sorry that you feel this way, because I know how hard it is when they tell you life will just magically get better.\nPlease don’t end your life. I know it feels like you’re wasting it, but there is literally so little you can do as an 11 year old. There’s a world waiting out there for you in the next few years. People you’ve ever met, sights you haven’t seen, things you haven’t gotten to do. I definitely know just saying that doesn’t help, but I hope you can keep that in mind when you think about suicide. \nIf these thoughts get even more intense, don’t do what I did and hold back on your parents. Be vocal. Tell them exactly what you’re feeling. They should take care of you. You’re worth it.",
                "Hey I’m a 12 year old and I know what it’s like. I’ve been depressed most of my short life and all I can suggest just listen to certain types of music that give a vibe of some type. The ones I listen too are Neffex, and things of the such. That’s all I can do to help.",
                "Omg thank you I learned that people other than my parents care about me thank you bro/sis",
                "Yea so the thing is I am just scared to talk about this to my parents",
                "But thank you for your help I will try my best for you",
                "Vent you?? Can you clarify what you said (I know I sound like a idiot )",
                "I am scared to talk to my parents about this"
            ]
        },
        {
            "tag": 50023,
            "patterns": "This past year has been my worst, I need more help",
            "responses": [
                "Hey! I feel ya!!!! The good news is that you can beat your depression!!! \n\nMy partner had depression for many many years!! He was on meds for a long time, he went to counseling (I even went with him to know better how to help him and to learn to not let his depression get to me - because it certainly does!)\n\nSo here is what worked:\n1. Regular exercise. It doesn’t need to be every day. Start with a commitment of going to the gym once a week. And stick with that! Don’t expect miracles and give up after 1 month because you are not feeling happier. \nAlso, in order to be effective, the exercise needs to elevate your heart beat for 30 minutes or so (therapist recommendation). We enrolled in a cardio class, so we stay more motivated than walking in the boring treadmill. \n\n2. Meditation/mindful classes. Game changer! It really helps and there are tons os studies proving that it can be as effective as meds!! This was another of the therapist’s recommendation. \nCan’t find one in your community? There is tons online! \n\n3. Healthy diet. Tons of veggies and fruits. No soda! Cut the crappy sugar! ;-)\n\n4. Take a vitamin D supplement. Go on short walks 2 or 3 times a week. Keep active! \n\n5. Books: \n- [The Happiness Trap](https://www.amazon.com/Happiness-Trap-Struggling-Start-Living/dp/1590305841/ref=mp_s_a_1_1_sspa?adgrpid=57750084362&amp;hvadid=274752943398&amp;hvdev=m&amp;hvlocphy=9058761&amp;hvnetw=g&amp;hvpos=1t1&amp;hvqmt=e&amp;hvrand=12424535978257033291&amp;hvtargid=kwd-298737942387&amp;keywords=the+happiness+trap&amp;qid=1555950654&amp;s=gateway&amp;sr=8-1-spons&amp;psc=1) \n- [Creating True Peace](https://www.amazon.com/Creating-True-Peace-Violence-Community/dp/0743245202/ref=mp_s_a_1_fkmrnull_1?crid=11S1WUHU2S8U4&amp;keywords=creating+true+peace+thich+nhat+hanh&amp;qid=1555950724&amp;s=gateway&amp;sprefix=creating+true+peace&amp;sr=8-1-fkmrnull) \n- [The Subtle Art of Not Giving a F*ck](https://www.amazon.com/Subtle-Art-Not-Giving-Counterintuitive/dp/0062457713/ref=mp_s_a_1_1?crid=YLX6O9I23CF9&amp;keywords=the+subtle+art+of+not+giving+a+f---+mark+manson&amp;qid=1555950771&amp;s=gateway&amp;sprefix=the+sub&amp;sr=8-1) \n\nI hope this helps, OP! I can give you more suggestions, but I don’t want you to feel overwhelmed! I really really hope you will find a way to get better! ❤️",
                "1. Thanks. I have been trying getting back into exercise, which has been really hard because when my heart rate increases, I can't breathe and I have a panic attack. Like I said, it's really bad right now, so a lot triggers it. I also went to the Dr. and said my thyroid feels big which could be bringing on the feeling of not being able to breathe when exercising, so that's being worked on too. \n2. the mindful meditation, works sometimes, other times it is pure torture, my mind becomes obsessive and will work myself into a panic. I try that first though, sometimes it works, sometimes it makes it a lot worse. I did a salt float therapy, which was great meditation, but expensive. \n3. My diet is improving, when it was real bad, I was just accepting that I was actually eating, no matter what it was. \n4. I have always been on heaps of Vitamin D, I've always been so so low\n5. Books, I listened to the Subtle art of Not Giving a F*ck, as I tried to lay and calm at the same time, it made it worse, I'm not sure why, but I can try again. I wen't a little crazy and rented every single mental health and coping book from my library over a few months and got too overwhelmed because I can't comprehend the amount of info. My therapist says I need to rein it in back to what is in my immediate life, not search for every single possibility because I just can't process that amount of information right now. So when I go off and spiral I have to remind myself, \"Bring it back in, that's going too far\"\n\nI also just wake up with the feeling of fear, so just waking up triggers it, which is intense and really hard to have the time to meditate or do some things before work except take half a xanax and try and calm once I'm at work."
            ]
        },
        {
            "tag": 50024,
            "patterns": "I'm not good at talking, but...",
            "responses": [
                "I am not a veteran but I am pretty sure I have PTSD from childhood stuff and stuff from the last few years. I have couchsurfed  a lot myself, do you have family you can crash with? Message me if u want"
            ]
        },
        {
            "tag": 50025,
            "patterns": "I need help",
            "responses": [
                "Hi friend, I'm so sorry that you are being bullied so harshly. Nobody deserves what you're going through. I encourage you to reach out to your parents or a counselor or teacher at school. I know it's scary to ask for help but the earlier you can address the problem the easier it will be. Sometimes when I have trouble telling someone something I write it down for them. Do that if it's easier. Middle school is hard for a lot of people, and puberty really sucks. Don't go through it alone, even if you just make friends with your teachers. I was friends with the janitor. He was a really cool dude.\n\nAnd please don't hurt yourself, friend. You aren't a burden. You are loved.",
                "That is awful what the horrible bullies are doing to you, no one should have to suffer that, you need to tell someone or they may not stop.. please tell a teacher or your parents or another adult.. you do not deserve to feel depressed.",
                "Go talk to your parents, guidance counselor, teacher or school principal. Heck, talk to all of them. God Bless you."
            ]
        },
        {
            "tag": 50026,
            "patterns": "help",
            "responses": [
                "Please ensure you have selected a flair for your post. Flairless posts do not receive as much attention as flaired posts do; we may remove posts without flairs.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/depression_help) if you have any questions or concerns.*",
                "I know what your going through. When I was younger I was constantly bullied in school (middle school), by all of my cousins (and not in the fun way. In the “they treat me like crap because they can” way). My family life is not at all healthy. I have problems that were caused by my family life. I myself also have health problems which suck. They really do (including anxiety. Not so depression but I have had depression last a long time but that was when my family life was extremely terrible. It’s ok now, but a few years ago it was awful). But I keep moving forward. And I know it’s hard. There are days that I want to end it. Where I just think I’d be better off dead. And these aren’t just thoughts that happened years ago. These are thoughts that have happened in the past week. Through my high school I had no friends. And the people I thought were my friends used me and I found out way to late. I wasn’t at all what you’d call handsome. I wasn’t fit. I wasn’t strong. I was just me. And I hated it. I wanted to end it. I really did. But I didn’t  because of the thought life gets better. And I know you may not believe it now. But it does. My life is way better than it was back when I was 15/16/17. And I’m only 19. I’m so happy now. I promise you life will get better. No matter what your going through. A lot of us do have health problems so know that your not the only one. (For example, I have a degenerative knee cap. I think that is what’s it’s called. It’s been so long when I first found out I forget. I have messed up my back to where I could be paralyzed if I’m not careful and a few more health issues). So know that your not the only one. We all have parents who don’t understand what we’re going through. Mine certainly don’t. Just know that we know what your going through. And know that life will get better. And it may not seem like it now. But from my experience, it does. And I can 100% promise you it will. Please do not end your life. Please push through. I hope I am able to help in some way. If you ever need help with anything, you can PM me. I’ll be more than happy to help.",
                "Hey girl, I see you. I’m really glad you’re posting here because that shows you really want some help. I can offer some advice or just share a little about my life, just something so you know I hear you. \n\nI’ve suffered with depression and anxiety since I was a pre teen, and I say always say suffered because depression will take you to some dark places and it is a STRUGGLE. I’m not saying this to make you feel like you might as well give up or anything like that, just to be crystal clear. I just want you to know that living with and managing this stuff is possible but you have to fight like hell and never let your guard down. You can take this as a burden you are saddled with or you can take it as a purpose. You know a lot of people go through life with no real purpose, but here you are, all set up with a purpose for the rest of your life. \n\nYour purpose is to not let “it” win. You can’t. You didn’t ask for this but here it is, trying to leech all of the good out of life, making you feel unloved, taking your motivation and your joy. It’s not fair but you don’t have to take it. Fight it with all you have. I mean it. We weren’t put on this earth to feel like that all the time and if our brain chemicals tend to disagree we have to work around the little messes they make. It’s entirely possible and if I can do it, you can do it. \n\nSo here’s what I can tell you: \n\nDon’t ever let anyone make you feel bad for having mental health issues. Some people are really misinformed and some are just mean spirited but they can only make you feel as bad as you let them. Imagine making someone feel bad for having diabetes or lupus, it sounds ridiculous but people can be assholes. Don’t be afraid to let them know they are being an asshole either. And don’t YOU ever feel like you are less or broken or weak because you struggle with your mental health. You didn’t do anything to cause this. \n\nTry antidepressants. I know some people disagree with this and you will make the best choice for you but - it’s 2019, they make medicine for this stuff. It’s not a perfect science but considering all you have to lose without trying to treat it, I think the benefits outweigh the risks. \n\nBUT, don’t let a doctor just give you antidepressants without agreeing to monitor and adjust those meds every couple months, like I said not perfect and honestly a pain in the ass, but you’ll feel better. \n\nDo not just take meds without counseling or therapy. Sure, the meds work on your brain chemistry, but combining them with talk therapy increases the efficacy of the drugs. You can take therapy breaks and still take the meds, but get yourself a good, solid foundation first. \n\nGo to counseling/therapy. It’s a lot of hard work and costs money you’d rather spend on something else but you’ll be surprised how totally off your thinking can get. Someone who can help you reframe the way your brain looks at things will help more than you think. \n\nSwitch counselors or therapists as needed and don’t feel bad about it. You’re going to have to like and connect with this person to get any real value. But therapists are just humans and not all humans are compatible, so just be very patient and find one you click with. It’ll work so much better. \n\nEat well and take vitamins &amp; supplements, drink plenty of good old water and exercise as much as you can. Get the best possible sleep you can every night. This took me a long time to come to terms with, but once I did I started feeling a lot better. Who knew that my struggling brain needed better fuel than Taco Bell &amp; Pepsi to function and that the symptoms of dehydration can mimic a lot of mental health issues? And just FYI I SUCK at exercising and I’m not saying train for a marathon, just do something you enjoy as frequently as possible. \n\nTake a social media break. If you are bombarded by pics of what seems to be everyone else’s “perfect” life, it’ll mess with you. Keep in mind, all that perfectness is just on the surface. Even during my worst times, where all I could think about was swallowing all my pills, I posted every selfie I could to prove how “happy” I was. It’s all a lie. \n\nDon’t self medicate. Just don’t. We Americans man, we know how to kill our feelings and there are 100 ways to do it.  Booze, pot, video games...whatever we need to check out, it’s pretty easy to get. I’m not saying this because I am some saint or anything, I’m saying it because I’ve tried all of it and it doesn’t help. Seems like it for just a minute and then everything gets worse. Depending on what you get into, you could slip and saddle yourself with an addiction on top of the other issues and trust me you do not want that. Not only will it probably set you back years in trying to feel better, addiction can steal everything from you. And when you have nothing left it will go after your family, friends and anyone around you. I really don’t want to sound preachy, but it is SO EASY for people like me and you to do this and I’ve lived enough years to see some of the worst shit addiction can do and I do not want that for you. So just be so careful around drugs and alcohol.  There are people who can mess around with them with no worries, but if you’re already feeling as bad as your post says on the inside, it’s just too easy to slip into something you might never come out of. Just keep your guard up ok? \n\nGo easy on yourself. There are going to be some shitty days and if you can’t get out of bed once in awhile, stay in bed if you can. If a week has taken everything out of you just to get through, who cares what your house/room/car/whatever looks like. That shit can wait and sometimes you have to rest without feeling guilty. \n\nSounds so easy right? Oh yeah, I’ll just get up and do all that right away! IGET it. When you’re depressed it’s like wearing 100 lb weights on all your limbs. Everything seems gray and the stuff you used to like doesn’t matter and you are just so tired. There’s been months where I only made it from the couch to work and back and nothing else. Months. Where the only thing that would bring me any comfort was thinking about dying and how I could just end all of this. Where I barely showered, ate whatever I could pick up at a fast food joint...just laid there. I get it. I got all the advice like “Just go outside!”  Sure, I haven’t had the energy to brush my teeth in 3 days but I’ll get right on that.  Just start with one baby step. Just one. Call your doctor and make an appointment. Show up to the appointment. Be honest at the appointment about how bad it is. Tell someone what’s going on and if you don’t have anyone in your life you can talk to, talk to the peeps in some of these subreddits. DM me anytime. Posting here was a good baby step! I know everything is so exhausting right now but I promise you if you do one thing towards getting yourself better it will lead to more and more steps and little by little you’ll get better, not perfect, but better. Remember people like you and I have to have a little bit of extra fight in us because of our purpose. You can do this. Read that again. You can do this. You can have a life with good times and friends and all the things that come along and you are going to learn how to handle the bad stuff in a different way. Just fight with me, ok? \n\nI’m here.",
                "Hey mkletmedie,\n\nMy turn for a way too long message. You seriously don't have to read all this, the others already said a lot of helpful stuff. Either way, here we go OP &amp; anyone else reading this, I hope this helps.\n\n\n\nFirstly, even when we feel like we're burdening others, whether it's because we're depressed or need someone there for us, usually it isn't that black &amp; white.\nWhen it's someone who cares about us, people likely are willing &amp; want to go out of their way to help/comfort us, it's how we can reassure one another that we're there when things are hard. If it's with someone we're not quite as familiar with, some people can be everything but helpful, but other times people like to help simply because they know what it's like to struggle, either like we do or similiarly, or they do it out of the kindness of their heart.\n\nOur environment can seem very cold &amp; dark, it is, but not all of it. There may not be many, but there are good people. And those types of people don't feel burdened, they feel trusted &amp; warmth because we let them in, let them help us. It's part of having healthy relationships, a concept that I struggle with as well.\n\n---\n\nI'm sorry your parents are so tough on you, I know what you mean, but when it comes to forgetting your social anxiety, overthinking, &amp; depression, that is everything but fair. They should be more considerate &amp; supportive, they're doing the opposite. I don't know how open or comfortable you are with talking to them, but mabe taking one of them aside or so &amp; trying to explain to them a bit what the screaming &amp; other stuff does to you can help enlighten them. I know that would be difficult, but hopefully it wouldn't make it worse, it might be worth a try. It's suprising how much a honest conversation can do, but both sides have to be open to that.\n\n\nThere is no absolute way of knowing that life will get better &amp; that you will be happy. Life is a cold heartless bitch that takes &amp; rarely gives something in return. It's chaotic. But it does have it's ups &amp; downs, mostly our lives oscillates between those, things don't stay bad &amp; good things &amp; people come and go. Losing people... it's another subject, perhaps, but not everyone is meant to stay, the same way not all feelings &amp; situations will stay forever. Some things will stay, some of the unhappiness, some of the emptiness, a few suicidal thoughts....\nBut that doesn't mean we can't fight them. I know you're probably tired of hearing this, or just combating these things in general, but every time we try to push back a little bit, confront those dark thoughts &amp; feeling, every time we make just a little bit more progress. And that's the best we can do. Slowly but surely. Of course that doesn't guarantee things will be better, but it means that things will be able.\n\nAnd then there are things &amp; people &amp; events that make taking those steps towards improving our situation harder. Like that creepy, disgusting old man. It might happen again, there seems to be no limit as to how many people can't keep their mouths shut, hands to themselves, &amp; use common sense &amp; respect other people. Assholes like that exist. But that doesn't mean we or our future is defined by people like them.\nBeing alone, or feeling like we are, does that too. Both are valid &amp; make every challenge we face harder.\n\n---\n\nI know you think that it's impossible for anyone to like or care about you. I feel that way too. But even with our imperfections, we're still loveable, still worthy of being cared about.\nOthers in the past, present, &amp; future may treat us terribly. Rarely it's justified, but sometimes people just don't get what it's like to be the way we are. We are different, in some ways. But that doesn't mean we're broken or messed up. It doesn't mean we aren't human or have the same rights. We're still who we are &amp; that means that despite everything, we aren't worthless. I know you don't believe me, I barely do myself, but I know that you &amp; I have done things that have meant something before. Our actions aren't as meaningless as we think, we influence the people we are around everyday, &amp; no, I don't just mean negatively.\n\nI'm sorry your friends &amp; sister didn't ask if you want to join them &amp; that your parents were so insensitive. It isn't you being emotional or anything, it sounds very familiar &amp; I'm guessing these types of things have been happening a lot recently &amp; it's built up to you feeling like this. Regardless of whether we have people who care about us all around us, very few or them, or next to none, we can still feel very, very alone.\n\nI hope really badly that you're parents are somewhat supportive or that perhaps you have someone to talk to, even though it doesn't sound like it. Friends. It's a difficult topic, but even if you don't have any, that doesn't mean your worthless or broken or unattractive. It just means you struggle, like others, to perhaps forge new connections. I know it's not easy, ever since I was a child I didn't really have anyone who was there, &amp; even as I grew up, I felt as though every left me eventually, if we connected to begin with.\n\nSolitude, whether like that or in another form does things too us, but even then it doesn't ban us from ever making important relationships with beautiful people.\n\n---\n\nI know how that sounds, but even with the mental illnesses &amp; other factors, you aren't undesireable or unloveable. You aren't. This isn't convincing, but it's about who you are on the inside, despite all these other things that may make up part of you, but absolutely, definitely not all of you. These things only define you if you let them, I know there are other much more defining features.\n\nEven if you're depressed &amp; have anxiety &amp; these other things, you can still be a charming &amp; an amazing person who is capable of achieving her goals. Yes, it makes things more difficult at times, but that does not make them impossible.\n\nI'm not always/often sure, but I hope &amp; think that all this pain we endure will &amp; is worth it. That despite all our hardships &amp; the suffering, the pain &amp; endless loss, that we can make the best out of what we have &amp; perhaps somehow, eventually, with a lot of effort that won't always be there, be able to be happier &amp; do/have what we want.\n\nYou already said you're on meds, but I think talking to someone would be critical to helping you feel a little better. At the very least finding a healthy way for you to voice &amp; confront your thoughts &amp; emotions. I know, I know, therapy &amp;/or being honest about we feel can be terrifying, but seriously, if we aren't will to accept something has to change, we can't move forward.\n\nYou are absolutely more than welcome to reply to this (write me) incase this isn't a throwaway or something, if you need someone to talk to I'm here. I would be more than happy too, you wouldn't be bothering me at all. I'm here.\n\nYou don't have to be alone. Reaching out to someone, whether online or irl can be really helpful. You can always ask for advice or someone to talk to on other subreddits if you like:\n\nr/depression\nr/helpme\nr/KindVoice\nr/offmychest\nr/SuicideWatch\n(etc.)\n\nI'm sorry things have been so hard for you, in general &amp; especially lately. I wish you the best of luck, I hope this helped, &amp; don't hesitate to let me know if I can do anything else."
            ]
        },
        {
            "tag": 50027,
            "patterns": "I don't know what to think",
            "responses": [
                "Please ensure you have selected a flair for your post. Flairless posts do not receive as much attention as flaired posts do; we may remove posts without flairs.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/depression_help) if you have any questions or concerns.*"
            ]
        },
        {
            "tag": 50028,
            "patterns": "My school life isn't helping my depression",
            "responses": [
                "Please ensure you have selected a flair for your post. Flairless posts do not receive as much attention as flaired posts do; we may remove posts without flairs.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/depression_help) if you have any questions or concerns.*"
            ]
        },
        {
            "tag": 50029,
            "patterns": "Anybody know how the heck to stop being emotionally numb???",
            "responses": [
                "Please ensure you have selected a flair for your post. Flairless posts do not receive as much attention as flaired posts do; we may remove posts without flairs.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/depression_help) if you have any questions or concerns.*",
                "It's a symptom of anxiety/depression, work on your overall condition. Also, novelty of things can shake you up, while slow-paced choices for relaxing like books and regular walks can make your senses sharper by decreasing pressure on them.",
                "k thxs for letting me know\n\n&amp;#x200B;"
            ]
        },
        {
            "tag": 50030,
            "patterns": "How do i tell my parents i am depressed and have anxiety",
            "responses": [
                "Please ensure you have selected a flair for your post. Flairless posts do not receive as much attention as flaired posts do; we may remove posts without flairs.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/depression_help) if you have any questions or concerns.*",
                "Hey, man. Sorry you're depressed. If you go to school, tell a trusted teacher or counselor first. I know that seems weird, but if/when they believe you, you might be able to schedule a meeting with you, your parents, and that adult. Unfortunately, your mom and dad may not believe you, buy they're more likely to believe another grownup. \n\nAnd remember, even if your parents don't believe you or think you're overreacting, you're not. A kid can have depression. A kid can have anxiety. Your feelings are 100% valid, no matter what anyone else says. Good luck.",
                "Thanks for the advice but i don't trust any of the teachers (or most adults in my life) the school counselor makes my anxiety worst. But my friend have made a plan for them to report to the counselor that they think i am depressed but i keep backing out because i get way to anxious. Thanks anyway though",
                "I’ve had depression and anxiety since I was 4, but didn’t start getting treatment for it until I was 19.  I wish I had gotten help sooner.  Sit your parents down and tell them you have something serious to talk to them about and tell them, don’t leave out the fact that you are thinking of suicide.  If you need your friend with you for support have them be there when you tell your parents.  If it’s too overwhelming to say it aloud, write them a note and have them read it in front of you.  Or if that’s too overwhelming, write them a note and put it on the fridge or somewhere you know they will find it.  ",
                "Try telling your friends to tell your parents no matter what you tell them afterwards, it's what I did and my parents didn't believe me but it might work for you",
                "I am too scared to talk to my dad about it because talking to him makes me anxious i wan't to bring it up to my mom but i am not to sure when I feel like i should tell my mom that i when she thought i had a panic attack it might have been a anxiety attack and tell her the rest",
                "My 2 friends who know about my depression and anxiety and me are thinking that if they tell the school cousnelor she can tell my parents but i keep backing out of it becuase it makes me WAY to anxious",
                "I know it's super hard but if there good friends they'll do it for you cause even do your suffering in the moment it'll help you in the future",
                "Just tell your mom then.  She can discuss it with your dad in private later.  You might need therapy or medication or a combination of both.  I know there’s still a lot of stigma around mental illness, but you have nothing to be ashamed of.  It is just as valid as having a physical illness.  If you had a broken arm you would need to get it fixed.  Mental illnesses don’t go away on there own, you need help to fix them.  ",
                "Ik but they both r scared of her and i am not even sure i will live long enough",
                "Ik but  they always think i am okay and they will be teared apart when they know they didn't see they daughter has been struggle for so long and i also don't want them to think i don't trust them, and also they will be brought down and will stress more and feel like terrible parents ",
                "Just think how much worse they will feel if you attempt suicide or succeed in killing yourself.  They’d never get over that.  ",
                "Ik but i just want to end the suffering",
                "I know it’s your anxiety that’s making you worry about how your parents will feel, but they are the adults they can handle their feelings.  You’re 11, your parents feelings aren’t your responsibility.  They are the parents, it’s their responsibility to protect you and take care of you.  ",
                "Maybe you could tell a teacher you trust and cause that unlikely maybe the parents of your friend are could help you if you parents don't understand",
                "Ya my anxiety has stopped me from doing many things but if i tell them it would be my fault they feel horrible because i told them but you are making me relieze things",
                "You never get over a child’s death and as a parent they will always feel like a failure.  It would destroy them.  Suicide is traumatic.  They’d probably get ptsd from it.  ",
                "oh mean i guess but i suffer A LOT\n\n&amp;#x200B;",
                "I have schizophrenia, bipolar disorder, borderline personality disorder, depression and anxiety.  Is life hard?  Fuck yeah it is, but it can also be really beautiful.  I’ve tried to kill myself twice.  I’m so glad I didn’t succeed.  I’m in therapy and take my psych meds every day.  It’s helping me deal with all of my issues.  My therapist said that life gave me a shitty hand, but I had to learn to work with it.  That’s what I’m doing.  I’m 33.  6 months ago I was so anxious and paranoid I would not leave the house without headphones on.  I no longer need headphones to leave the house.  Therapy saved my life.  ",
                "i dont trust my teacher but thxs for the advice\n\n&amp;#x200B;",
                "Thxs for that story i am so glad for you",
                "I really recommend group therapy for you.  It helped me to be around other people with similar issues, plus they teach you therapy tools like a class.  I know they have different group therapy for teens and young adults.  I wish I had been in one when I was a teenager.  ",
                "I would do that but i hate groups it makes me super anxious",
                "I have to go as part of my therapy.  I sit there holding ice in my hand to calm me down and not make me get too hot from being embarrassed.  I made a close friend though, so I’m happy I was forced to go.  You’re young though and may have to work up to being ok in group.  Individual therapy would be better to start with.  If you don’t like your therapist get a new one.  I didn’t click with my first 3 therapists, but I love my current one.  You have to click inorder for you to be comfortable and want to go.  ",
                "Thank you so much for this information i will think about this",
                "Please just tell your parents and get help.  You don’t have to suffer your whole life, you can learn how to live with your anxiety and depression so it doesn’t consume you.  ",
                "Good for you for wanting to get help! It's really important that you do it sooner than later. It is really difficult to get these problems away on their own. The truth is that there is no easy way to tell your parents, because of course it will be emotional. But that's actually the first step toward recovery, coming to terms with it and feeling the emotions that come with it. The best way is to talk to them when they've had an average day (not a bad one) and when they have time to sit down and talk with you in a calm setting. Just tell them how you feel, and how you've been feeling that way for weeks. Tell them how it's been affecting you. Let them know you want to handle this issue now. Remind them that you trust them enough to tell them about this issue. If they are difficult about it, be persistent! Best of luck to you! ",
                "Ik i am trying to work up the courage and thinking of a way so it goes smoothly ",
                "Good luck!",
                "Thank you and by the way my friend who is depressed and my other good friend have told me that i need help and i have noticed too because i am becoming so suidical and emotionally numb and so i thought maybe i do need help and i hope it does go smoothly\n\n&amp;#x200B;",
                "Thank you\n\n&amp;#x200B;",
                "You’re welcome.  I hope you get the help you need and have an amazing life.  You’re strong, you can do this. ",
                "Me too and i hope i am strong enough",
                "You’re stronger than you think.  You’ve been able to get through each day so far and I bet it was really hard.  When it’s really hard for me I break it down into more manageable bits.  I tell myself I just need to get through this hour, and then the next hour and then the next.  ",
                "Thank you so much i just wish i could have met you before i got to this state",
                "Please let your parents help you.  They’d want to help you if they knew.  I was like you when I was younger.  When I was 14 I was getting beaten up in p.e.  every day and I didn’t tell my parents about it until 5 years later.  They wish I had told them back then because they would have put a stop to it.  ",
                "Thats true now that i think about but i am way to anxious to just walk up and tell them",
                "Can you text them?",
                "no",
                "How do you feel about writing a note and leaving it under their bedroom door or somewhere you know they find it?",
                "i want my mom to know first if i write a note they will know at the same time i rather have my mom tell my dad",
                "I hope you find the courage to tell your mom.  Remember that she loves you and wants the best for you. ",
                "thxs"
            ]
        },
        {
            "tag": 50031,
            "patterns": "My mental state is messed up, and I don't really know what else I can do to sort it out. [REQUESTING ADVICE / SUPPORT]",
            "responses": [
                "Please ensure you have selected a flair for your post. Flairless posts do not receive as much attention as flaired posts do; we may remove posts without flairs.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/depression_help) if you have any questions or concerns.*"
            ]
        },
        {
            "tag": 50032,
            "patterns": "I've messed up my mental state, and I'm too much of an idiot to get through life.",
            "responses": [
                "Please ensure you have selected a flair for your post. Flairless posts do not receive as much attention as flaired posts do; we may remove posts without flairs.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/depression_help) if you have any questions or concerns.*"
            ]
        },
        {
            "tag": 50033,
            "patterns": "Losing all hope",
            "responses": [
                "Even IF there was no meaning to life, no purpose to our breaths we take, there is also no sense in torturing yourself. This is definitely something to bring up with your therapist. I have very similar thoughts to yours and I've spent so much time wallowing in that pit. It creates trauma and a lot of the time, we can't handle trauma on our own. I wish with every fiber of my being I could do more to help. I hate seeing other people suffer.",
                "This is exactly what j krishnamurti says. I'm sry for what happened even though it doesn't change anything. The self which is created by thinking which is the past is responsible for all this. The division, me and you, my country not yours, divorces, hurting others, falling into the ilussion of individuality... He didn't love you in the first place. Having a self denies love, he loves ideas and beliefs and the sense of becoming someone when in fact is there is no one to become. He is just dead memories, the movement of that gives him the idea that he is living. But in actuality he lives in a virtual reality, he never loved, smelled, sensed beauty. His thoughts which are actually not his but of society cause we are the product of the bs and ilussions they sell us, love and sex, which is just pleasurable activity of the demand of thought to feel something.\nLove as we know it implies me and you. In that there is division, conflict therefore limited. All memory based, two entities, two images that are given the impression that they talk. But you don't know him, you think you love him. What you love is the image of his. All that is meaningless, no one can accept this harsh truth....we operate partially, only thinking(memory) operates. All other senses are dormant. How can there be love, a sense of union, something beyond thought, not falling in love but the sense of that energy when memory is active and thinking about myself, my problems, my job...\nCheck out j krishnamurti. It's really profound. There is nothing more meaningful in life than the truth. It's on YouTube. The truth is the real meaning which is what you said the life we live which is thinking is fundamentally meaningless and destructive. With all its beliefs, ilussions etc. I really doubt if there is real love anymore... So it's important to find out what is thinking in itself. \nKrishnamurti points out to some shocking facts. The ending of sorrow is passion.. \nWe can talk if you want :) ",
                "You're situations not easy I have sympathy for you. I've had a few bad years myself and it feels like nothing will ever get better. I have depression also so I understand the struggle but as far as meaninglessness, I think that saying that there is no meaning is just an easy way of not accepting responsibility. The answer of meaning is a difficult one because it's hard to break down. But youre right there isn't a  \"THE meaning of life\" depending on who you ask the meaning of life is different. And it honestly means what you make it since everyone opinion is subjective. I wish my purpose was just handed to me at birth but unfortunately that's not the state of affairs. The fact that others have suffered much more than us is also a good way of reminding yourself it's not that bad. Consider that water heaters we're invented In 1970 and weren't ubiquitous til 1990, we have a personal hot Oasis whenever we need. I try to remind myself of the little things since so many before us suffered meaninglessly, at least we have the option to suffer meaningfully, I recommend find a hobbie. ",
                "I hope I don't sound like an asshole it's just I don't know how else to put it. Also reading too much into things is sometimes a problem as is for me, try to find something that you're passionate about, and read Friedrich Nietzsche",
                "You are in a moment of hopelessness - we're here because we know that feeling as well. I too have struggled for years with ineffective meds, self medication, traumatic relationshisps, and all the other frustrations of a difficult depression. The two most important things to remember are that it is a moment that will pass, and there are people out here who care even though we are strangers. Your comments indicate that you are intelligent and caring. Look for a therapeutic venue where those traits are valued. I have been fortunate to have found a group that can participate in discussions where there is trust and respect and privacy, where the healing and progress that comes from catharsis is possible. You clearly have a lot to offer, and a lot to process. I know that my own condition has often been too much for some people to handle -  I have had to learn to accept that and forgive them, and me, so that I could continue to love them, and know that they continue to love me even though they don't have the necessary skills to deal with my depression. This is not uncommon. Keep trying, keep talking, and know that you are being heard and valued. Take heart and take care and stay open to the possibility and probability that you will get to the peace that is missing right now. You deserve it, even though the contrary voices might tell you otherwise. ",
                "I suppose this is where that phrase ignorance is bliss comes from. It may feel initially empowering to gain all this knowledge and insight, but in reality it can become what will oppress you. ",
                "You have to live for yourself. Sure, we are a \"blip,\" in the universe and one of the many human beings with these feelings. You are YOU. You are smart, capable, you have free will and you can do whatever you want. I am sorry that your fiance is thinking of only focusing on his job instead of building a life with you. Why can't he do both? Are you feeling upset because he is doing this to you? I am sorry about this pain. You are strong. ",
                "If there is no meaning to your existence, then you can do as you wish. You can still love. It is still in your heart, no matter what any other person does with it. Express your emotions even if they’re painful. There is no reason for shame if the world is meaningless. In this absence of purpose you feel, there is no reason you can’t have a new purpose: Love in small good ways every day, to whoever you wish."
            ]
        },
        {
            "tag": 50034,
            "patterns": "Don't know if this is the right place to post.",
            "responses": [
                "Are you receiving counselling?"
            ]
        },
        {
            "tag": 50035,
            "patterns": "Felt I was unwanted and this is the reason for my depression",
            "responses": [
                "Same. My spouse asked for a divorce (not related to my depression really- mainly due to his own issues). In my family my grandmother's needs always trumped anyone else's, and the first time depression and anxiety came for me it cost me 95% of my friends. I feel like I'm always being tossed in the garbage, shunted to the side, or picked over for something better. ",
                "What’s up I don’t know either of y’all but y’all both worth more than you know! Kids are ungrateful little shits cause they’re kids but when they get a little older and can understand everything you do and have done for them they’ll appreciate the shit out of you. In the meantime surround yourself with better people - a while ago I felt very similar, though I’ve never had major depression the feelings of being unwanted and worthless are not new to me. Today I’m surrounded by different people who constantly show their appreciation for me and reciprocate my efforts - I’m the same person and do the same things I just traded the assholes in my life for winners!"
            ]
        },
        {
            "tag": 50036,
            "patterns": "I can’t handle it anymore",
            "responses": [
                "Looks like typical asian parents. \n\nFor the math part:\n\nMaybe try taking your mind away from maths for a few days. Read some textbooks/subjects other than maths for a few days. Build up your confidence and then retry it. \n\nOr try to get help in maths from your friends if you are having problems in some specific areas.\n\n&amp;#x200B;\n\nWhat I feel is that you have got into a cycle.\n\nWake up half asleep -&gt; dad's yelling -&gt; confidence/motivation down -&gt; feel mentally tired -&gt; awake for hours crying -&gt; wake up half asleep\n\nAnd it gets harder to break the cycle. ",
                "Yeah, you’re right about everything including the Asian parents.  I’ll try your advice and see what happens. Thanks.",
                "For the parent's expectations part :\n\nJust remember that they mean good for you. The way they are telling and yelling at you is not good and having opposite effects. \n\nFor the time being, try to ignore the yelling and focus on the job at hand. \n\nYou know that if you get good grades all of this will go away. "
            ]
        },
        {
            "tag": 50037,
            "patterns": "How can I learn to forget?",
            "responses": [
                "I'm sorry if this sounds harsh but you won't forget until you come to terms with it, otherwise it's just shoving it away until the problem gets worse. You can DM me and vent if you want to, I have a sort of similar situation so I could give you advice on how I deal with it.",
                "Haha, sounds like it alright. I would love to come to terms with it. I would love to believe I can just go back to the days, where I wouldn't go crazy without talking to them for a day.   \n\n\nJust not sure what the answer for \"coming to terms\" is. I would like to think I accepted the fact, but a part of me just flailing against the \"logical\" thinking. I been trying to mask it all with distracting myself with work, friends, and the gym, but it all is dialing back onto me isn't it? \n\n&amp;#x200B;\n\n95% of the time, it's fine. It's just the 5% that sink me into the back of my seat.",
                "For me, it's not normal again. But I just sorta let them be their own thing. It's not easy dealing with things like this because it's no ones fault so you might try to pin it on yourself somehow. I can't understand how you feel I don't wanna pretend like I do. All I can recommend is having one good friend that maybe knows her to talk to. Don't make yourself do things you aren't ready to do but don't put anything off either. It's vague I know, stuff like that usually is. I'm sorry i can be of more help.",
                "I have sort of the same problem, and my way to relieve it was to talk to her about that. Things aren't going like they were before, but if she was  a good friend she will understand it and help you out.\nJust talk it to her and maybe she'll ease things for you. But letting to know your situation often helps.",
                "Thanks for the empathy!\n\nI would love to just talk to her about it, but that very thought scares me to my core. I don't ever want to scare someone away, especially her. I think I am almost ready to accept that it's never going to be the same ever again, but also it doesn't help that she keeps closing up to no end, unfortunately.\n\nMaybe I will though, I been thinking about it for a while, but the big boogie monster of depression is holding me back."
            ]
        },
        {
            "tag": 50038,
            "patterns": "Will medication help me or am I just doomed to feel like this for the rest of my life?",
            "responses": [
                "Medication is a really helpful tool. \nRemember it takes a while to work, and you may not get the right one straight away. But with the correct type of antidepressant at the right dosage, you won’t feel worse, you won’t feel robotic. \nMedication can save lives, the rhetoric around it is absurd- your brain is chemically sick and so medicine can help.\n\nHowever, medication shouldn’t be your only treatment so continue with therapy etc \n\nHope you can find some relief x\n\n",
                "Like u/gwennyp said, you might not find the right medication immediately, and it will take a bit to adjust to it. \n\nBut don't be afraid of trying. I have severe depression and anxiety and last year got a very light medication to try out. It helped me so much. It didn't wash away all of my worries. But it helps me see reason when I usually couldn't, and helped me actually turn things around. I'm still far from out of it, and not in therapy right now, which is  definitely recommended, but I've accomplished things I never believed I was capable of thanks to it. \n\nJust be aware - there's some medication that will actually put you on some type of \"autopilot\", and if you're afraid of that, talk to your therapist about light medications to go along with therapy. \n\nIt gets better. Wish you best of luck in life, you deserve to be happy.",
                "You're not alone. I don't know if my medications have helped me or if it was just a matter of time and gaining life experience. There's no way to know for sure except by going off my medications and I am not going to do that. Give medication a try and be patient, it can take awhile to get them properly adjusted. They are most likely not going to make things worse. Be well.",
                "Mediation is one third of the equation.  Self care and counseling are the other thirds.  You can find a light.  It is there.  You just need the right key my friend.  ",
                "Medication, sunlight, exercise, and proper diet.  Together they are the depression killers.  ",
                "This made me laugh :)",
                "Hoping the medication then is what I’m missing:) thank you ",
                "Thank you! I’m definitely going to be continuing therapy  ",
                "Thank you :)",
                "Thank you! Hoping medication with the other two, is that key ",
                "Thank you!",
                "Self care is critical.  You need to learn to be compassionate to yourself.  Proper sleep, food, exercise (walking if pressing 300lbs isn't right for you).  Proper medication.  Proper counseling.  It is important to be honest and open and willing to come to terms with painful things.  Patience.  You will not get better instantly.  It could take years.  Good luck and love yourself.  ",
                "Thank you so much♥️"
            ]
        },
        {
            "tag": 50039,
            "patterns": "I don’t know if I’m depressed.",
            "responses": [
                "It sounds like you are having a lot of anxiety. Is there a lot going on in your life that is making you feel stressed? It is normal to feel pressure at times, but it is not good when it happens so much that your thoughts race all of the time and you can not eat. The talk of suicide is everywhere also and so that is depressing. Please do not think of hurting yourself. You are just a young person trying to figure out the world and your hormones are up and town. Talk to someone you trust and just vent and get it all out. Video games are a good outlet for stress relief. Stay strong!!!",
                "Thank you! Yes, I’d say I’m really stressed recently. I don’t really know the exact reason. I feel like I’d never hurt myself but I still have the thoughts of doing it. The person I do vent to probably shouldn’t be in my life, it’s an ex that I was close to, so that may be the stressor. I’m trying to stay positive but it’s really difficult. Thank you once again, I appreciate it a lot since it feels like no one understands when I do talk to them.",
                "It is common to feel like no one understands, because you are still trying to figure out your own emotions. I remember feeling very antsy at your age and very apprehensive and feeling like no one understood. I am older now and I have been learning about strategies against anxiety. First, if talking to an ex is making you sad...then I would make peace with it and enjoy being friends or find someone else to vent to. Reach out to others and just share your feelings. I am glad you are staying positive and doing your best to look at the world in a bright way. That is a first step to feeling better. I think it is natural to think about death also/killing yourself. It doesn't mean you are going to do it, you are just stressed. So, remember to take a deep breath and try to feel better and more in control of yourself. ",
                "Thank you so much!",
                "You are very welcome. I hope you have a good day. ",
                "I hope you have a good day as well!",
                "Post this to r/TealPill too, I think it would be good there for help.",
                "I will, thank you.",
                "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/tealpill] [I was told to post this here, maybe you guys can help](https://www.reddit.com/r/TealPill/comments/ar195v/i_was_told_to_post_this_here_maybe_you_guys_can/)\n\n&amp;nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*"
            ]
        },
        {
            "tag": 50040,
            "patterns": "Not accepted my diagnosis twice, afraid to go get help again",
            "responses": [
                "You can go to therapy and tell them you are not ready to start medication yet. Tell then your reservations about it and just do the weekly sessions first\n\nIt really helps.\n\nAnd maybe you won't need medication. The psychiatrist always asks for blood exams before prescribing medication, because there are other things that might be influencing your mood.\n\nYou got this. \n\n\n",
                "That crippling emotional knot that’s preventing you from progress is a dimension of depression. You must acknowledge that what you feel may not be logical or reasonable. Speak to yourself with the care and concern that you’d speak to a loved one going through a tough time. Please seek professional help. I’m rooting for you. ",
                "I always like going to nurse practitioners over doctors. Like others said go to a therapist as well. I’m going to my second appointment now. Don’t give up go get help &lt;3 makes a world of a difference. Message me if you ever need anything. ",
                "I did not find a diagnosis that helpful either. Maybe think of it as a working hypothesis.\nThere are treatments other than medication, such as CBT therapy.\nSounds like you are not getting the quality of life you deserve, whether it is paralysis or not. Please be good to yourself!"
            ]
        },
        {
            "tag": 50041,
            "patterns": "Telling family about depression",
            "responses": [
                "I recommend only having that conversation with her if YOU feel ready.\nMy mom took me to a mental health location, only because a teacher read a note that I had written to a friend, and she contacted my mom. Together, they pulled me out of school and took me for an evaluation. There I was diagnosed with clinical depression.\n\nTry to look at it this way, you're a senior. You are almost out from under her (if you aren't already). You are the one seeking help, whether she's supportive of you or not, you are doing what's right for you. Don't let her take that from you.\nI do surely hope she fights this battle with you, because it is a hard battle.\n\nIn my case I found out my mom has battled depression for a long time, hers started around the same age as mine started. My mom's aunt struggles with depression. My mom has told me she didn't feel that close with her mother, but she said looking back she believes her mother struggled with it as well. Maybe it runs in your family too?",
                "I can give you some guidance here if you wish.  \n\nFirst, try to understand that most of us who deal with depression, have very good reasons for why we are depressed.  Many of those reasons, come from our parents and this very common mental condition called, \"Denial\".  Denial, is a strange thing, it is a lie that we tell ourselves and the more we convince ourselves, the sicker we become.  So, let me ask you this...  When you try to confront your mother about your feelings and beliefs, does she become defensive, tell you that is nonsense, accuse you of wasting time?  This type of defensive emotional response is the signature of denial, which is basically people trying to hide the things they are ashamed of.\n\nTry to accept her and find someone different, someone safe you can talk to.  There is a very good chance your mother is in denial and the more you try to get her to see your side, the more depressed you will become.  We cannot change someone else's mind, when they are in denial.  Accept her as she is and return the focus to doing things that bring you joy.  You may NEVER gain her approval, but you can certainly gain your own approval.\n\n&amp;#x200B;\n\nMay my words have meaning for you, Namaste.",
                "Thank you, I appreciate this a lot. You're right that I'm almost out of the house, but I still hope I'll be able to tell her.",
                "Thank you!\n\nI'll look for someone else to talk to.",
                "Just tell her that sometimes you go through dark slumps and need her honest help.",
                "happy to help, lean on me when you need to",
                "Post this to r/TealPill too, I think it would be good there for help."
            ]
        },
        {
            "tag": 50042,
            "patterns": "Where to go from here ?",
            "responses": [
                "If you’re looking for ‘life advice’, then I know no better place than Guide to Purposeful Success. If I had these resources earlier in life, I’d be so much better off. But nothing is too late! Hope it can help you transform your life the same way it helped me. ",
                "Post this to r/TealPill too, I think it would be good there for help."
            ]
        },
        {
            "tag": 50043,
            "patterns": "Question",
            "responses": [
                "It seems like it. They give you random dark slumps. Talk to your doctor for medication and diagnosis, and reinvigorate yourself with a schedule change",
                "The best thing to do is seek professional help. It’s not wrong to ask support from those dear to you, but not everyone can explain your situation. There are people trained for this specific purpose. I know its hard going though this without anyone behind your back. But professional help is a need. There are organizations that are active online and maybe you can reach out to them to help you find a psychiatrist and/or therapist. Asking for help is the first step to overcoming all this. I believe you will get there!",
                "The same thing happened to me when I was very young. You have to talk to someone and get help, you can start with your family doctor or parents. \n\n**Be strong**, if they don't take your feelings seriously just because you are young you have to tell them that you are serious and you need help!!\n\nI was 12 when I started to feel depressed and I didn't think it was a big deal so I didn't do anything. Now I am 22 and I am even more sad than before.\n\nBe brave, believe in your own emotions and talk to someone you love! \n\n&amp;#x200B;"
            ]
        },
        {
            "tag": 50044,
            "patterns": "Compulsive ideation",
            "responses": [
                "I have the same thing. I always image myself doing it, to a point where if it physically hurts where it would in the ideation. I have recurring dreams where I kill myself. \n\nI talked with my therapist about this, and it was suggested that I treat them as impulses that can be ignored. For example, it’s like sometimes I’ll see a couple kissing on the street, with one leaning on the other, and think, “I could totally shove them, run, and laugh at them falling over.” I don’t ever do it, but I think it and I imagine it. Or I see a toddler and I think, “I could totally shove this kid over.” But I don’t do it. \n\nThis helped me out, but I can’t confirm whether it’ll help you as well. Obviously it’s not _that_ simple, but it does help a little.",
                "I think it may be the same sort of thing for me. When I do imagine these impulses, it almost feels like a stress relief, or a nervous tick. Not that it makes me feel better, but like if I imagine it maybe I won’t have to worry about really doing it. Does it feel the same for you? I wonder if your therapists thinks it’s semi-normal or if they’re unhealthy thoughts. ",
                "Post this to r/TealPill too, I think it would be good there for help."
            ]
        },
        {
            "tag": 50045,
            "patterns": "Ok I have been diagnosed having schizoaffective disorder",
            "responses": [
                "I'm sorry I have no advice but I wish you well and hope you get everything you need in the future ❤",
                "Sometimes we just get a feeling that something is missing in our lives. There is just this open void that needs to be filled and if left unfilled it may bring on sinking feelings or feelings of loneliness. The mistake we makes is thinking that we have to find a specific missing piece to a puzzle and it must fit perfectly immediately.\n\n&amp;#x200B;\n\nThe trick is to find a hobby or activity that you've always had an interest in. As you made a reddit post, I assume you have access to the internet and some sort of computer or device. There is a massive world out there of information and you have it at your disposal to learn ANYTHING YOU WANT. I'd suggest you dive deep into DIY's and youtube and just about anything you can find. Find something that peaks your interest (even in the slightest) and roll with it.\n\n&amp;#x200B;\n\nSometimes that thing that you find turns out to be that thing you have always been missing. Sometimes that thing does not completely fill the void but looking for it lead you to something else that might. The idea is putting yourself out there in a way and seeing what sticks. If you don't try it you won't find it. Just keep searching! For some people, that constant search of something more is all they need."
            ]
        },
        {
            "tag": 50046,
            "patterns": "I broke my wrist today.",
            "responses": [
                "hey man. what's up. private message me, i'm here to talk.",
                "How do I get the alp snow",
                "Uhhm, come to Colorado. Cause even though my wrist is broken I’m not missing out on this season. "
            ]
        },
        {
            "tag": 50047,
            "patterns": "Am I / I am depressed ? .",
            "responses": [
                "Firstly, own your feelings. You get to feel sad for any reason or no reason at all. No excuse is necessary. \n\nSecondly, being depressed doesn’t make you ungrateful. You can appreciate your life and still be depressed. \n\nThirdly, even if it is a phase, that doesn’t make your feelings any less valid. If you feel down, you feel down. Nobody gets to tell you that’s not ok. \n\nI’ve lived with depression all my life and I’m now 40. I wish when I was your age, I would have talked to someone. I wish someone would have told me that I didn’t have to be brave or bottle up my feelings. I’ve found Zoloft is tremendously helpful for me and I wish I would have been able to take it as a 15 year old. It doesn’t erase the depression, but it makes the depression less awful. It helps me focus on my life and get my shit done. \n\nI hope this helps. I hope you find some peace and I hope you know that you matter. Not just to your folks and friends, but to me, a stranger on the other side of the world. ",
                "My depression kicked in at about your age and I went through very similar feelings. I eventually told my parents and my Mum was pretty good with helping me find a therapist (this was almost 5 years after I first felt this way). She still sucks at understanding depression but there you go. Talking to friends is certainly an option, if they are your friends they won’t see it as a burden and will probably understand a little. Just talking can help alleviate the feelings sometimes.\n\nNow, as a teacher of kiddos about your age I can safely say that in most countries schools can be very helpful! If you feel like you need to talk to someone you can check out if your school has a councillor. They can help with resources that may help (or even just listening). School nurses may also help, but if have never had anything to do with schools that have this resource so am unsure?\n\nAlso, most people with depression have it for “no reason”. People who have loved ones die etc “feel depressed” they are not “depressed”(a lot of the time). Grief has many of the same symptoms as depression but it eventually eases and has a clear starting point. Depression normally doesn’t have a clear starting point and does not normally ease with time (aka you normally have to do something to help with your depression even if it is simply learn some coping mechanisms).\n\nSometimes we think we are depressed for logical reasons (I have a terrible personality, I don’t have any friends, I suck at school, I suck at my job) but often these reasons are just the depression talking. Having a bad grade can make your depression worse, but less motivation is a symptom of depression and this often leads to thugs like worse grades.\n\nIf this continues or god forbid gets worse, please talk to someone you trust! Waiting five years to do anything is a load of bullshit!\n\nTLDR: you sound depressed, it could be a phase, but it could also be a serious health problem. There are people that can help! I found that out the hard way as a depressed 15 y/o. It’s okay to be depressed for no reason - most people are. ❤️"
            ]
        },
        {
            "tag": 50048,
            "patterns": "I love you all but I hate me",
            "responses": [
                "You and me both, I’m nearing 40, no relationships, my dad is unwell and has told me that he built his house for my future with kids and a wife while I have no means of getting a family. My Christmas’ in my later years was with my mum and her abusing boyfriend which made me hate the entire thing.  Now I live in a mental place where I feel bad for not being a father or having a family while still hating the holidays. ",
                "You may hate me for saying this, but the best thing you can do is stop drinking right now. Start taking care of yourself in little ways at first, then slowly take control of your life. Eventually you will master your emotions. Getting a therapist may help too, and possibly medication, but let a professional make that judgement call.",
                "Why do you hate you?",
                "This is a little off topic but you have a really good poetic voice. I don't even know if this was intended to be a poem but I you really captured a lot of emotion in a short amount of words. Hang in there &lt;3",
                "Me too. Its so weird. I'm very compassionate when it comes to other people. I'm incredibly forgiving and sympathetic and yet....... I have absolutely no remorse for myself. I don't like who I am, or the things I do. At one point, I felt confident and happy, and I enjoyed being myself. I hope to read that same state again. And I hope you till too."
            ]
        },
        {
            "tag": 50049,
            "patterns": "here i am again",
            "responses": [
                "I'm sorry everything feels so gray and dull. When you were on your meds did they help? Is there a reason why you haven't been paid? Have you not been working, or do they owe you money? \n\nIt seems to me like maybe you care a little bit, enough to post anyway. It's okay for you to have support from outside your mom and bf. A lot of us here really understand. \n\nIf you're in the US and food is an issue, please call 211. I believe that number is for United Way. They can help you find a food pantry or get you information on how to apply for food stamps. \n\nWhat is one thing you can do today to make yourself feel better? Have you showered and gotten dressed to shoes today? It can be hard to face the day when we're unshowered and in our pajamas. Just doing some self-care can sometimes help a little bit anyway. Maybe you could go for a walk or listen to music that's calming. If the meds helped before, consider starting to take them again or reaching out to your doctor or therapist.\n\nWhen I get really down I end up laying on the couch all day without eating, showering or doing anything really. It doesn't help to move me out of that state. What helps is getting up and doing ONE thing that will have a positive impact on my life. Getting drunk or cutting does NOT count. It can be hygiene, exercise, healthy diet, drinking water, taking my meds, reaching out to my therapist, paying bills, washing dishes, following up on something for work (like missed pay), taking care of an obligation I've been avoiding, spending time with a caring friend, listening to positive upbeat music, etc. \n\nIt can be really easy to focus on what's going wrong, but can you think of a few things you're grateful for? It can be your boyfriend, or your physical health, or something beautiful in nature. Practicing mindful gratitude on a daily basis can help shift those negative feelings to more positive feelings, but it does take some effort. "
            ]
        },
        {
            "tag": 50050,
            "patterns": "I can't tell if I'm depressed, or in a rut, or something else, and I'm scared and I don't know what to do",
            "responses": [
                "As always , a therapist is a very good place to start. I can never stress this enough as it's someone you can fully open up to that is impartial and unbiased. \n\nBut I have a feeling that your problems lie deeper. Everything you've stated suggests that you have a problem with love. I don't mean you have a commitment issue, or that you don't love your boyfriend, but that you may have issues that go beyond this.\n\nI guess i'll lead by example here and it may or may not pertain to you. I had an ex girlfriend that truly believed we were soulmates. She described everything as you have, yet she still was hiding little things, not fully opening up, and would very often project her problems onto me. \n\nI know it is very easy to THINK you are in love. Trust me, I am the same way. But are you honestly in LOVE. and please do not think that sex= love. Just because you are or are not in the mood for sex does not mean you are in or out of love, as these are very different things and you seem to be in this mindset that wanting or enjoying sex means you should or shouldn't love your significant other. \n\nEveryone is different of course so it is very hard for me to fully understand your situation from behind a computer, but it seems like your boyfriends sees sex as the end all be all and you have begun to see things his way. Again, you may also feel this way and I could be seeing things wrong. But much of your post is focused around sex. Which itself tells me that is how you gauge love interest.\nas always I will suggest seeing a therapist who specializes in talk therapy so you can just get whatever you don't feel comfortable talking about with your boyfriend off your chest and truly put all your cards on the table. From there it may be easier to see things.\n\nFrom my own point of view I would say it seems that you both are a bit immature (I don't mean this in a offensive way) and are stuck in this new age idea that lust = love. But I also don't know the rest of the details to your or his lives. \n\nI would really suggest you both see a therapist separately, and then find a couples therapist you are both comfortable with and go from there. \n\nPlease feel free to contact me directly with more information or comments back (depending on how much you would like to share on a public forum).\n\nRegardless I wish you both the best and thing a therapist (separately to start) would benefit you both."
            ]
        },
        {
            "tag": 50051,
            "patterns": "I am depressed again",
            "responses": [
                "Seek professional help for your symptoms. Even something as simple as talk therapy or a simple medication can do wonders!",
                "I feel you in every way\n\nYou know you need therapy, the next step is making an appointment\n\nYou can do it",
                "Do you believe in a power greater than you, a creator, could you be searching for something deeper?"
            ]
        },
        {
            "tag": 50052,
            "patterns": "I realized I am depressed",
            "responses": [
                "Yea I was and in some ways still am exactly that way. The good news is most kids your age feel that way alot. Its a time in your life when you outgrow your old self but are not ready to become your new self. You may have seasonal affective distorder, a type of depression that comes typically after the clocks are set back and it gets dark at like 5. I have that and this time of year including now I just want to sit on my bed watching youtube and Netflix. \n\nMy advise   Try to get an anti depressant or if you cant do that (my parents wouldnt let me) just is just try to enjoy some aspect of your days, maybe do a quick workout, sell old clothes online or just write. Also try your best at school work. This feeling will definity pass and if it gets too bad just try and ride it out doing whatver you do actually enjoy doing.",
                "You need to re-stimulate yourself before things become too serious. Reach out socially and do some physical activity.\n\nIf that doesn’t work, ask for professional help",
                "Same here 😢",
                "Hi. There's a peer support service called Supportiv that's completely free for teens &amp; fully anonymous. If you want to give it a try, there's a WeCareGrant code you can use to talk as long as you want for free.",
                "That tv/remote part hit home"
            ]
        },
        {
            "tag": 50053,
            "patterns": "Depression tips?",
            "responses": [
                "Working out helped me.",
                "What kind of work outs do you do?",
                "I started with an hour of cardio on the elipticle ... it honestly releases so many endorphins ",
                "I could give jogging a go?",
                "Yea, start there... you wanna get that “runners high”... look it up you will feel great ",
                "First thing is to just talk to someone! Easiest way is to let someone know, hey, I need to ask you something about mental health, is that alright? They will probably be open to talking about it. The more you open up, the more those feelings and thoughts lose their power - they won't just disappear, but you'll know what your dealing with in a more concrete sense..it will help u get to a Dr if u need one or to whatever treatment U need, or help you realize ur not actually depressed. Also, U can usually talk to ur primary care physician about psychiatry, or just make an appointment with a psychiatrist. As for whether u are depressed..u sound like I did a couple months ago, wondering what the hell i was feeling and finding it hard to believe i actually was depressed. Depression does not discriminate, and it sucks to be depressed but it sucks even more when it goes unnoticed, and u noticed it! or at least u have a desire to feel better. You are in a good place, keep searching for answers.",
                "Also its hard to believe that thoughts alone can have such a strong effect on our energy, but when they are highly existential, like what u describe, i totally get it..those are exhaustingly heavy and come with a whole feeling attached to them too that does slow u down",
                "Thanks. I just really want to feel like my old self again, getting excited and laughing at YouTube videos and basically not being touchy about subjects like work and my past. How about you? Hiw have you been feeling recently?",
                "How did you start trying to deal with them?",
                "Your welcome! You'll get there..to me it seems like everybody who decides to chase what they want gets it eventually, they recover if they choose to. ive been ok. Weekends are tough cuz im alone a lot so it really feels like I have no life. Last night i watched ex machina which is a great movie but also really sad and deep. While I was working out tonight i had a moment of clarity about what is helpful and what isn't - certain movies like that, watching them alone..for me its just wallpwing in sadness lol. Now though i feel like im back on the right track, i made myself workout so im getting confidence back that i can take care of myself the right way. After working out I called a friend for a bit and talked openly with my parents too, instead of just having 'everything is cool' attitude and making the convo as short as possible. Overall my mood is up and down, im trying to stabilize it and continue those healthier actions.",
                "I havent been dealing with them too well..what helps me though is getting clarity on them..what is the thought exactly? Is it logical? Is it helpful? For example sometimes i think no one cares about me..in a sense its true.. Im one person in the whole world and to most people I am a nobody..I could die, and in the big picture it wouldnt matter. On the other hand i know for a fact that the people i know care about me so its illogical to only look at the existential side of it. To those people, our relationship is the big picture, we dont matter any less because we're 'insignificant' in the grand scheme of things. 😂😂😂that might just sound confusing idk. \nThe bottom line is that u have to fight those ideas..they can be dismantled if u get some clarity on whats going on in ur head. They aren't the authority, you are. I will say cardio is a great way to get that headspace, for me it just relaxes me to where i feel good enough to think more clearly and spot the stuff that's pulling me down.",
                "Sounds like youre doing a bit well. Its harder for me to talk to people since i find it easier to make online friends and my real friends moved away from me for work purposes (or vice versa since I moved away)\n\nSis lives with me, but we never meet or talk to each other since she has a schedule near opposite to mine. She's also very prickly as a person so its hard to talk to her about these things.ill try to keep being positive.",
                "Watch Jocko on YouTube here’s my favorite 2 min clip from Jocko on the word “Good.” \n\nhttps://youtu.be/IdTMDpizis8\n\nGood news! You’re feeling the same way I am and have lol. "
            ]
        },
        {
            "tag": 50054,
            "patterns": "am i depressed?",
            "responses": [
                "I wish there was an answer, I can't shake the feeling of wanting to die. I hope we all figure it out. ",
                "You're definitely depressed. Find a non-military therapist.",
                "Sounds like depression. See a psychiatrist and a counselor. Meds and talk therapy can work wonders ",
                "Since I'm not a professional, I cannot give you a definite answer, but from someone who struggles with Depression, what you are describing sure does sound like Depression. I would go to your doctor and maybe request a Depression screening test. That's what I did, and they prescribed me medication, and it has really helped out. I hope you get around to feeling better!",
                "With the symptoms OP describes, what kind of talk therapy do you think would be best?",
                "I’m no professional, so I have no clue. Depending on how severe the assault was and if OP is experiencing PTSD, EMDR (eye movement therapy) could be beneficial. I’d at least start with CBT (cognitive behavioral therapy) to help OP find out the root of the issues, triggers, and helpful solutions to stressful situations. ",
                "The fact that OP has had symptoms since childhood as well as a suicidal attempt leads me to believe there’s something physiological going on and it’s more than a “personality trait.” In addition, it seems as if other natural antidepressants (meditation, exercise, being social) aren’t working. Hopefully with medication and/or some therapy, OP can start feeling better. \nI’m rooting for you, OP! "
            ]
        },
        {
            "tag": 50055,
            "patterns": "Your experience with antidepressants.",
            "responses": [
                "I take antidepressants and I can't stress it enough how much it has helped me. I had similar view to yours before I started taking them. I was concerned I wouldn't be me but I am still me and it really helps me function day to day.   \n\n\nIt's definitely only a temporary solution though... I mean I eventually want to come off them but when I'm ready :) Doctors usually encourage you to undergo CBT treatment at the same time.   \n\n\nI also worried about side effects at first before I took them but then I realised whats the point? Maybe I waste my life or be dead if I didn't take them so I need them then I will take them and accept the side effects. After weighing it up it's definitely worth it.   \n\n\nI started taking Fluoexetine (Prozac) I think at first it did work but I eventually forgot to take it one day and just stopped and started taking it again but didn't work. I tried duloxetine (Cymbalta) also before this but it made me naseuous so I stopped. after a few days. I also tried Pristiq which worked for some time but then I don't think it did after a while (Maybe i should consulted my doctor and have increased my dose though). I tried Sertraline (Zoloft) for a few months or so but this LITERALLY didn't do anything.\n\nNow I take Venlafaxine (225mg) which is definitely working for me. Have had to increase dose then decrease it (with consultation with doctor) but tried to decrease it further but it affected me too much.   \n\n\nThis is just my personal experience. I worked at a pharmacy before and  can tell you all the antidepressents are sold on a regular basis. Everyones body reacts differently so try something if it doesn't work, or you have noticeable side effects that you don't like then just see your doctor and try another one. Sometimes you need to adjust your dose or be conscious of how its effecting/not effecting you. Realise its like a tool to help you function but not the permanant treatment itself :) Honestly try it though! If it doesn't work try another one (In consultation with your doctor) As per above it took me 4 other medications before I found the right one. \n\n&amp;#x200B;\n\nAll the best! If have any more questions I can try to answer just let me know :) ",
                "Thank you for your honest reply, I truly appreciate it.",
                "Personally, I don't think as anti-depressants as a crutch or weakness. They are there to help us get all the sh*t out of the way so we can finally somewhat function as human beings. And to process our depression better with a clearer mind.\n\nWhat I was also told was that..\n1 - finding the right medication can be a journey (which is why I used genesight to narrow down the right medication for me)\n2 - and we have to wait about 4~6 weeks to finally receive the full effect. \n\nHope that helps. Please take care. \n",
                "I struggle with recurrent episodes of depression and i was also afraid of the side effects and would try to hide it, all that got me was more suffering, recently after having a really bad episode i finally got help.\n\nThey started me on prozac and it did not work well, it did not work for me, all it made me was constantly tired. \n\nso i talked to my doctor and they switched me to wellbutrin, it has really helped a lot, my depression is still here but the wellbutrin has allowed me to actually move forward to getting better.\n\nThere is nothing wrong with taking antidepressants, if you had high blood pressure or something would you refuse treatment because you don't want to rely on a pill for normal blood pressure?\n\nThey will be some side effects, and it may take a few tries to find one that works. but they can really help a lot.",
                "I take antidepressants, mood enhancers, and antipsychotics and I couldn’t be better without them. My wife is happier when I’m on them and she was more worried about me starting them than me. \n\nTake your time and be honest about side effects, worst I had was nightmares and they stopped when I told the doctors and they took me off them.",
                "They worked perfectly for me, just remember these things:\nNever, never stop taking the medicine unless your psychiatrist tells you. It's really dangerous to suddenly stop taking antidepressants, just don't do that, if you have any problem with the meds talk to your doctor about it, don't stop the meds on your own.\nIt takes some time for antidepressants to work. be patient, it's just how they are.\nSome of the side effects will go away after some time. you may feel sleepy on first days, it's normal, it will completely go away, don't worry.\nand finally It may take time for your doctor to find the medicine that works best for you, so don't worry if the psychiatrist changed your meds.\nI wouldn't be here if those meds didn't exist, you deserve a life without depression, there are biological factors involved in depression, antidepressants help to balance the neurotransmitters that isn't balanced in your brain, they're not so different from other medicines that balance something that is unbalanced in our body (blood pressure for example).\nFind a good therapist (psychologist) to start psychotherapy alongside with taking the meds, because they work best when they're together.",
                " TLDR: Resistant to anti-depressants, awful experience with the first one I tried and the transition to the second one but the second one is helping so much now.\n\nMedications effect people differently so your experience on something won't necessarily be the same as someone else on it. That being said, I was afraid and resistant of anti depressants for a long time. I wanted to do it on my own. That was not working. I didn't want to be on it when we were hoping to try to have a baby soon. I didn't want to experience horrible side effects that you can read in long lists from a quick search.\n\nBut I tried one. It was AWFUL. I was exhausted, out of it, forgetful, just in a weird state of mind. I couldn't feel negative emotions but I couldn't feel positive ones either. I didn't care about anything or want to do anything. We tried lowering the dose to see if it was just too much. That was no good.\n\nMy therapist told me that I shouldn't feel this way and shouldn't wait so long to call my doctor and ask about trying something else. So I called and switched to a different one over the course of a week or so. The transition was bad. I was doubtful it would do any good. But it takes time for bodies to adjust to new meds and in time it actual helped. I can feel emotions. I don't cry randomly for no reason as much (mostly just when super stressed). I am doing much better, more functional, more interested in activities, etc. I am not \"cured\" or \"healed\" but I am better able to cope with my depression and anxiety. I'm glad I stuck to it and got to where I am now. It was a horrible start but worth it.\n\nI hope you can find something that works for you but don't give up on the first thing you try or the first few weeks on something. It felt like it would be forever before something would even be working and I didn't think I could wait that long but looking back from this side of it, I'm glad I pushed through. I still wish there was a quick fix though.",
                "I've been on wellbutrin and seroquel for 6 years now, I have no idea how i made it so long without them. The difference is night and day, I no longer get as depressed as I used to, it still happens but I can manage it way easier. It took about 6 months to start realizing how my mind worked on them, its kind of like having a buffer or slow motion ability when responding to stuff. You can see everything laid out in front of you instead of just the problems. It might take a few different tries to find what is right for you. There will be side effects at first until your body gets used to them. I hate that I have to take pills to be normal, but it is a genetic condition embedded in my DNA, there is nothing I can do about, thank God for science."
            ]
        },
        {
            "tag": 50056,
            "patterns": "Am I depressed?",
            "responses": [
                "First off, you're most likely depressed. I dont have the definition for it, but being withdrawn **over a longer period of time and having suicidal thoughts is a clear sign**. Other symptoms you might experience: lack of motivation, lower self-esteem, bad coping strategies, thoughts that start a negative feedback loop etc.\n\nSecondly, you need to search in your history for the reason what caused your behaviour. That can be even as simple as moving to another place and leaving a lot of friends behind. Most teenagers start to feel better as they mature, so a depression caused by puberty is probably out of the question and even then suicidal thoughts are invoked by (minior) events such as breakups etc.\n\nWhen you found out what caused this mess, you need to start cleaning up. Reflect on your feelings and on your behavior. Reduce stress and try to routine your day (which you probably dont have to since you're in the military). Take your time and tackle to problems you find. Most important things are time and self-reflection. A therapist only helps you in that he has an easier time seeing whats wrong."
            ]
        },
        {
            "tag": 50057,
            "patterns": "Empty",
            "responses": [
                "I really wish I could help, but reading your post sounds exactly like the post I came here to make. I won't hijack your post with mine.\n\nIt is nice reading that other people are like me, but that doesn't really help. The darkness is there. The emptiness. I get it.\n\nI understand the point about the car. This is one of the main reasons I have never owned a gun.\n\nFor me it's worse in shitty weather. And this cold windy shit can get me down.\n\nI have no real solution to your ('our') problem. The only way I cope with my depression is denial, avoidance, and temporary comforts. \n\nTL;DR: Me too. ",
                "Thank you so much for your reply, even if it's just you making a connection.\n\nI really really feel for you. I wish that right now I could knock on your door and we could hang out, watch a movie, play a video game, or something. Anything for keeping you away from this space of thought.",
                "It could be the only way to defeat this emptiness is to help others. Of course, the motivation to do so is low when zero f\\*cks are given. \n\nThe biggest thing for me is the thought of my nieces and nephews having to deal with the aftermath. I am close with most of them and have nine of them, ages 0-16. I really don't want them to be hurt. I guess that goes for the rest of my family. \n\nI know what causes my depression, and it's not always there. But it is there. And it sucks.\n\nIf want to expound but not publicly, you can PM me. This stuff can be hard to talk about.  \n",
                "I cant ensure you that you'll eventually overcome your depression, but I hope the best for you. I hope that you will enjoy life again cause I believe that even the most depressed can feel a little joy in their life if they just manage to hang on.\n\nTry not to focus on your condition as a whole, try to work on small things, like waking up in the morning and being able to get up, being able to go to bed at an appropriate time and find a way to comfortably sleep well. No one coped with  depression by finding their purpose in life immediately.\n\nI also share a burden, that I'm only willing to share with very few people. I know that such a burdan can make you feel isolated, but you should try to find someone that can share your burden with you. Even if you find a friend that carries the same burden, it will feel like  much less.\n\nDon't give up. Fight on for as long as you can. Allow yourself to be yourself and to help yourself no matter what. You Matter",
                "Thank you so much for your reply. It is very much appreciated.\n\nWhat got to me the most about your reply was your second part of your reply. I usually go to bed between 11pm and 1am, and wake up somewhere between 11am and 2pm (I wake up a lot during the night, so I sleep for long), but I struggle a lot with the motivation to get out of bed. I don't feel like it's worth it, so I just lay there, browing Reddit and 9gag on my phone.\n\nI know I should be sattisfied with getting out of bed in this condition, but I can't help but feel that I am being a nuisance to everyone and that I am just making stuff hard for myself. As if I WANT things to be like this.\n\nThank you so much for your reply. It is something I can look at when I am feeling like this.",
                "For what’s it’s worth, I really relate. I know I need to make some relationships fast or I’m just gonna end up ending my life, but I feel hopeless. I can barely leave my house, how tf am I supposed to speak a word to anyone let alone make a friend.\n\nWishing you the best dude",
                "It takes practice to change thought patterns. For example, if you think you’re worthless and somebody gives you a compliment, it can be very hard to accept it. You might discount the compliment and say, oh, you’re just being nice. You don’t mean that. \n\nHere’s where the practice comes in. Just. Say. Thank you. \n\nA friend feels all of her attempts at art are shit. Others don’t feel that way and say nice things. I am coaching her to say, “Thank you. I’m glad you like it.” There’s no need to point out the flaws, which she and I tend to do. Just. Say. Thank you. Eventually, the artist comes to appreciate her/his own work. \n\nThis really works, but it works slowly, subtly. You don’t even see it happening. Practice. \n\nThis example may not apply to you. Maybe you can practice not caring what others think. Wear something you like, but something others probably won’t. Keep telling yourself you don’t care and, really, it doesn’t matter if nobody likes it. \n\nFrom my own story, I made a dress/tunic out of a variety of repurposed fabric. Foolishly, I asked my straight-laced, critical sister if she liked it. She said she didn’t. It hurt. It shouldn’t have because who gives a fuck what she thinks? I realized that she embodies my inner critic and has for all my life. Well, I fired her from that post. I’m practicing to carry on doing what I like. It’s a work in progress. \n\nChanging the way you think is so hard but it can be done. \n\nSo much good luck to you. I’m rooting for you. \n\nBTW can you and the other poster play video games online, talking to each other, and what not? Like my nephew does? "
            ]
        },
        {
            "tag": 50058,
            "patterns": "want someone to talk to.",
            "responses": [
                "So what do you want to talk about?  What i get from your post is that youre feeling depressed about failing in some aspects of your life; not able to find a job and no gains at the gym (or rather loss on the scale).  Is that about right?\n",
                "pretty much. it sucks as like I said been doing gym work for 6 months not eating too much and not seeing any results it sucks as with personal trainer we cant figure out why the weight isnt coming off. Also when it comes to job searching, I cant even get my foot in the door as all of the applications come back unsuccesful. I have 2 Diplomas and not Applying for things out of my realm. I have diplomas in business and ICT and no one wants me.",
                "I understand that can be frustrating.  Both tasks your working on are challenging by themselves.  Please be patient with yourself, and dont listen to the negative crap your brain is trying to tell you.  \n\nWhat kind of training are you doing? Is your trainer worth it?  Would you consider a job outside your field or below your qualificatoins?  ",
                "Just message me and i'll talk to you.  i'll talk to you every day if that would make you happy."
            ]
        },
        {
            "tag": 50059,
            "patterns": "My Depression/Anxiety Story | How YouTube has Become My Outlet",
            "responses": []
        },
        {
            "tag": 50060,
            "patterns": "Whats the point.",
            "responses": [
                "Admitting it is good. Now you can make steps to take care of it. It too me a long time to admit it, and longer to get help. It's OK to get the help you need.",
                "I don't know man.. Im trying... But its not easy.\n\n&amp;#x200B;",
                "Oh for sure it's not easy. But you're on the right track :)",
                "thanks..."
            ]
        },
        {
            "tag": 50061,
            "patterns": "How do I admit to people I am depressed?",
            "responses": [
                "In my experience, you just don't. It doesn't help. It doesn't make things worse either, but it just has no impact whatsoever. \n\nI hope other people have better experiences.\n",
                "Personally, it's best not to tell people about it. I have told some people about it and what response they did give me?\n\n\"Get over it\", \"Other people had it worse than you, what makes you think that your condition is more bad than other people?\", \"You are being sad and depressed to seek for attention, aren't you?\" and \"You are just too paranoid\".\n\nSome of these people even stopped talking to me after I told them I have depression and anxiety issues. I really feel more depressed about them leaving me behind and not willing to help me out. That's why I am always alone whether I am with a group of people. I just don't think people would understand how it feel like to have depression until they really have it. It's just suck to be alone but if it means for me to have lesser trouble, it's something I am willing to do. ",
                "I have found it is important to talk about it. However it has to be someone I trust and who will not start trying to “fix” the problem with platitudes about how I “just need to... (fill in the blank).” To me it’s good enough to just tell somebody and admit how grateful I am that I don’t have to lie about how I am feeling. Sometimes acceptance is all I need. I offered tell them because I’m looking for support in dealing with it. Not like I need them to be my therapist just be somebody in my life that will see me for who I am and what I’m dealing with.When people ask if there is anything they can do I often take them up on it in a small way. I ask them to support me in doing the thing I know will make me feel better. For example I have a friend who likes to hike so I ask them to invite me when they go, ",
                "Talking helps if its the right people. When I hit complete rock bottom and finally (after about 8 years) decided to get professional help I told one of my closest friends. I knew that friend good enough to know he won't freak out about it and it helped me to go through with therapy and medication. Once you realise how much it helps to tell someone it gets \"easier\" but you still got to choose wise.\n\nI wouldn't tell co-workers or so as unfortunately mankind hasn't reached that point of acceptance yet and I don't want to make things awkward. There are still many people out there who think you might not be able to perform well or whatever they think. They just have no idea.\n\nBut telling close friends is really important I think. Even just one person where you can offload stuff. I have a friend who is great in listening and then he worries that he can't really help... I keep telling him that getting it out is all I need (from him). \n\nThe same with when people are asking \"How are you?\", the global standard answer is \"I'm fine\" no matter what is going on with a person. Having that friend you can't tell you having a shit day (depression related) is so important.\n\nIf I wouldn't have told any friends about it I wouldn't be here anymore.\n\nAnd NEVER EVER be afraid or ashamed to get professional help. There is absolutely nothing wrong with that.",
                "In my personal experience, it really depends on the person. I'd also recommend, if you're feeling pretty bad (and suspect you'll be in that stage for a while) talk first and mostly to a therapist, ideally weekly (monthly or even biweekly can feel like such a long time depending on your level of depression). See if your uni has options for that, or see if you can find a low-income option in your area (in my area we have a couple that have \"sliding scale\" fees. (aka you pay just what you can afford)\n\nI told very certain people about it years after it (About 4-5), when i finally started being able to (barely) pull myself together. This is because it can be extremely hard to open up at all, and when you're at your worst, if they react in a way you were not hoping (immediately or otherwise, some people got my hopes up only to disappear from my life later) it can be particularly hard when you're in a bad stage of your depression.\n\nYou also have to check yourself to not use the people that you told them about as therapists. There's only so much \"negative talk\" they can handle, so usually you have to be really conscious about either switching the focus on them, or have some happy tale ready to \"counter\" your depression talk (if you have any, otherwise you gotta be ready to also listen to them, which can be hard depending on the mental state you are).\n\nRemember that friends/family are not trained/equipped to deal with major illnesses, they're not professionals or doctors. They most probably won't be able to handle it properly, or say the things you need to hear. And knowing that won't take the sting off their actions either, regardless of well intentions or not.\n\nI know it sounds a bit depressing (haha) but as of right now I'd highly recommend a therapist above any friends. The sooner, the better. Talking about it with a professional means that the entire allotted time will be dedicated to only you, who will be neutral, keep you on the path of treatment and you will have a good constant on your routine. You can go with a plan on what to talk, or just go and ask your therapist to help you with leading questions.",
                "I have told my two best friends. I'm kind of thinking that in uni the people are broad minded enough to understand, but I'm seriously doubting telling them or just trying to blend in and act like everything's fine until I will truly have solved my issues. I've started looking for help by the way, I had an intake two weeks ago. ",
                "But who did you tell, close friends, acquaintances? If I tell and people at the very least understand that there's something up with me, couldn't that make a difference?",
                "I'm lucky enough to have at least two people to just talk to without them trying to fix my issues. I like your ideas of trying to have people include you in their plans. I've recently contacted some \"old\" friends from high school and I will see them next week. I'm not planning on telling anyone what exactly is bothering me, only make them aware that I'm having a hard time. ",
                "It's a difficult decision and nobody can make it for you.\n\nIn my case I wouldn't want \"everyone\" to know. Even if people are open minded, a lot don't know how to react. They wonder if they should be more careful around you or they try to be \"too\" \"normal\" around you or they try to avoid you because they don't know how to deal with it. I want to be treated like everyone else and not differently but you can't expect that from everyone if they know. \n\nIf I have a shitty day and a \"stranger\" asks me how I am I just tell them I'm fine but if a friend who knows asked me then I am likely to have a little meltdown right there... I can't expect every random person to be able to deal with that. Not even sure if I would be much of a help if it's the other way around (and I kinda know how it feels).\n\nSo for me it's only close friends... and over time that circle automatically gets bigger anyway.\n\nBut like I said at the start... It's all individual choice and there is unfortunately no universal solution.",
                "If you think it will help you, go for it. \n\nI guess I was just too low at the point when I did tell and I didn't find it helpful, when people responded with \" oh you're just going through a phase, get some rest/take a vacation and you'll get back on your feet\". They were \" understanding\" without actually understanding. \n"
            ]
        },
        {
            "tag": 50062,
            "patterns": "whats the point ??",
            "responses": [
                "I just read about Aspargers that it starts when you're a kid and when you become an adult it like dissappears? I don't know, but it can be solved.  \n\n\nFor now, having a huge IQ and being smart is really a blessing. When the time will pass, you will realise that not all the people are worth it, and yes, we are created to bond, but you can bond with people even if you discover a new medicine, if you discover a new gadget, or anything else that requires your intelligence, this will help them. Just see the advantages in your Aspargers and get use of them, because so many people would wish to have a higher IQ and to think different but they can't. You can be a great personality in the future and help the world with your thinking, this is the way you should bond with people.  \n\n\nJust continue to live and get use of the advantages, because you are blessed ! Xo",
                "There is a point. You may not have found yours just yet, that’s all. And once you do find your point, your reason, whatever you want to call it, there will be times when you lose sight of it and think it’s gone for good. But it’s not. It’s still there.  You will find it again. You just don’t know how long it will take to get back. Having depression is a life of peaks and valleys, but the valleys are really deep and seem endless. You will get out of it.\n\nLastly, about being weird. The secret is we’re all weird. Some just more noticeable than others.\n\n",
                "no it dont go away\n\ni am 26\n\njust sick of this life.\n\nI dont work no more \n\nI dont want to and have to as I got alot of savings.\n\n\nI have an online business thats doing shit !\n\n\nI like using tinder to meet people\n\nas well as you know hook up\n\n\n!\n\nIt exciting challenging and frankly alot of fun !!",
                "Hey, Hairstylist001, just a quick heads-up:  \n**alot** is actually spelled **a lot**. You can remember it by **it is one lot, 'a lot'**.  \nHave a nice day!\n\n^^^^The ^^^^parent ^^^^commenter ^^^^can ^^^^reply ^^^^with ^^^^'delete' ^^^^to ^^^^delete ^^^^this ^^^^comment.",
                "There isn't a point but there is a reason. A psychologist I once spoke to told me that and it's helped keep me alive way beyond my use by date. It's basically this: You're alive, what are you going to do with that? You will always be weird, awkward, difficult, and all those labels society places on us, but you're mostly you and have a reason to find some solace in the life you have. Importantly, you're not alone. We're all out here too and looking for answers to unasked questions. Stay safe friend"
            ]
        },
        {
            "tag": 50063,
            "patterns": "Laziness",
            "responses": [
                "I feel the same way. Nothing feels like I care about it and I feel like depression is to blame with this to some extent. It takes the willpower to work away from people and I constantly feel it doing that to me. Of course I also am a lazy person to some degree. \n\nOne thing that’s helped me is driving, if you can I highly suggest when you have a few hours just drive and listen to music. Enjoy your time with you and enjoy zooming around. It gets you out of the house and the entire time you’re still sitting down. So it’s a win-win. \n\nIf you need a friend, I’m always here. I need a few myself. "
            ]
        },
        {
            "tag": 50064,
            "patterns": "How dp i become happy?",
            "responses": []
        },
        {
            "tag": 50065,
            "patterns": "Lessons from a lifetime of struggle",
            "responses": [
                "thank you for this",
                "Really appreciate this.  Some of these things have helped me immensely when I feel the wave coming on.  Best."
            ]
        },
        {
            "tag": 50066,
            "patterns": "I am Depressed",
            "responses": []
        },
        {
            "tag": 50067,
            "patterns": "How to tell if i am depressed",
            "responses": [
                "Well, ultimately, only a professional can really tell you if you have medically-defined depression. However, it doesn't really matter if you have diagnosable depression or not, what matters is that you're feeling the way you are and it's harming you, and you would like to feel better. \n\nThere are plenty of home therapies and recovery strategies for depression that you can do by yourself at home, I'd suggest following those and other depression-related advice anyways, as the symptoms you describe do seem like at least mild depression. One Google search can find you plenty to go off of (I apologise for not being able to link anything right now, I'm on mobile and pressed for time).\n\nFor now, treat it like it is depression, because even if it's not, recovery strategies should still provide much relief. If you're so inclined, do talk to a professional later, especially if you've been trying self-help for a while and nothing seems to be working. Contrary to what some might say, antidepressants can actually be a godsend for some to rid them of those pesky chemical imbalances. Therapy is another option that can be particularly effective as well. There's no one-size-fits-all cure, as everyone's depression will be different, but a professional can at least give you an informed opinion on where to start on the road to recovery. You have everyone here as well, and may ask as many questions as you please.\n\nSorry once again that I can't get into more specifics, I don't have much time as I'm writing this but I did want to make sure you had at least some cursory insight. Hope this helps at least a little!",
                "I'm not a mental health professional but it definitely sounds like you're depressed. From what I understand, there are different kinds of depression. When everything is going just fine and you're still depressed, that's likely a chemical imbalance. That's the kind of depression that requires medication. But when external factors, such as what you're going through, are causing the depression, you may want to try seeing a therapist before trying any meds. Talking to a therapist feels weird at first but when I found one that I really \"clicked\" with, it started feeling more like talking to a best friend. They can help you create a plan to stay sane and healthy while you tackle everything that's happening. I hate that emotions are so taboo for men; it's part of being human. And with you going through so much, I'd be surprised and concerned if you weren't feeling this way. What you're feeling is just a sign that you're human and not a sociopath. (Have you ever met one?? It's creepy how they can manage to feel nothing.)\n\nYou're not weak. Being able to admit when you need some help takes an incredible amount of strength.",
                "There are lots of online self assessment tests you can use to self-assess to frame a conversation with your doctor: https://www.bmc.org/sites/default/files/For_Medical_Professionals/Pediatric_Resources/Pediatrics__MA_Center_for_Sudden_Infant_Death_Syndrome__SIDS_/Beck-Depression-Inventory-BDI.pdf\n\nhttp://www.netdoctor.co.uk/quizzes/goldbergdepression/\n\nhttp://psychologytoday.tests.psychtests.com/take_test.php?idRegTest=1308\n\nhttp://www.nhs.uk/Tools/Pages/depression.aspx\n\nhttp://www.mdcalc.com/phq-9-patient-health-questionnaire-9/",
                "My best guidance and something I've done for multiple others in the past is to buy a copy of the book, \"I have a Black Dog\". You can get it on Amazon, etc. It's an illustrated book which gives excellent and easy to understand symptoms of depression. This will give you a strong indication. It's also an excellent tool to use with others to explain and share how you're feeling and for everyone to realise this is an illness.\n\nA quicker option but less effective in my view is to find a YouTube version of the book.\n\nIn terms of returning to better health, prescribed drugs is an option but if you feel able to follow a self-help path, there are quite a few things to try, eh exercise (very beneficial), improved nutrition and more. I have a list of things that have helped me over the last 30 years. If you want to know more, feel free to get in touch by replying or messaging me directly.\n\nBy the way, just sharing on here is very courageous and you should be proud that you've been able to take that step. \n\nAnders"
            ]
        },
        {
            "tag": 50068,
            "patterns": "Help me figure this out.",
            "responses": [
                "I’m here to talk to if you want/need.  I’m at work so I can’t promise instant responses but I will do my very best.  You aren’t alone in feeling the way you do.  I was there about 7 months ago.",
                "I just needed to post something, mainly to keep moving. I am just feeling sorry for myself. I need to stop this crazy thinking. \n",
                "I understand.  It’s difficult when you know you are having irrational thoughts and feel powerless to stop them.  Distraction helps me.  But finding a good therapist has helped most of all.  \nI used to hate going to bed before work because my mind would bring out the laundry list of all my failures or all my worries.",
                "I hope you’ve made it out of the parking lot. I find myself sitting in parking lots a lot just crying. Most of the time I go for a drive to clear my head and end up in a parking lot just sitting and thinking. (Wish my area had more scenic areas). \n\nThe first place to start is a family doctor. They can help determine if you have anxiety or depression or both. Medication for both can be given by your family doctor, and a list of therapists in your area can be provided. \n\nI hope you find the help you need and want. Keep pushing through, it does get better! ",
                "I've started hurting myself. I cut myself in the leg with a knife last week, told the people I work with that it happened with chicken wire.   I don't think it helps, but it distracts me. I feel like an idiot afterwards",
                "I agree...mental health is very important so please find the strength to see your dr. What you have decribed has happened to me and it took me almost 6 nonths to a year to realize what what happening. I suffer from depression and anxiety..i also suffer from a thyroid disease (hypothyroidism) i have to take medication daily to restore the hormones that my thyroid is not producing.. I hope youre still reading this.trust ne im going somewhere with this.\nDuring this time my depression was at its peak and i began to feel all the symptoms you just described..when i finally made it to a Dr they advised that i was slowly dieing..yes i was killing myself. I had stop taking my thyroid medications and my body began to shut down. \nYou will never kniw what is truly happening to your body chemically until you see your dr and have an extensive blood work done. I am now taking my meds regularly and feel better. My depression and anxiety are still present but i take it day by day.  Please go see your dr. I will pray for your mental and physical healing. But take care of you because noone else will.. ",
                "Three action steps:\n\n1. Go to the nearest ER. Just walk in and tell the person at the front desk what is happening. That’s all it takes. \n\n2. Call your local community mental health center. Or go there. It’s a big step. But the journey of a hundred miles begins with a single step. \n\n3. Call the Suicide Prevention Lifeline. They deal more than just with suicide. They will help. 1-800-273-8255. "
            ]
        },
        {
            "tag": 50069,
            "patterns": "I tried my best but failed",
            "responses": [
                "Firstly, doctors are totally allowed to be depressed. Heck, even mental health professionals are allowed to be depressed. There's no rule against it. Depression tends to make jobs more difficult to do, but it also can teach you how to preserver.\n\nYou feel like shit now, and it's ok. It can be difficult to look beyond academics when you and everyone around you are focused on it, but life is way more than grades and acceptance letters, and it's ok to fail. In the end, people who never fail are the ones who will break when shit really hits the fan later on in life, because they haven't yet learnt that they are fallible.\n\nYou're allowed to feel like crap about this, but don't let some institutions determine what you are worth. They don't know shit about you aside from some superficial details. Look into other fields of study, like science, business or anything, really. Maybe take a gap year and do something a little odd, like charity work or travelling. Think of your life more like hiking trails than a checklist of things you must do, and it becomes far easier to deal with this sort of thing. Fuck what society says you have to do in order to be seen as worthy. There's more than one way to get to a fulfilling place.\n\nAlso, try to tend to your depression. You sound like you're pushing it down for academia, which is what I have done for lots of years. I ended up getting extra heart beats (benign but scary) because of how much I was ignoring my mental health, and forced myself to start dealing with this icky stuff. Still not resolved, but I've made progress!",
                "Finally, After 2 months, ive reached my safe-house here ",
                "Hello. I don't know what country you are from. I am from Singapore and I face, and faced, the exact same problem as you. And I intend to let myself face it again. \n\nLike you, I've obtained straight As in A levels. I masked my pain, my depression, my self harm, my suicidal tendencies. I applied everywhere, not only to medicine. I applied for scholarships and the likes, and I got rejected from everywhere. 8 total rejections.  Almost everyday I ask myself if I'm flawed. I ask myself if I'm never good enough. I dread finding out through my life that I will never be good enough. \n\nIt is painful. I want to end it all too. I'm tired.\nBut is it worth it ?\nSometimes I see it as, they don't recognise the goods. They made a mistake. Not you. They made a fatal mistake that's going to cost them something bigger in the future. \n\nWhy would I say so ? Because of the people I known who made it in, they are the worst kind of people. Horrendous personalities, hypocrites. These are not possible to detect in a few rounds of so called psycho analysis or MMIs. \n\nIs it worth ending your precious life because of such people who have taken your spot ? I'd say no.\n\nYou tried your best and you failed. I tried my best and failed. I tried to so many places and failed. Does it mean I'm more flawed than you ? Should I therefore defenestrate myself ? \n\nNo my dear. And you should not end yourself. \n\nI quote, a post that I copied to my clipboard, from local forums. To clarify, NUS and NTU are the universities in Singapore with medical schools.\n\n\"If you are really keen on doing medicine after the rejection, there are ways to do it such as doing it overseas or post-grad. But like what someone has said above, doing medicine is overrated and just because you got rejected from nus/ntu eventually doesn't mean that you are not good enough to do medicine; it's just the way things are. \n\nIf you can't afford studying overseas, then suck it up and do something else first and if you still want to pursue it, you can surely do it the post-grad way after working a few years.\n\nAt the end of the day, I would like to stress that rejection from nus/ntu doesn't mean that you are not cut out to be a doctor but think hard about whether the long medical training inclusive of undergrad and postgrad is worth the time and effort or not.\n\nAgreed, please don't think that you are no good just because you got rejected from these schools because to be honest, it is very difficult for the admissions committee to tell if someone is really suited for medicine or not just from a few rounds of interviews/MMI/\"psycho-analysis\". Tonnes of people that were made for medicine were rejected in the years before you and conversely tonnes of people whom\n are not cut out to be doctors got in. \"\n\nThank you for taking time to read this. Because I feel your pain, I really hope that you can stay strong. It's not easy. It's going to be living hell. But at least when you are alive you got a chance to make it right. \n"
            ]
        },
        {
            "tag": 50070,
            "patterns": "I'm sick of it",
            "responses": [
                "Try to start doing something in your spare time, writing, drawing, maybe singing or something it'll help your mind get out of that state, at least for me it did."
            ]
        },
        {
            "tag": 50071,
            "patterns": "Hello, I need help",
            "responses": [
                "Sounds like your parents taught you to lie to them, your girlfriend is probably already gearing up for a breakup, and ya gotta expect the relationship is probably gonna end soon. Might be better to say something like \"i know this is hard on you. Let's take a break. I need to work on my mental health.\"",
                "Hey 🐰 x\n\nPlease be 100% honest with your girlfriend because a relationship without trust is nothing and a relationship built on a foundation op lies and hurt will only case heart-break 💔 and cause her to leave you for good. I know this because someone who I was with about two years ago (I don't know whether he was or wasn't depressed) lied about the small things and the big things (i.e. his birthday, his age, his job etc) and I just left him but I loved him, I mean it was love at first site on both parts. But lying was a big deal-breaker for me because if a person is lying then trust fades. I also think that you should try and change the way that you are because she will leave and if she came back again after she left and you hadn't changed then she would be forever one out of your life. I would say, sit down with her and discuss what you both want from this relationship in order for it to work (she wants honesty but what do you want?) and then try to let her know just how bad you are feeling inside and let her hug you x. As for your parents, I had that growing up to. I wasn't allowed to cry as I would get hit for it and then low and behold I wouldn't be able to stop crying beyond a certain point (it was scary) but I'm one of the most loyal girls along with a few of my friends that I know of and so I suppose that you just have to work on yourself there (it isn't easy and I still rarely cry infant of people but I do sometime shut people and I do sometimes let people know how I feel even if it's awkward or I just don't want to for fear of worrying them, and you'd be surprised about the amount of people who will actually talk about it seriously with you x). I hope everything goes well for you x",
                "You CAN do it! 🏆",
                "Don't worry you're not alone. Reading this I'm in the exact same boat as you. I've got a wonderful girlfriend that i don't know how to express my emotions to. I've been depressed and i can't talk to her about it. Well that was before i wrote a letter detailing what i was feeling and how i felt and i sent it to her. It was a lot easier than talking to her because i couldn't see her cry as she read it and it was a lot easier to express my emotions on pen and paper. All the best and i hope you and you're girlfriend sort things out x "
            ]
        },
        {
            "tag": 50072,
            "patterns": "i have no idea what to do with my life",
            "responses": [
                "You are not nearly as powerless as you feel. Remember that. You have control over the direction of your life and all it takes is making a decision and then following through with the action. Obviously that's easier said than done, but you absolutely are capable of getting your GED. If you do need the help academically, there are countless YouTube channels and websites that should be able to explain the concepts much more clearly to you. It's all in your hands though",
                "I second this. \n\nAdditionally, if you don't know what to do, here it is:\n\n1. If possible, get on your parents' insurance. \n\n2. Find a good therapist. This can take time, but stick with it; it's worth it in the end. I didn't find a good one until a year ago. It can really make a difference. \n\n3. Download a free app that is based upon cognitive behavioral therapy  (CBT). I use CBT Diary, but I have tried others and most of them seem useful. Cognitive behavioral therapy will help you correct irrational thinking. Your brain is marble, and you can sculpt it to your liking  (seriously). Especially now, before your brain finishes developing, which it will do somewhere around your 25th birthday. \n\n4. *Sometimes* some people occasionally require medication. This is a decision that is between you and your doctor. Take their opinions to heart. They were trained to help you make a sound decision.\n\n5. Follow your dream. You might have to work shit jobs while you make it happen, but don't let go of your dreams. Wake up earlier. Don't stay up later, your brain needs sleep. But don't give up on your dream. Make it your real vocation; your day job is your side gig.\n\n6. Face your fear of upsetting your mother. Your therapist will help you to this end.\n\n7. Believe in yourself. I know as well as anyone how difficult that can be, but if you don't believe in yourself, how can anyone else? This is a good one where I find the adage \"Fake it til you make it\" to actually be legit advice. The more confident you act, the more confident you will be perceived to be,  and the more confident you will feel. Your therapist will also help you with this.\n\nI spent the entirety of my teens and twenties feeling exactly the same way you do. I have learned all of the advice I just gave you the hard way. I got in my way so hard. I made excuses, and when I couldn't believe those anymore, I found real reasons not to do what my heart most desired. My family needed me. I had anxiety and depression and ptsd. I was suicidal.\n\nBut there will ALWAYS be something. We have to learn to prioritize. If you can't make time for it, it can't be that important to you. We have to learn to work through the pain, because otherwise, what else is there to do? Suffer? But why do that when you can just write about suffering, draw a picture, write a song, whatever it is you do. The more Resistance you feel toward living your dream, the more important it is that you accomplish it.\n\nGood luck! Remember, success is 1/3 luck, 1/3 talent, and 1/3 who you know. I believe in you."
            ]
        },
        {
            "tag": 50073,
            "patterns": "Bored of everything...",
            "responses": [
                "Same here. I used to enjoy programming. Now I have to force myself to do it. I just keep telling myself that this is not going to always be as it is. Nothing in the world is permanent.",
                "maybe do antidepressants help with that? I feel the same ",
                "I'm not sure. I am on some but still feel the same just less anxious about it I suppose.\n",
                "Yeah I do the same but it's getting really tiresome now...\n",
                "same. I just kept making my life harder or pushing to get further. The more crazy your life gets the more unpredictable and entertaining. But life as we have made it in modern society stands pretty boring, and we are all just kind of living",
                "Have you tried something different lately? A new activity? Seen a new movie? Maybe you just need a change of routine. ",
                "OK at least it helps a little tho :) ",
                "To put a name to this is 'Anhedonia', literally meaning 'without pleasure'. I have also experienced and do experience this same thing and it obviously sucks. Although this doesn't necessarily mean you have depression, it is often a symptom (I'm nowhere near an expert though, so you should talk to your doctor, a psychologist or a psychiatrist). The only advice I can give is that doing social things often helps me, and if not, naps can help when this happens. Note: this is not a healthy practice to keep up, I only recommend this until you can get help/care from one of the 3 aforementioned sources.",
                "Yeah I have, that's the issue I'm afraid. Nothing captures my attention anymore. Just gotta keep searching until something grabs my attention i guess...",
                "Yeah i guess you are right. thanks x",
                "Thanks. Yeah I'll give what you said a bash and see what happens :) "
            ]
        },
        {
            "tag": 50074,
            "patterns": "Does anyone not want to get better?",
            "responses": [
                "I feel this way all the time. I describe my low points and episodes, severe or not, as a sickening bliss. It’s hard to explain to somebody that hasn’t been there but I know exactly how you feel. But trust me this is when you need to get help. Even if it’s seeing a doctor and getting on some meds and/or starting counseling. Because believe me it escalates FAST. But as somebody that completely understands, I’m here if you need anything. ",
                "Not really want, but I see that I have no choice in the matter. A failure like me dosen't deserve to get better.",
                "Yes sometimes I lay in bed all day instead of doing something about my depression",
                "I’ve completely given up, just waiting for the savings to run out and just say fuck it, no reason to live, too much to handle all of the sudden"
            ]
        },
        {
            "tag": 50075,
            "patterns": "Depressed, Suicidal and want Childhood back !?",
            "responses": [
                "I’m sorry that you are feeling this way. I also have trust issues and major depression. Everything that you explained sounded like it could have been me writing it. I lost my childhood and it seems like mentally I am still stuck as that child unable to move forward. It’s hard to explain. I feel ripped off and there is nothing in life that excites me. ",
                "(27 M) I suffer from Bipolar disorder and had much of the same issues you’re going through. This quote actually helps me ground myself when times get hard. \n\nhttps://www.goodreads.com/quotes/523350-if-you-are-depressed-you-are-living-in-the-past",
                "If you have an Xbox and would like someone to talk/game with send me your gamer tag. I promise I will not judge or or give advice unless you ask for it. I will just listen and game. I’m on almost every day so just let me know if your interested. ",
                "I feel the same way, I'm 18, when I was a kid I dreamed to be a child actor, I really want a life like that, no need to go to school, because I can follow homeschooling or take exams to redeem diplomas, when I was in junior high school I practiced the course into a fashion model, but it was not long, because my schedule was clashing with the school, I chose to continue school instead of practicing being a fashion model, this is the decision I really regret, I really hate school, my journey didn't go well, I was ostracized, schoolwork piling up, often late, etc. I really hate this, I regret why I stopped practicing to be a fashion model, my goal failed, I regret why I didn't follow homeschooling, I'm a free person, now I feel like I'm failing everything, I'm so sad."
            ]
        },
        {
            "tag": 50076,
            "patterns": "Suicidal/needing someone to listen",
            "responses": [
                "I'm here my dude. Don't apologize for needing to get shit off your chest. I read the whole thing, and I understand you don't want advice. But I want you to know I'm here. I'm not going anywhere if you need to just chat.",
                "Thank you, i really appreciate it. Ig if money and insurance worked out perfectly i wouldnt be in this spot bc i could go and get the help i think and need",
                "When I was 51/50'd the first time they put me in for a mandatory 76 hour that turned into 8 days. They did a payment plan for me due to Kaiser Permanente being cool. Mental health is a very linient are for bills and hospital stays",
                "I would think about looking into it but i dont have any income. I was going to get my license super fast and then get a job. But its been almost 3 months now. My dad is the main one teaching me bc my brother works long hours and my mom is too scared. But i forgot my dad is suoer flaky and never talks to me. I couldnt tell you the last time he called me to talk to me about me and how im doing. So.",
                "Teaching you? Tell me about that.",
                "Oh i guess i left out the to drive part i lost track kf what i said in my head and what i typed. Teaching me to drive ",
                "Well have you tried calling? I understand it's difficult to try to learn and time is super shitty. Especially when the other person's flakey. Let me ask you a personal question, how much do you drink/use drugs?",
                "I’m here if you wanna vent man. I’ve gone through a lot of the same shit, I still am. But it’s alright though, it’s nothing to beat yourself up about. Pm me if you want"
            ]
        },
        {
            "tag": 50077,
            "patterns": "Depressed, Suicidal and want Childhood back !?",
            "responses": [
                "Hey. You really had and still have it rough there, I am sorry you need to go through all of this.\n\nMy age is the same as yours and I cannot stand getting older while being expected to carry more and more heavy responsibilities on my shoulders which cause me to break down because I am simply too weak. We all know that life is not fair and it seems like it supports the strong and punishes the weak, even though it should be the other way around. Still, I will not tell you to accept this, since it is simply not alright.\n\nHonestly, you seem like a decent guy and it would be really sad if you would just let it end like this. Perhaps, you should try taking care of yourself first and get some energy with enough food and water into you before you think of other things like getting a job. Then, there should be a few heavy burdens less in your head and you can focus on achieving smaller but still the most important tasks like self-care. Of course, it is easier said than done, actually it is pretty hard to get that motivation, but it can make you feel a little bit better. If you cannot make it for a day, it is alright, you will not be a failure and you get a new chance on the following day, just keep in mind you deserve to treat yourself.  \n\nYou have mentioned talking does not help you and you do not trust people. I do respect that but I still want to offer you that you can message me anytime, even randomly in a few months when you seem to need someone but you might think 'this guy has already forgotten about me'. Do not worry, it is completely alright, even if you just want to have a casual conversation or need someone who listens to you.\n\nActually, I just hope everything will turn out well for you. Take good care, my friend.",
                "Same goes for me, I am also here should you want to talk. And honestly I wouldn't mind being your friend. If I could ask, why were you bullied? I mean I get there's not a right answer but I'm just curious. Hope you life turns downs easy street soon my man.",
                "https://youtu.be/3HLsripTf0E\n\nThis video helped me see a few more things clearly"
            ]
        },
        {
            "tag": 50078,
            "patterns": "I am depressed and just so tired of living my life. I have no clue what to do",
            "responses": [
                "If anyone has anything to say feel free to share."
            ]
        },
        {
            "tag": 50079,
            "patterns": "Does anyone else hate themselves for not being happy?",
            "responses": [
                "Depression is a chemical imbalance which can be corrected. Let yourself off the hook for that one. Being sad may or not be depression related, were you sad before you felt you were depressed?  It used to bother me quite a bit but now I see depression has tentacles reaching into other areas of my psyche. Go to a doctor for a diagnosis and forgive yourself. I have been there and it can change for the better. ",
                "I can definitely relate ",
                "I don't hate myself but I do feel very guilty for not being able to be happy.\n\n",
                "I dislike myself sometimes too. I am very depressed. ",
                "It's not hate I feel, but disappointment and guilt.  But I think I completely get it.  People who don't suffer from depression have a hard time understanding and relating, because, well, just stop being sad.  I have a great job, a wonderful loving husband, a stable life and home, but I'm not \"happy\".  I feel terrible that my life is so good, but I feel so purposeless and empty.  I should be happy, and the world around me echoes that all the time.  \"You're so fortunate, blah blah blah.\" But truth is, you're allowed to not be happy.  Depression is real.  Don't beat yourself up over it, the depression dies that enough fur you.  Embrace it, allow it, let go of the guilt, and get help.  Medication or therapy or both.  At the very least talk with someone who can if not relate, withhold judgement.  You're not alone in this feeling.",
                "Going through the same thing.  I can't put a finger on it.  I have an amazing job, place downtown , friends and family.  All the basic food group's I suppose but I'm still not happy.  I didn't leave my house for over a week.  I guess I feel worthless and not worth anybodies time...it's driving me nuts.  I know how you feel ...",
                "Yup. :( "
            ]
        },
        {
            "tag": 50080,
            "patterns": "I really don't know anymore",
            "responses": [
                "I can tell you at 36 years old, and dealing with a cheating spouse, go get help.  I have a nice house, a decent income, that shit doesn't fix anything.    Best case scenario, you find out your fine and work towards accepting the world for what it is.  Worst case, you get help, and hopefully work towards being fine.  I started therapy about 5 months ago.  It gets harder, much much harder.  But I'm certain it gets easier as well and I'm not ready to give up yet.  I've been depressed for decades, I wish I had started working towards this years ago.  Go get help, trust the process.  It's worth the money, time and effort.  ",
                "I've felt like that before. Lost, no one to turned to even though I have sisters and a brother. \n\nMy advice to build your self-esteem and self image. Building those will help you feel better inside. "
            ]
        },
        {
            "tag": 50081,
            "patterns": "Is this a place where i can just talk about things?",
            "responses": [
                "I don't wish to send an unsolicited message, since that's the last thing you need is an inbox just getting swamped.\n\nI am by no means any professional, nor can I promise I can actually help.. But I have the same desire to just talk with someone that literally has zero prior connection and a 0.0001% chance of ever actually meeting me. Sometimes, friendships with a complete stranger can be the most beneficial because they aren't afraid to say what you need to hear, while still being there for you.\n\nSince you willingly gave this same info, I can tell you I am a 29 year old male from the United States, currently dealing with diagnosed moderate (mild - moderate - severe scale) depression. If you have any interest in chatting more directly, please feel free to message me and we can go from there. And if not, know that you have an entire Reddit family here for you. ",
                "Someone already messaged me saying the same thing with my inbox, but honestly im surprisingly good at handeling social media, since i deal with my art accounts for years :) \n\nAnd thanks, ive slept until now after uni, and i feel a bit better (although it means being late for gym again.. :/) but i will message you if i need someone to talk to :)",
                "The side bar explains it but basically this is a place to look for support when dealing with depression, anxiety, PTSD, and others similar things that I can't remember. \n\nIt sounds like you have really bad anxiety and depression. Along with university I would be having breakdowns too. Writings things out is very good for my emotions so I think its a good idea to keep doing it. \n\nIt all sounds really intense. Take is easy. Drop anything extra you're doing and focus on yourself instead. ",
                "Thank you :) its so hard to do so atm though :(",
                "Hey! Nimm dir eine Auszeit, denn bereits fertig und erschöpft, ist niemand leistungsfähig und produktiv. Wenn es jetzt schon alles stressig ist, dann wird es am Ende des Semesters nicht anders aussehen. \nDenke darüber nach, was du wirklich willst in deinem Leben. Wonach ist dir wirklich? Was könnte dir jeden Morgen Energie zum Aufstehen geben?  Egal was andere Leute sagen oder denken könnten.\nWähle deine Gesellschaft weise aus. Wohlwollende Menschen, die sich für dich freuen können und dir nichts neiden, sind die richtigen Weggefährten.\n \"Eine Depression dauert so lange, wie sie dauern soll.\" Habe ich irgendwo mal gehört und finde das stimmt. \nUnd nein, dies ist keine Lösung. Aber vielleicht eine Anregung...",
                "Naja was mir theoretisch jeden tag energie zum aufstehen geben würde wär denk ich kunst, aber das gibt mir kein geld XD und für eine Auszeit is es definitiv zu spät, meine erste prüfung ist in unter 3 wochen :/",
                "Dann ausschlafen, genügend Pausen machen und dir selbst immer wieder sagen, dass du dein bestes gibst und gegeben hast.\nKunst ist ein dehnbarer Begriff und Kreativität und Kunst  lassen sich mit sehr vielen Sparten vereinbaren. Geld ist schon wichtig. Kunst und Geld schließen sich nicht unbedingt aus... vielleicht mal den Pfad einschlagen, den andere noch nicht platt getreten haben."
            ]
        },
        {
            "tag": 50082,
            "patterns": "I'm not sure what to do",
            "responses": [
                "I know it’s hard to see a counselor. Especially when you’re sixteen. I’ve been there. \n\nI’ve wanted to kill myself and sometimes I still do. \nThe thing is, though, that was the first thing that I was able to do. I talked to my high school counselor and it got easier. I found counselors outside of school and it got easier. I didn’t have the greatest of friends.\n\nBut...\n\nI went to college and met people who care about me. I went abroad and found myself. \nI’m eons farther than I was when I was in high school \n\nBut..\n\nI came home and I lost myself. \nI wanted to kill my self. \nI went to my doctor and after seeing counselors for years he put me on anti depressants. \nAnd I hate to say it, but I have to get it adjusted next week. \n\nAnd you know what? All of those counselors, all of these people who I talked to, they all made it easier. They listened when I needed listening and helped me along. They believed me, and gave me mechanisms. \n\nYou can find people who will help. I tell you all of this because you can get through it, but it’s not going to be easy. It never is. But it’s worth it. I went to Rome, I went to Dublin, and now I’m looking to move there because I believe I can. \n\nYou can do it. Baby steps will get you somewhere. Try online counseling if you can- then move forward. You can do it. ",
                "I'm sorry that you have to go through all this, and yeah it does suck that you have to get your medication adjusted, thank you for the advice I guess I could see my high school counselor, and I never knew there was online counselling, I guess that would be easier for me and I could try it. Thank you!\n",
                "Hi m8. I’m so glad that you decided to write a post about it. I know it was hard. Trust me i do.\nI’m sorry, but I think people are very unpredictable, and you need to open with yourself and let yourself be your friend.\nI know this is hard. But I think it might help. (I really hope it does).\nI am not pretending I know your struggle, because I don’t. Heck, I never will, no one ever will except you.\nI’m sorry I’m putting it in the wrong way, but everyone isn’t with you as you are with yourself, therefore, time isn’t enough for one to know you as you know yourself.\nPlease know that they don’t know and they didn’t when they said that you’re doing that for attention, and to add on that, it’s people, heck, they ruin everything.\n\nAlso, from now on, I’d like you to know also that looking for attention isn’t something you should be ashamed for. \nAttention is a need, it’s a need for everyone. It’s a fact. It’s just that some people need more or less. \n\nI’m sorry, i’m sorry in the name of everyone that we didn’t do anything for you, i’m sorry that we never let you be. I am terribly sorry.\n\nI want to help, but it really seems that I can’t. So instead, i’d like you to give one advice, that i wish i knew earlier. \n\nPlease keep looking for attention if you think you need or want it. It’s not wrong.\nBut do it in the right way. \nPlease get to know people before you tell them for your situation. Because only those who experience it want to help and know what you mean. \nDo it in front of people you’re sure are serious, like this community here, and try to explain it in a way that’ll make the other know that you’re being serious, and it’s not an illusion or something you’re just making up. \n\nI’m sorry for the long reply and for not helping, i did my best, and I wouldn’t comment because I knew from the beginning that I won’t help, but since there wasn’t any other comments, i just wanted to let you know that you’re not alone.\n\nPlease feel free to talk to me, and i’m pretty sure that others too here might want to help. I know it’s hard to talk about it, i know. \nBut please don’t stop trying, I don’t know if you will ever make it out, but if you won’t try. I am Sure you won’t. \nWe, as humans suck &amp; life gets unbearable. I know that. But there are people who make life bearable, live to meet them. Be one. I believe in you.",
                "You did help, any reply feedback and idea helps even if it isn't a lot. I know that I need to be able to open up with myself and love myself and do things for myself as well as help others and that might help me. And I think that last part or two was really helpful, knowing that I won't make it out if I don't try that it will be definite but at least if I try there is a chance, and the part about living to meet the people who make it bearable is also reassuring and helpful, so thank you. The last thing I didn't take into consideration is that I can't expect everyone to know how I'm feeling especially if I don't open up and that I should open up to people I trust and who want to help. Thank you",
                "I guess I can relate a bit to you. I'm 22 now, but when I was younger, even younger than you, I had suffered bullying a lot because I was a nerd, weird and well, kids called me ugly a lot. I had a big problem with acne, wore glasses and braces, so yeah. Definitely not the most popular kid. Also didn't had much friends, was too shy and scared of talking to people, as I always felt that I would say the wrong thing and be awkward. Things did get better as I grow up, specially in college, when I learned some social skills and become a bit more confident in myself.  \nI don't know if it will help, but as I was reading your post, I remembered something a guy told me once. He was also depressed, but the reason why he wouldn't give up on his life was not cause he was positive, but because he \"wanted to bet on it\" (I don't really know how to translate the correct expression to english, english is not my original language lol hope it's correct). He was 28 and still felt young, he thought it was worth seeing where life would lead him. And, in a way, I guess I agree with him. It also remembers me of something I read on this subreddit, it was someone saying that death is a certain and definitive thing, but life is not. \nWhat I'm trying to say is, you never know how your future may turn out to be. When I was being bullied and sad, I thought of dying and really wished to die. But now that I look back, I guess it would be really sad, because I would miss a lot of important and big experiences that happened later. Don't get me wrong, I am depressed, still. But I feel happy when I remember the friends I made along the way, the guys I fell in love with, the great conversations I had, the new things I tried. These are things I really treasure. You're so young, you know, so maybe stick around here for more time. Depression is tough, people can disappoint you, but there might be one or two things that make life worth.\nI hope you find a way of dealing better with your pain and problems. My way was looking for a therapist and I'll also see a psychiatrist next week. Don't feel bad about being anxious cause of psychiatrists, I also tried to avoid as much as possible, I was very scared of trying meds. Maybe it'll take a while before you get the courage as well, maybe you will find another type of treatment. I really hope my comment helps, best of wishes",
                "I'm sorry you went through so much, but I am glad you have found people and things that have made the fight worth it. Your comment helps and I guess you are right in saying that there is so much I will miss if I die and that I have to stay alive to see the things that make it worth living and to just see how life turns out. I am also glad that you say it is normal to be anxious to see a psychiatrist at first and it will take time, because I know other people feel this and have to get overcome it too, but once they do it gets better. And I too hope I find a way but now am I going to start looking and not rejecting the help I am offered because I missed so many opportunities. Thank you for sharing, it does help.",
                "Hey things will be better sooner or later. I highly recommend meditation. It might be hard at first but trust me it gets easier after awhile. Here's how it might change and 'hack your brain' for the better https://theincrediblepath.wordpress.com/2017/12/10/how-to-hack-and-rewire-your-brain/ \nYou can do this ! \n"
            ]
        },
        {
            "tag": 50083,
            "patterns": "Am I depressed or am i just being dramatic? I don’t know what I’m doing anymore",
            "responses": [
                "I'm in a similar boat. Girlfriend left me and quickly moved on which completely shredded my self esteem. I can't find any love for myself because my thoughts are stuck in a loop of self hate. It's so hard to motivate myself in college because I struggle to care about myself and my future when I only see myself as a failure, but at the same time I really really want nothing more than to succeed. New girls will show interest but I have such life crippling insecurities that I push them away every time.\nI'm really sorry you feel this way. Something that I'm still learning is not to dismiss your feelings with labels like \"over dramatic\" or \"crazy\" the pain you have is very personal and is present for reasons that matter to you. Try to be as understanding with yourself as you can :)",
                "Are you me? I haven't read something that hits this close to home before. I'm pretty much doing the same thing, always changing my mood, lacking and then gaining motivation countless times per day. Been gradually getting worse grades in class, and lack any care about my education anymore. Constantly dismissing my feelings because I know I'm not the only one out there, along with the fact that it could be so much worse. All I can say is I'm sorry, and I know what you're going through. I wish I could say I know how to get better, but I'm still trying the find the answer myself. The only thing I can say is try and surround yourself with whatever makes you happy and/or progresses yourself in a way that you feel is an improvement. I feel a bit hypocritical saying this, because I'm definitely not the person who is always looking on the bright side, but I'm hoping I'll get there one day. Keep you head up, I know you will find your way, and I promise it will get better.",
                "Im sorry about your situation with your ex girlfriend. Its honestly a terrible feeling to be left and they find someone so quickly.  And it sucks cause sometimes even i have feelings towards someone who likes me but i push them away because i cant deal with the fact that i may drive them away because of my wild emotions. Its so hard to stay motivated in college . I really just feel like dropping out because i feel like such a failure already. But i know i cant drop out because i still want to succeed like you said. Alot of things that usually make me happy dont really anymore. But im guessing its because of the major stress i carry rn. My only hope is that we can get better and become more motivated soon. Thank you for replying. It means alot as this is my first reddit post ever. ",
                "&gt;. . . ¿ alot ? . . . \n\nI THINK YOU MEANT **a lot**\n\n\n\n\n\n^^I ^^AM ^^A ^^BOT^^^beep^boop!",
                "Its definitely a horrible feeling. I cant even tell my family how much of a loser and failure i truly feel like. I promised my mom that i would do good in school and i cant even do that for her. I feel like im failing myself. Im sorry you feel the same way as I do. Its something I would not wish on anyone. It can drive anyone to their reaching point.  My best way to feel better is to just ignore my problems completely, but ignoring the problems just make it worse. I really dont know what I am doing. Thank you for replying it means alot to me. ",
                "&gt;. . . ¿ alot ? . . . \n\nI THINK YOU MEANT **a lot**\n\n\n\n\n\n^^I ^^AM ^^A ^^BOT^^^beep^boop!",
                "Absolutely. If you feel like you have a problem don't silence them even if you think they are unimportant, whether it's your family, a friend, a counselor or whoever, someone will be there to listen. Personally, I always say to myself that when I fail today, it just makes me more prepared to succeed tomorrow. You are not a failure.",
                "Well welcome to reddit haha. Please PM me if you want to talk. This stuff is tough on your own.",
                "ITT: Great communication."
            ]
        },
        {
            "tag": 50084,
            "patterns": "Am I depressed? I have no drive or motivation to work which will actually benefit me later in life. I often feel like my best option is to avoid it by distracting myself from school work by doing things such as playing video games, watching tv/films, when in reality It’s making my situation worse.",
            "responses": [
                "Hey, don't worry about it.  Thanks for reaching out.\n\nHonestly, we can't tell you if you're depressed.  What you are experiencing sounds quite typical, to be honest.  I don't mean to belittle your experience, instead I want just to show that you aren't alone.  People experience this lack of motivation in various parts of their lives, for varying reasons.  Your case is unique, especially because it is happening to you.  But you also, are not alone.\n\nSo, you have some reasons to be stressed.  School isn't the perfect environment for you to thrive, but you seem to enjoy being a drummer.  (sorry, I'm not familiar with the British? school system)  You... procrastinate.  That is... human.  Your subconscious (let's call it that) would rather distract you than experience the pain of dealing with your stress head on.  This is a defense mechanism.  But it's also a mechanism that is making things worse.  You have acknowledged that as well.\n\nMy first piece of advice to you, is Don't Do It Alone!  It's the first step you can take.  Start your work when you are at school.  You might be embarrassed at first, but in the long run it will be good for you.  We can't avoid embarrassing things forever, well you could, but some of the best things in life come from us embarrassing ourselves over and over again (love, for example).  If you start your work at school, you won't be able to stare off into your screen.  You will be closer to your teachers and they will be more willing to help you.  Or ask somebody to study with you.  You will get rejected and you will get embarrassed, but goddammit try it again until you work something out.  The social factor keeps you from becoming a shut in and letting your waffle lizard brain decide what to do.\n\nNext...  introduce some structure into your life.  Why do nuns pray?  Is it to worship?  To purify their souls?  No, it's because the prayer bell rang.  Making decisions takes willpower, and when you are fighting depression and procrastination willpower is limited.  What structure does is it lets you delegate the decision making to the schedule.  You have a certain amount of time each day, at a certain place, you are doing your work.  And you make it sacred.  Something you do according the schedule.  Terry Crews used this technique, he has a schedule to go to the gym.  If he had a terrible day, he still goes to the gym.  He might not work out while he's there, but at least he always goes.  So it's never a fight to be there, he just is.  And look how jacked the man is.  So, maybe you have a study buddy now, maybe not, but you have a time you go to the library and you work.  Maybe choose the computer spot where everybody walking by can see what you're working on, so you aren't tempted to waste time.  But if you do, hey, you're at the library brainiac, pick up a book.\n\nOther things to consider:  Novelty (going someplace new to work), energy (are you eating and sleeping right?), control (is your life absolutely crazy?).  A therapist could help you stick with a behavioral program like the above, help you learn the skills you need to be the person you want to be.  It's not your fault you don't know them yet, in fact I'm impressed you are asking for help rather than burying your head in the sand.  And, then, the behavioral approach isn't enough, then maybe you have a neurological issue (depression or ADHD?) and you need a medical boost.  And even then, the medicine works much better with behavioral accountability.  Otherwise with depression you're miserable with your mood enhanced, or with ADHD you're suddenly really focused at doing things that don't help you.\n\nDoes that help a little?"
            ]
        },
        {
            "tag": 50085,
            "patterns": "Some help please",
            "responses": [
                "Depression comes in many shapes and sizes. For me, out can go from just not feeling like getting out of bed, to feeling a horrible crushing feeling in my chest. Tad one usually makes me wish I could just die. \n\nI never thought I would be depressed when I was younger, but I've had to deal with it for many years. Even when nothing is really wrong. ",
                "You know what, me neither. I think I'm depressed, but I'm not sure. I don't know why I desire to diagnose what I'm feeling so badly. I think stating that \"I'm depressed\" gives you a sense of closure.\n\nSo by all means, if you think you're depressed, you may as well be depressed. Please don't let it get the best of you, though.\n\nPersonally, I don't seek attention at all. I just tell myself I'm depressed as a way to describe my constant state of being lonely, having zero motivation, and not wanting to exist, but sticking in there for some reason.\n\nI guess what I'm trying to say is that if you diagnose yourself as depressed, make it mean something to you. Find the help you need, a community, and support. I found someone near me (they're technically a therapist), and they've really helped me.\n\n(Side note that you can always get yourself diagnosed by a professional, but keep in mind that some doctors can be wack.)",
                "For me, I felt similarly until I realized that most people *don’t want to die*. Even though you don’t think you’d actually do it, I’m assuming you still really wish you could. I needed this realization to be able to see my situation objectively: that people who legitimately want to die for an extended period of time need help and therefore I should probably get help. \nAlso, it seems that your thinking on this is a bit distorted: yes many people of our age group talk about how they want to die and such. But I think for a lot of them, it’s just because they’re in a tough situation, which is reasonable. But if you’re feeling this way, like, most of the time, and not just when you’re going through a temporarily rough time, yes I’d guess that you have something deeper going on. Especially because you want a bit of a push to get yourself to do it- I feel the same way pretty often. I think I was in your situation not too long ago, so feel free to pm me if you have more questions, or just want to talk :)",
                "In my experience if you think you might be doing/feeling something for attention and feel guilty about it, that means that’s not what’s happening. It’s a sort of internalized defense mechanism maybe? Like, I’m not actually feeling this I just need attention therefore everything is fine and I’m fine I just need to get over it, sort of attitude. Take a second to acknowledge how you feel and validate it. Honestly, with depression, recognizing you’re emotions is a really good step. ",
                "So do you sometimes feel ok? Temporarily? Maybe when you’re distracted, just got good news, or something like that? Or should it be most of the time to be classified as depression? I don’t know why I want to give what I feel a name, maybe because if everyone really does feel like this but not everyone reacts the way I do that means I’m just weak. And btw thanks for seeming to care about me more than my friends do I really appreciate it.",
                "It’s sort of hard to say, because every depressive episode I’ve had that I can remember has felt slightly different. Like a lot of the time, yeah, if I’m distracted by my friends, I feel okay and not really be thinking about dying or whatever. It would just be when I was alone or in my head a lot when I would feel really badly.\n\nBut then also, quite recently, for me it’s changed a bit so that even when I feel sort of good in a way, the weight of the feeling would still be very noticeable in the background, so it’s just 24/7. But normally the answer would be yes: distractions would definitely make me feel alright.\n\nA question that you may want to ask yourself is: if you look back at the past couple weeks or so, has this feeling truly affected your quality of life? Has it affected the decisions you make, and how you interact with the people around you? If the answer is yes, (which from what I’ve read about you it seems to me it is,) then it‘s very likely that it’s an issue that deserves to be treated in some way.\n\nAnd yeah, I understand the feeling of wanting to know whether or not to classify it as depression. I suppose being diagnosed proves that, it really is a disease that can be treated, rather than just your personality that you have to live with.\n\nNo problem :) a few redditors have given me a great deal of help when I was still in your position, so I’m more than happy to pass on the good deed. Any info you need, I’ll be here to help best I can."
            ]
        },
        {
            "tag": 50086,
            "patterns": "I think I am depressed and I don't know where to turn.",
            "responses": [
                "Letting it out is a start! I think a young lad like yourself should try out Brazilian jiu jitsu. It’s hard work but very rewarding.  ",
                "Thanks, wasn't expecting such specific advice",
                "Yea man no problem! Trust me I think you’ll like it a lot. ",
                "Alright, So I see you're going through a lot of problems, and they will each take some work to get through. Let's start with, I am also failing uni right now. So, first things first, you need to talk with a school advisor and let them know what you are going through, how school is going right now for you, and that you don't want to be doing this, but you're having problems (I also need to do this right now). I get just trying to work on happiness but then the anxiety of not dealing with it and it isn't going to get better without dealing with it. Time to put on our big people pants (and I'm not trying to be condescending I need to do the exact same thing). You need to tell them so then they can start to work with you on how to maybe not screw up royally and see what you can do about this semester. They may or may not recommend you to a school counselor who may be able to help you with the emotional problems you are having. Maybe there is a university clinic where you can see a doctor. They may give you something to help with your symptoms, anxiety, inability to sleep, etc. This is only a band aid, temporarily making it easier to cope however. The reasons you are having these problems need to be dealt with. If you can't talk to a counselor to unload your issues, do you have a friend you are closest with out of your friends? I know men are supposed to be \"strong, don't cry, not have emotional issues and struggles like this, and if you are, you absolutely can not talk about it!\" Unfortunately, this is the toxic masculinity of our culture that causes men to not deal with their emotional issues and discuss it with their male friends. Sometimes you'd be surprised what happens when you bring something like this up with your friends. Some are likely to be having the same issues, they just don't talk about it. It's up to you if you want to start that conversation though, and who with. Maybe a sibling if you have one? Another option might be to go to the library and get some books related to the issues you are having. Brene Brown's, Daring Greatly might be an option. And something related to anxiety and/or depression. Reading might be a good place to start if you'd rather not voice it to others at the moment. A huge thing when people get to college, is after a while they start comparing themselves to their peers, socially, and academically. It is not a good thing to do, speaking from experience. You have to try hard and learn to not compare yourself to others but rather attempt to become a better you. Focusing on yourself, and increasing self-esteem/self-confidence is way more important. Fuck others accomplishments when you're trying to work on your own. You do you whatever way is right for you. Know for me it took years to achieve, but it's something important to do. I can't really say much about the relationship and weed stuff you mention. I don't have experience with weed, although alcohol is something I've used to numb myself it the past. Of course it's not good, you're not facing your problems. But I understand just trying to cope with life in the moment. Having a short goal to look for in the future and work towards might be something. Pick one goal that is something you need and want, and is a short term goal for bettering yourself in the moment, and focus on getting to that point. I know you don't want to hear this but sex is not the be all end all. Don't get me wrong, it's great, and it definitely makes me lose focus sometimes and not allow me to concentrate without it, however, you don't have to compete with people, and you don't have to be a member of the no fap group. Take care of yourself, you know? Also, it's healthy for you, science says, so.. there. And maybe get some reading on being codependent? Not saying you are, I don't know anything about you, just coming up with ideas. I hope at least one thing I've said might help if what I've said is all a bunch of malarkey. Good luck with everything, I hope you can turn things around soon. Wishing the best for you.",
                "Yeah that might actually help. Maybe the SU at your Uni may have BJJ or some form of Martial Arts at their gym? Which uni you at btw?",
                "Do not settle for misery. It is possible to have a very rich and meaningful life. Don't stop searching for help, or for answers, until things are better.",
                "read this. https://www.quora.com/How-do-I-overcome-a-compulsive-sense-of-despair\n\nspecially the answer by Jordan Peterson",
                "Thankyou this is very helpful. ",
                "Good luck my friend."
            ]
        },
        {
            "tag": 50087,
            "patterns": "I need something to keep me going, or at least to start",
            "responses": [
                "Heya. I don't know what I can offer other than being a friend. Feel free to message me if you want to talk things out. I hope things work out for you, best of luck. ",
                "If you need/want an internet friend/someone to message random complaints to, my inbox is always open. Get off reddit and do something productive, even if it is something tiny, like learning a few words in another language, that will show yourself that you can do something, even something small.",
                "Find something you love, your passion and DO IT. Go to school. Don't give up no matter how bad you want to. Focus on YOU. Focus on wanting to live to make yourself happy. Then you'll be able to have happiness for yourself and not care what others think and with confidence, success in what you want will gravitate towards you.  \n\nThat's what I would tell my 18 year old self. You got this! Don't end up like me, 29 and just now realizing I am depressed. Get help if you need it. Therapy is great, but you're young enough. I think you still have some hope left to be able to shake it off. The older you get, the more it wears on you. Do what you can now, if not, you'll pay for it later. :("
            ]
        },
        {
            "tag": 50088,
            "patterns": "I don't want depression to win",
            "responses": [
                "Be brave my friend. You will never be alone. Seek professional help and if you ever feel alone, feel free to PM me.",
                "Not at all trying to take away from this with self-promotion, but I am alive for the purpose of people out of this kind of predicament (since I know what it's like at the deepest level). Go [check out my website](http://tth.tips). I share a lot of practical, step-by-step ways to deal with this kind of stuff. I'm not a fan of teaching people to \"cope\" as much as teaching them how to conquer, so first comes acknowledging that winning is possible. I also write about this stuff on [Instagram](https://www.instagram.com/p/Banip-qHksY/).\n\nThe BIGGEST problem with mental struggles is they convince us that everything we think and feel is true. There's a difference between thoughts and feelings being REAL, and thoughts and feelings being TRUTH. A lot of the reason people are defeated by these issues is because they don't know how to distinguish between the two. So when a thought or feeling says something negative in a matter-of-fact tone, \"You're worthless\" or \"You'll never be successful!\", the person immediately, even if just for a split second, accepts that as **truth**. Then a downward spiral and wicked cycle of sadness, anxiety and complete loss of identity has free reign to trample us because in our agreement we've given it permission. Oh, it'll sometimes let up, giving us just enough of a break to think it's left for good and we're \"over it,\" then, like the wicked devil it is, it comes back even worse than the time before, making us feel afraid to have hope of being \"cured\" because every time we think we are, there it is to prove us wrong.\n\nFUCK THAT THING.\n\nThe way to kick its ass is to learn who you are, then stick to that with a stubborn and obnoxious insistence. To everyone else you might sometimes seem to border on the line of denial. \"Are you blind? Look around!\" But you're not living by outside opinions of inside feelings, you're learning to live on that truth of identity established deeper than any of it. Setting that solid foundation is KEY if you don't want this thing to keep taking wins over you.\n\nI exist to help people in your situation get that kind of foundation established, so I hope you'll take a bit to go through and read some of what I've written!"
            ]
        },
        {
            "tag": 50089,
            "patterns": "My Depression is killing me and I want to die. I feel Suicide is my final option.",
            "responses": [
                "I'm so sorry. You'll get through this. I heard ketamine works to help depression. You could google \"ketamine clinics near me\" and possibly find one. You're not alone. ",
                "Okay, thank you. I will look it up!"
            ]
        },
        {
            "tag": 50090,
            "patterns": "Help",
            "responses": [
                "i am too..",
                "Everyone wanta me to snap out of it.",
                "I wish it was just as easy as an \"on-off\" switch that people who haven't struggled with it think it is. There is no snapping out, its always a struggle and its always there.",
                "I can't get out of bed,  most days. I hate myself and I feel so alone."
            ]
        },
        {
            "tag": 50091,
            "patterns": "Hi Reddit",
            "responses": [
                "My advice would be to take courses online if your school allows that. This and trying different kinds of clothing materials. Also be shower in cold water with no soap for a bit, see if that helps. (It maybe just really dry or irritated skin)",
                "Thanks for the advice "
            ]
        },
        {
            "tag": 50092,
            "patterns": "Opening up.",
            "responses": [
                "It's very difficult to open up, for me it took me bottling up my anxiety and depression up for the better part of 20 years and had a mental breakdown , now I have my good days and my bad day but it's still had to open up some times . I mean with depression some days your depressed for no reason at all and that's tough to explain to people.",
                "Hey dear!\n\nI know what you are talking about! I am the wife too. My husband has ADHD and I know exactly what you mean. It is hard to keep up. But I love him so I try.\n\nI think about how I can help my husband every single day. I myself suffer from depression and anxiety. So we're both fucked up haha. \n\nSomething that helps is for her to talk to her. Sometimes you don't even need to have a conversation but talk to her as if you're talking to yourself. One, this will help her understand what is going through your head, and two, it can help you loosen up and get it out of your system, at least for a little bit. I think this can reduce the anxiety you feel that comes with the number of thoughts in your head.\n\nMakes sense?",
                "I have a blog, writing about my depression and all. I would suggest an article I wrote, don't know if you will find it useful to show to your wife, or if it is relevant enough, but here it is https://www.mentallywise.com/single-post/First-Aid-Action-Plan\n\nLet me know how it is going, keep in touch. If you have some suggestions for something that helps you, do let me know please. "
            ]
        },
        {
            "tag": 50093,
            "patterns": "I'm a fucking lion",
            "responses": [
                "Wow.",
                "Thank you!\n\nHave you had a similar experience? It is important to know many people with depression suffer from such misconceptions...\n\nIf you are interested, I have a blog where I write about mental health, check it, maybe you will like something else too - www.mentallywise.com\n\nBest,\n\nSF\n\n\n"
            ]
        },
        {
            "tag": 50094,
            "patterns": "I don't know what to do with my life and I am depressed",
            "responses": [
                "I know exactly how you feel because I'm in the exact situation. I have no idea what I'm going to do with my life and I don't know if I want to go to university because I don't think I'll be any good and I've lost my motivation for so many things. I guess my advice to you would be to see a therapist or a psychologist. They provide you with the help that you need and since I've starting talking to a therapist l, I feel somewhat better and relieved once I've gotten everything off my chest. Also, I know this may sound weird but just do what makes you happy and your life will take you places you wouldn't even expect to go. But yeah, I think seeing a professional would be a good idea and also if you need someone to talk to or anything just shoot me a message. Hope you have a good day.",
                "Does anyone have any other advice besides \"stay active and see a therapist.\" I have been trying combat depression and figure out my life this way  for 3 years. I'm not almost 25 and my depression has only gotten worse. I just want to care about something and stop feeling so removed. ",
                "Thank you for sharing that advice. I have also seen therapists in the past, and it may sound childish but they are each like that old friend that you don't see anymore for whatever reason. I do not mean to insult any doctor that works in the mental health field but I personally feel this way, even though I look up to each of them for being the open minded professionals that they are. They have helped when I allowed it. I just get so distracted with my thoughts sometimes that it doesn't always work and I feel so bad for them while it happens.\n\nI never turned to drugs or any substances, I have only taken herbal antidepressants for a short period of time but didn't trust that it really worked.\n\nTalking to someone is one of the most positive ways to cope. Maybe I just constantly need the reminder that there are people out there that are going through it and continue to look for long term solutions. I also could have multiple personality disorder but it's so hard to prove it to a doctor when you can't exactly make it happen. Like a girl with rapid mood swings except I am a young male.\n\nThey just say that I was traumatised at a young age but I have no memory of ever being traumatised for it to develop, I have never been domestically abused or bullied too much at school but i seem to always have this social anxiety.. and it caused be to be the way I am now.\n\nI don't expect anyone to hold my hand through it all because it's a big burden. Last night I was crying for help, today I'm recovering the best I can but I can't stop the overthinking at nightfall. ",
                "I have noticed that for me too. It's been too long and I have certainly changed drastically over the years and now I am here, tired, and can't find any enjoyment on my day to day.",
                "Recently I've been listening to a lot of podcasts and watching ted talks. I've been trying to make small lists of what I like/makes me happy, what I want to learn and what stresses me out. I'm hoping that will help me sort my emotions and desires. ",
                "Having a healthy diet full of variety is important in my opinion. Cooking all kinds of dishes from fresh ingredients and making my own recipes keeps me happy and my body feeling healthy. I also have tried fasting for a day at a time, if I feel like it wont be a struggle, and focus my mind on some of my passions like art etc..\n\nBasically I just try my best to keep myself occupied with things I like. I know it's not easy when you feel like you have no energy and would just prefer sleeping, but it becomes easier over time and has totally been worth the initial struggle for me."
            ]
        },
        {
            "tag": 50095,
            "patterns": "My life sucks?",
            "responses": []
        },
        {
            "tag": 50096,
            "patterns": "I am depressed if I dont find where to buy this shirt",
            "responses": []
        },
        {
            "tag": 50097,
            "patterns": "I think I am depressed but I'm not sure",
            "responses": [
                "Go seek help, OP. Seriously. At this moment, don't listen to anyone about you're just faking it or its not a serious problem. It's not a serious problem right now but it Wil get bigger more than you can handle it. I'm disappointed that your husband is not taking this seriously. Contact your family doctor and get professionally diagnosed. Don't be afraid. Do this for you. Don't give up on happiness yet, go find it. Okie :)",
                "Umm do you have health insurance?  I too am depressed and am weary of being seen as going out for attention because my mom was all about that always certain of her imminent demise.  Anti depressants work so well for me",
                "i dont know if this will help but maybe counseling that helps me big time.",
                "\nsomeone also told me years ago i want attention and drug seeking but really had it and i finally told the truth i was depressed, anxious and cant sleep.\n\ni was diagnosed with vcfs but have a lot of diagnoses but nothing major and look like a normal person but dont feel like im like everyone else and feel slower.\n\nim a big hypochondriac too i feel like im being watched everywhere think i have this i have that, do i have this and that youre not alone, please suggest zoloft it helped my ocd and hypochondria, depression in 9 days different for everyone and i take trazadone starting tonight. \n\ni will update how i felt and feel the next day and list side effects.\n\ni hope this helped im just speaking the truth and not advising medication or giving medical advice just my experience.\n\n\n",
                "Don't hide from it.  Talk to your doc.  No need to inform husband immediately.  If you do get a Dx for depression/bipolar/whatever, get some treatment.  Take your husband in to the doc with you and talk about it if you feel you need some backup.\n\nMy wife actually goes in to see my therapist once in a while to give a third party view of how I am doing.  Also helps to reaffirm that she is being supportive and doing the right things.\n\nI wish you luck my dear.  Go to the doc.  You don't have to do this alone!",
                "I used to be depressed my friend and have come a long long way into loving myself and life now. Message me if you would like some help.",
                "I can't really offer advice, because I want to say thank you. I was actually about to write my own post about pretty much the same thing when I decided to read this first. \n\n&gt; do I feel this way because I am actually depressed or am a feeling this way so people will give me attention?\n\nI just wrote this in my journal almost word for word before getting on reddit.\n\nI just want to say thank you for making me feel like I'm not alone, and also, you're not alone either. If nothing else, at least there's one other person in the world who is as confused and upset as me and that makes me feel a hell of a lot better. I hope it makes you feel a tiny bit better too.",
                "I have health insurance but I don't know which kind of doctor I could go to for help",
                "How does it work when your wife goes with you? I am very embarrassed to talk about my feelings I don't even know if I could talk to a doctor about them. ",
                "It does make me feel better, thank you. I just also feel like I can't appreciate the good days because I think, \"how can I be this happy at this moment if I am depressed.\" ",
                "I think it's good to talk about the way you feel and feelings are serious, I would recommend talking about this with someone who understands you and take you seriously. "
            ]
        },
        {
            "tag": 50098,
            "patterns": "I am not sure if i am depressed.",
            "responses": []
        },
        {
            "tag": 50099,
            "patterns": "Whats going on, am I going crazy?",
            "responses": []
        },
        {
            "tag": 50100,
            "patterns": "How do you know that you have depression?",
            "responses": []
        },
        {
            "tag": 50101,
            "patterns": "I hate my life",
            "responses": [
                "Hi, honey. \nI am so sorry you're going through this. It must be so tough. I hate that you're so young and feel like this. Have you ever thought about reaching out to your school counselor? They are there to help, it's their job. They might be the one you can talk with or help you find someone who you can talk to. I'm so glad you deleted social media, that doesn't help at all with depression. I'm in my 20's and just deleted some of mine and I feel better. Just know you're not alone, and you can get through this it'll just be a long journey. There is so much to life and even I have a  hard time seeing it too But, there is, I'm gonna find what's out there for me and so will you. I wish you the best of luck. You got this. ",
                "You need to seperate yourself from other people's opinions about you.I know it's hard but what someone says has more to do with them than with you.My mom calls me names too but my dad is the worst always yelling and stuff.I have learned to ignore them.I know it's terrible but I don't believe into respecting someone,even parents, when they belittle you.I think the problem comes from within.I'm overweight and when someone calls me fat,I get upset because it bothers md.But when people call stupid,I don't blink an eye cause I believe in my intelligence.Focus on taking care of yourself to feel better.Workout,eat healthy,sleep well,avoid toxic people,it does wonders and try not to compare yourself.the most succesful people of this world all look different,they have different back stories,characters.You are beautiful and smart and kind.That's a fact,I'm telling you.It takes time to believe it,way more that 4 days but you can get there.Also,God won't punish you.He loves you and wants you to stay here with us cause you have a lot to offer.Use your religion for strength,not fear.You are loved,remember that.",
                "That's a really shitty things for your parents to do, and unfortunately, we can't pick our family. But one day, you will be old enough to make the choice to be your own person, free from your parents. I'm sorry you're stuck in this place right now, but I can promise you, speaking from experience, it does get better. There is a whole world out there with a ton of other people who you will be able to relate to outside of this high school bubble you're currently trapped in. You're still so young, don't feel rushed into losing your virginity.  If that's something you want, it will happen when the timing is right.\n\nYou are beautiful. You will meet people who will see that way if you just embrace yourself and be you. Whether or not you believe me, you'll earn that in time as you start to see it. \n\nFor now, hang in there. There are better times ahead. ",
                "My best friend's mom treats her the same way. I'm so sorry about your family treating you like that, however I bet you're beautiful. My suggestion is find things to keep you busy that you enjoy. School clubs, volunteer work. Have fun in school and take up opportunities like internships and things like that. See if you can be a teacher's assistant for a younger grade or something if your schedule would permit it. All this and more can really help. I'd also reach out to the school counselor, they're there because they love helping and are trained to do so. If you need anything please just respond to my comment or dm me and I'll help as best I can!"
            ]
        },
        {
            "tag": 50102,
            "patterns": "Here’s my story. I am depressed from a relationship, and I think I’m finally seeing the light at the end of the tunnel. Maybe. Im still in great pain. But I’m starting to realize that I actually am the victim here. And that I’ve been too lenient in this relationship. What do you think? Who’s right?",
            "responses": [
                "You deserve someone better. She may be an immature 9th grader but trust me, there are so many other girls out there who will treat you so much better. Right now it just seems like she's using you. If you keep this up, she will only continue to hurt you. I suggest you just end it now. ",
                "I might try to fade off of her, I’m not sure I’m ready to block her. But I’ve definitely had enough."
            ]
        },
        {
            "tag": 50103,
            "patterns": "Help with lack of energy.",
            "responses": []
        },
        {
            "tag": 50104,
            "patterns": "i feel i am depressed what do i do?",
            "responses": [
                "There is no step by step answer to this. Your best bet would to understand why and try to overcome it. That is all I can say ",
                "Seek professiomal help"
            ]
        },
        {
            "tag": 50105,
            "patterns": "I'm failing uni, I have no job, I am depressed and anxious and just ready to die",
            "responses": [
                "No, you're not done. There's no way you're giving up that easy. You have a little sister right. She will not understand why her older brother isn't around. You're just 21. Life is just starting. \nFirst things first. Seek a counselor or a psychologist you can talk to. Then, study well for your exams. Not saying it'll be easy but you have to push yourself. Once you do that, it'll be better for u to land a job. Take it one step at a time. And if you can't focus at all, you should really seek out a college counselor for now. \n\nThere will be ups and downs, sometimes a bad time will be a little longer, but it won't be like that for longer. You have to be stronger, if not for yourself then for your little sister. If you need to talk to a stranger, you can always reach out to me. \n\nHang in there soldier. Lots of love and good vibes your way. ",
                "I know exactly how this feels. I was in a similar spot. I failed my last semester, I was going to look for a job but I eventually gave up bc depression, I push away all my friends with my constant venting, and I feel like I've been lying for so long I don't even know who I am or what I really believe anymore. \n\nYou're not alone in this, but the main thing is being willing to take all the necessary steps to make a change in your life and figuring out what you need. You posted on here, so it's good that you're acknowledging and reaching out. Just get through your life responsibilities for now, and if you have a break coming up, take that time to decompress and figure out what you can do to make yourself feel better. You could invest more time in hobbies you like, just sleep, or (if you feel like you need a new perspective) talk to a therapist. Just think about what will best help you and try to get it for yourself. ",
                "I was in your shoes, to some extent still am. Are you able to plan next steps? Sometimes something I do that helps me is writing out achievable goals (getting up in the morning, eating breakfast, taking a shower) down on a piece of paper and checking them off feels like a small win for me. \n\nIt sounds like you love your sister dearly. It sounds like things are really tough right now. I never thought talk therapy could help me, but I gave it a chance and it isn't as terrible as my depression brain made me think! \n\nI believe in you, you are enough, it may not all be okay right now, but be strong and proactive! You can do this."
            ]
        },
        {
            "tag": 50106,
            "patterns": "[NSFW] off medication. lonely af.",
            "responses": [
                "Hey - what kind of hobbies do you have? \n\nIs there anything throughout the year you never get time to do?\n\nMake something nice for your boyfriend and post it to him since he's long distance, I'm sure he'd appreciate that! \n\nOver summer, I'm going to have a lot of free time so I'm currently working on getting into better shape and working through a lot of books that I never got the chance to get through during the busy college year. \n\n\n",
                "hey, I messaged you off of your post from toast me but if you need to talk about this shit feel free to message me",
                "Hey; i'm going through the same kind of crap as you. \nI just forced myself off my meds a few days ago. I can't sleep, I don't have energy, and I may as well have flunked my finals. But honestly, my life picks up when I'm at home. I have IHT (in-home therapy), an actual therapist, a school therapist, and I have a friend of mine who I met on XBOX that I talk to, and he just helps me get through the day. Video games are a great stress reliever, and sometimes even a great way to make friends! I understand that you're a girl, so its actually harder to play on a console since every other guy is usually a douchebag. But no matter what you play on, PC, XBOX, or Play Station, you're bound to have a good time. \n\nFeel free to PM me if you want to talk or need to vent. My door is open. :)",
                "Yeah, I play a love of video games. I really enjoy Overwatch but it can often get a bit frustrating when people realise you're a girl on there haha \n\nThank you so much. Same goes for you, if you need someone to talk to "
            ]
        },
        {
            "tag": 50107,
            "patterns": "Depression, Anxiety, Bipolar disorder, what is it?",
            "responses": []
        },
        {
            "tag": 50108,
            "patterns": "Advice on where to go from here...",
            "responses": []
        },
        {
            "tag": 50109,
            "patterns": "I think I am depressed, what can I do about it without getting any external help [NP]",
            "responses": [
                "Talking to someone is sometimes the best thing for it. Even if it is external help. It's sometimes good to get all the bad feelings out there. ",
                "You can always talk about your problems here. The internet is here for you! *hugs*"
            ]
        },
        {
            "tag": 50110,
            "patterns": "Bad current life situation",
            "responses": []
        },
        {
            "tag": 50111,
            "patterns": "The reason I am depressed",
            "responses": []
        },
        {
            "tag": 50112,
            "patterns": "Do you feel that the people around love you because they just need you?",
            "responses": [
                "dont waste anymore time or energy blaming. blaming is self destructive.  cut them loose. free youself"
            ]
        },
        {
            "tag": 50113,
            "patterns": "I don't think I am depressed but something is wrong...",
            "responses": [
                "I'm not sure what to say, and most of us on here are not doctors. I would recommend that you try and see a professional. They know more about difficult cases like yours. \n\n",
                "Maybe rejection sensitivity disphoria?",
                "Oh holy cow I think you nailed it. I looked it up because I have never heard of it before and it is closely tied to ADHD. I was formally diagnosed with its more vanilla cousin, ADD, when I was 16 so there's a good shot that's what I got. I think I will go talk to a pro and see if that's the issue.",
                "Sounds like a social anxiety disorder, but I am not professional so you may need to speak to one if possible. I am not sure where you live, but most universities in my country have free counseling services that you can access."
            ]
        },
        {
            "tag": 50114,
            "patterns": "I am Depressed, (posting for a friend)",
            "responses": []
        },
        {
            "tag": 50115,
            "patterns": "Im very confused and need someone to listen",
            "responses": [
                "It definitely could be a disorder. Loss of interest can be from depression. I'm a 24 year old male and I have severe depression. It was crippling not so long ago. I am a capable person, I can see what needs to be done to get what I want, and I know the effort it would take to get it, but sometimes my life energy is just sapped away. For me it's like the first snag and I feel like a failure. Even if it's not bad. I can succeed at a task but not do as well as I wanted and feel terrible. \n\nI also tend to have the same feelings about it being my problem and I need to fix it. It's easy to feel like I've let out my disorder and negatively impacted someone's day, it's really easy to spiral myself with those thoughts. Worst part is my mind is often clouded from my depression, I imagine the bad scenarios and ignore the good. Opposite of rose colored glasses. If that makes sense.\n\nDisorder or not, talking about your feelings is good for you. It can relieve a lot of stress. I'm here to listen man. I will help how I can, I have lots of anecdotes from my life, I can also share how I cope if your interested, or really anything you want to talk about.\n\nOh, it might not be a bad idea to post in a relationship help forum too, looking  at the situation from multiple angles couldn't hurt.",
                "Well as of today I feel a lot stronger than yesterday, I started to organize my thoughts, started writing down my red flags (what happens before I start overreacting) and honestly that little bit I feel like I have control of myself. Im trying not to get too ahead of myself at the same time, I dont want to take on too much at once. I find a major contributor is that I tend to look towards people feeling compassion towards me, and sometimes I tend to do things or say things to overreact and make the situation worse (like a guilt trip) so I can feel that compassion.\n\nAnyways sorry for the ramble I would like to hear a little what helped you in a similar situation or experience, if you dont mind! Thank you very much!",
                "Well it sounds like you are on the right track. Organizing thoughts and not taking on too much is a part of what my therapist has me for treatment. Mindfulness is the what seems to be helping me the most. Noticing when I'm feeling down so that I can give it the space and the respect it deserves, that feeling is still a part of me after all. Mindfulness also has a goal of noticing when the good feelings arise, to appreciate them and live in them as long as possible, while excepting that I will be sad again eventually, and that's ok. If that sounds as similar to what you are trying to do I have some techniques to practice it. Like holding an ice cube in you hand and letting it melt, but set your focus on anything other than the ice cube. Another one is to put a piece of chocolate or any melty candy on your tongue, focus on it melting, but don't bite it. Those are some things you can practice that can also help with feeling some control in your life.\n\nStory time. It's more of a cautionary tale then a direct relationship to your events. When I was young life wasn't always good, I was a boy so crying wasn't acceptable, and anger made situations worse. I just put on a smile and pushed negative feelings away. Feelings need to be released. They build up and I can imagine you've felt that. For me, I wouldn't  let them out as emotion, so they came out as vomit. I would through up about once a day from elementary school to high school. No one knew, I felt it was a weakness and kept it in. My body got used to it, and it did work. People thought I had myself together, I was a teen mentor and a tutor, had no trouble speaking to large groups. One day when I was 21 things just changed, the vomiting feeling wouldn't go away after vomiting it made it really difficult  to do anything. I ended up dropping weight, from about 135 to 100lbs before I got help. Been slow and not always steady progress back from then on. The feeling I have can easily transition to anger for some people.\n\nAs it applies to my relationships, it's just too hard right now for me. I feel like such a burden and that I can't offer enough to woman I care about. It's a story I can't get past even though I know it isn't real. I can find ways to be caring and helpful, that part of me never left, even if it is hard to for me to see. Some girls are attracted to me because of my flaws, I shouldn't feel like a burden to them, but here I feel guilty like I tricked them or something. Point of this one is depression clouds the mind, and makes you believe and do things that the logical part of you knows makes no sense.\n\nYou don't have to worry about rambling on man. Anything you want to say to me I want to hear. Hope you continue feeling strong. I'm here if you want to talk more.",
                "Same to you man, i'm here to listen if you need to talk! I'm glad that you are getting the help you need and that you are accepting everything well! I know that once you find yourself out, you will find the right relationship too! I wouldn't worry about not being in one cause in your shoes currently, you can probably grow more being single until you find your right place. Everything will work out man, for me and for you. Just a matter of time! Again thank you for the kind words and advice :) Ill definitely be referring back to this if I feel out of control or lost again!!!! Good luck in all!!!",
                "Sounds good man. Best of luck to you as well.",
                "I'm the same as you in this.  My SO and I ended it today because I couldn't be pleased no matter what he did and I couldn't control my outbursts enough. Idk what is wrong but I looked at BPD also. No idea how to fix myself.  It all feels so real when it happens and then I'm like, wtf, why was it such a big Deal? Sorry, man. I wish you the best. ",
                "That's exactly how I have been. I hope you are able to find out how to defeat it! Im only 2 days in, trying not to get my hopes up but its starting to look better. For me it was just a change in mindset, I have a really hard time accepting that I did something wrong sometimes and even when i told myself I did it my mind actually thought I was wrong, Overcoming that was the biggest help for me! Good luck to you, and i'm always here to listen if you need."
            ]
        },
        {
            "tag": 50116,
            "patterns": "NSFW Depressed and don't want to work; I am not lazy. Mental health is becoming too much.",
            "responses": [
                "From what you've said about benefits and the job centre I'm assuming you're British.\n\nI (to an extent) get it. I also like to feel productive but my mental health set me back massively. If you really are a workaholic try volunteering. It'll boost your CV as well as making it look really good, I mean, who works for fun? You could also try for an apprenticeship, and remember that you can be in receipt of housing benefit if you struggle to pay rent and council tax, even if you're earning.\n\nI don't have BiPolar but I have a condition not to dissimilar (Emotionally Unstable Personality Disorder). I promise you the doctor is trying for a referral however the NHS is really underfunded when it comes to mental health and it will take a long time. (I'm the same as you and waiting for my therapy to start, however it may be sent onwards to a non-profit organisation). It may be an idea to be put on medication if that's something you feel comfortable doing too as it will probably help you.\n\nIf your finding it all too much try getting in touch with the samaritans or mind. You also said you do art, use this frustration and plug it straight into the art and create something fantastic. I know you said you don't have a following but there's no reason you cant start something on reddit if you try. I know some Depression/anxiety subreddits encourage people sharing work. For instance I'm thinking of possibly starting a youtube channel of my stories of mental health, what I understand about conditions, misconceptions, and maybe throw in some comedy in there to to brighten it up in the hope that other people can find comfort in it. (Like you, wouldn't have any publicity and it would probably just flop though)\n\nHope I helped",
                "Yes, I am British.\nI recieve £200 towards rent and £245 in help. Rent takes £400.\nMy last job was an apprenticeship but they couldn't pay me more. I am 20, and was working at £3.30/hour. Which reduced my benefit help despite the low wage, they gave me £40 and took most of it due to earnings. £500 with £20 left after rent and tax. \nUnfortunately there is no where to volunteer around here (I live in a very rural area) and I have no transport. I would love to volunteer with animals.\n\nI have sleeping meds but I react bad to the others. Nightmares and worsened hallucinations etc.\nThe organisation they are referring me to is non profit, they seem ok. Its just waiting for the appointment to come through.\n\nI have done a few pieces. I decided to do some based on happy memories so they made me happy when I saw them. But I dont know what to do with them. I want to do panda cartoons and cat stuff and maybe create prints or teeshirts. Something I know people would maybe be interested in maybe. It is just setting myself up. I always wanted to sell art work to people who would appreciate it.\n\nIf you start a youtube channel, drop me a link if thats ok? I would love to see your content. I think it is good more people strive to make more people aware of mental health issues and dispell the stigmas.\n\nI hope it doesnt seem like I shot down your suggestions to me, I just wanted to reply honestly. My situation is just meh.\nYou have however inspired me to draw a new piece involving stars and clouds, so thank you &lt;3\nI dont know if I should work on it tonight or tomorrow...\n\nThank you for your response. I hope my reply makes sense. I feel kind of dopey at the moment ^^\"",
                "Damn. That's the problem with living in a rural area, cheaper to live but nothing to do. When I was in London I had the opposite problem as it's SO DAMN EXPENSIVE. I've moved to Southampton and it feels like nothing's here despite it being still being a city.\n\nYou never know what's in the area. Check out Doit.org as there may be stuff in your area. Also if you're over 18 they have to pay you more after the first year in an apprenticeship.\n\nHave you mentioned the side affects of pills to your doctor? I have never heard of hallucinations as a side affect. Anti-psych meds could help with that and if you're not seeing a therapist then your doctor's basically letting you go untreated which is not ok. \n\nYou could make novelty T-shirts and sell them online through your own store or someone else's. The internet's a great place I'm sure you could find someone who has a t-shirt store or someone who can make them and sell the designs. Starting a small business would keep you occupied too.\n\nAnother idea is selling them as prints and get a deal with an online canvas printer. I've been tempted to do that with my photography. Plus it'll give you a real confidence boost\n\nAs for my YouTube plan, I have no idea what content I'd include and don't even have a good camera or mic. I wouldn't want to make it all doom and gloom either; letsplays could be good but I'm nowhere good enough at games yet.\n\nI'd like to see the new piece when it's done, sounds really cool. "
            ]
        },
        {
            "tag": 50117,
            "patterns": "I need help",
            "responses": [
                "i honestly dont know how to even help myself, so im not gonna act like im your savior. but i want you to know i feel exactly like you do. *sigh*",
                "It will pass. Focus on friends and school. At the end of the day, when your out on your own and school is over friends and family get you through shit, whether you attain those unattainable goals or not. Things are attainable. If there's something in this world that makes you wanna work, hold on to it. You're fine. Everybody has felt that way. Depression isn't feeling there isn't anything good in the world, it's when you get to a point that that feeling turns into your will to withdraw from said world. Don't get there.",
                "I think the problem with us is that we always see those who have those pretentious rich lives. It is not real.\n\nWhat I learned is to not look at those who have more than you, but those who have less. Only then you can appreciate what you have. There is **always** somebody who has it worse than you.",
                "If it helps I have the same problem and did when I was your age (I'm 20 now). I used to dream of being of being successful in some way but my ideal scenario would change so often and I never get passionate enough to really stick to anything. What makes you ay your dreams are too unrealistic? If you put in the time and effort and are willing to accept rejections on the way then there's no reason you can't at least get a taste of what you want.",
                "Listen motivational speech https://www.youtube.com/watch?v=FhzNSPiqO0M&amp;t=378s ,That is usually what I do and also if it helps I am bipolar and I live in Canada by myself and I ski race to keep myself mentally strong"
            ]
        },
        {
            "tag": 50118,
            "patterns": "I need help.",
            "responses": [
                "Speak to your doctor. Ask about antidepressants. Consider bereavement counselling (if appropriate). Find your closest friend/family member and tell them about how you're feeling, without blame or anger, just explain how you feel and talk it through. Sometimes a loved one is too close which is why counsellors are perfect - they will listen, are non-judgemental and will help you find yourself again.",
                "Thank you. ",
                "what i find out about life is you can only be loved if u learn how to love yourself. spend more time to solve your problems with insecurities. i can highly recommend to speak with ppl and simply ask them how they handle problems to feel good and better. besides that just give a try for a therapy",
                "Don't get anti depressants. That shit will fuck your life and make it worse. Its like digging a hole and making it deeper when anti depressants are taken. Look don't isolate yourself. Try to spend more time with others. Hide your phone from yourself and try to spend as long as you can without technology. Challenge yourself in that. Try to socialize more. Meet new people. Start a conversation with someone and see where that goes anywhere you go. If you are a kid spend more time with your family. Convince them to get out the house and do something fun with them outside. Watch a movie. Play laser tag. Something everyone can enjoy.",
                "I have the same issue as op but I feel like this is easier said than done? I want to socialize more and be happy but just talking to people is a challenge... any more specific solutions? :(",
                "But, my parents are my only family, and they're ALWAYS working...",
                "Try a simple conversation. No matter how difficult you think it is. Words dont bite. Anywhere a public place or with family."
            ]
        },
        {
            "tag": 50119,
            "patterns": "i can't tell if im depressed or not...",
            "responses": [
                "I would say yes. I've been struggling with self harm for almost a year now and what you've written mirrors a lot of the thoughts and feelings I've had. Whenever there are clear vivid thoughts about how you'd kill yourself that's huge, don't pass that bye as \"normal\". I did that for way too long before I got help. Stay safe, you're not alone cause there's literally millions of us who struggle with this each and everyday. Hope the holiday season and new year treat you well.",
                "thank you for caring &lt;3&lt;3 i hope you get well soon too"
            ]
        },
        {
            "tag": 50120,
            "patterns": "I'm trapped and I need help.",
            "responses": [
                "I think talking to your school counsellor about this issue more is important. Hopefully they can either facilitate a discussion with you and your dad or find some resources you can access on your own. I know that can be scary but it's important that you get the proper help you need and deserve. If there's any other family members you can talk to about this as well that might be good too. I hope things work out! ",
                "Hey buddy :) my parents too don't believe that i am depressed or suicidal at all. They think i am making it up to find excuses to not study or do well in school which is sad :,( . In this case, is  your step dad  the only one in your family who believes in what you are going through? What about your mum? To be honest, I think you should open up more to your step dad since your own dad doesn't believe you. Besides that, your step dad sounds like an amazing guy who loves you so much and i can also see that he is trying very hard too. He maybe just a step dad but hey, it's just a title. You can love him more or the same as your own dad okay? \n\nLots of love, \n\nKen Vee ",
                "Well my Dad was just lying about it being my Step Dad when I confronted him about it. Just so he wouldn't have to discuss the topic with me further. I've brought this situation up with my mom and she's not willing to do much since she's working a lot of the time. My step dad and I don't really see much of each other or really connect since I do live with my Dad and hardly go to my Mom's .",
                "Have you considered talking on the phone with him (your stepdad) or FaceTime-ing with him? Are you happy living with your dad? Would u be happier if you lived with your mum? Are your friends supportive and there for you? :) Do u wanna talk to me on the phone on a free wifi audio call? I'll leave my contact info if you want :) i just wanna help. ",
                "My step dad or my mom are not on good terms with me as my mom kicked me out of her house forcing me to live with my Dad. I'm not really happy at any either place actually. You can leave your info and pm if you'd like. ",
                "Okay i'd like to talk to you, my skype id is: kenveelimd8 and also where are you from? I'm male and 16 from Malaysia ( a multicultural country) give me your id"
            ]
        },
        {
            "tag": 50121,
            "patterns": "I am feeling depressed because of my boyfriend.",
            "responses": [
                "One of the biggest problems I see is your age for starters. That's a really unhealthy age gap. Once you hit your middle 20's, it stops becoming much of a problem, but you're not even 18 yet and you're dating a fully fledged adult. However, I'll leave that to one side for now. \n\nLook, if you're asking Reddit for help, there's a problem. And it's not a problem that's minor, if you really had to come here and ask us for help. It's a big, big problem by this point, and it's obviously effecting you immensely. My best advice for you is to break up. Once it hits this point, it's too far gone. You see, when I was with my ex, I was like you. I didn't wanna let her go, but we fought almost daily. She would /always/ bring up past fights like he's doing, and it hurt me. She would hold grudges for weeks, maybe even months. I realised I wasn't happy with her, and she was hurting me more than she was making me happy. \n\nYou realised he was doing that, but got back together because you were scared. I understand, but that was the wrong thing to do. Please, please listen to yourself. Don't be with him because you're scared to be alone, be with someone because you truly believe they're the one and you're happy with them. Don't settle for mediocrity, or unhappiness, which seems to be the case here. Only you can make this decision, but I'm sure the people here, and I definitely will, help you do it. But my best advice is to end it. Don't be scared of being alone, do it for your sake and your happiness. \n\nEdit: and don't ever be with someone just because they have problems and you wanna help. I have depression so I know how it feels, but people shouldn't date me out of pity and wanting to help. They shouldn't be scared that person will kill themselves if they leave. A girl did that to me many years ago (which is one of the reasons I have depression) and it destroyed me. She was one of the worst people I've ever known, and she would continuously use her want for suicide to get things and to keep me with her. Don't let that dictate your decision. Do something because you want it, not for how it effects the other. Also that's one huge sum of money he stole (yes, he's stolen it) from you. That's absolutely unjustifiable. Please realise this man isn't a nice man and leave him. Not only for your sake, but then he might actually sort his life out. At the moment, he's just sponging from you and not caring because he knows you don't want to leave. Well show him you can. ",
                "I'm sorry to admit this, but I only read the first paragraph and it was enough information. \nHe is bad for you and you need to break it off. It will be a difficult and hard step to make, but eventually you will be thankful and move onto greater things with your own life.",
                "That's unhealthy. You may love him but you can love others too. Trust me, you don't want to stay with him. ",
                "Hi, thank you for your comment. It helped me a lot. I broke up with him 2 days ago, but that was when I realized I really couldn't understand him, and neither could he understand me. He still didn't know how I was hurting from this relationship and thought that my mum was trying to tear us apart (my mum already wanted me to break up with him). I said one sentence that I knew would hurt him the most \"it was a suffering relationship\" I cried so much after he left, and I knew from his voice that it hurt him so much, something that I never wanted to do. My heart still hurts so much and idk what to do. I'm regretting leaving him, all alone when he needs me the most, as I felt that way the past 2 nights, I needed him, and it was torturous. I know my brain asks me to stop but my heart can't control myself. What should I do? I still go to school like nothing happened, but my heart hurts so much... ",
                "Hey, I'm glad you did what you did. \n\nNow is the most crucial part, though. You MUST stick by your decision. You can't afford to be weak. As I said, don't ever be with someone because you pity them. That is not a good relationship. You'll only get back together for a few months, get miserable again, then leave him once more. \n\nI'm sorry if this sounds harsh, but this is the advice you need, rather than the advice you probably want to hear. You cannot be with this man. He's making you miserable. He's making you depressed for goodness sake. He's stealing money from you. He's an absolute train wreck. You need to say no more. Dating him out of pity isn't only bad for you, it's bad for him. You need to move on for yours and his sake. You should be with someone who makes you happy. Who treats you like you're royalty. Someone who you want to date and don't feel obliged to. Someone who'll make you feel like you never have before. It's time to move on, and there's a whole world of men out there. "
            ]
        },
        {
            "tag": 50122,
            "patterns": "I think I need help NSFW",
            "responses": [
                "Hang in there my friend. Things can get better. Keep following the passions that interest you. Occult stuff is cool! Keep reading and keep writing. Find some sort of escape. I know these things are easier said then done, but just wanted to let you know someone heard you. ",
                "Hey! \n\nI actually can relate with the feeling, having had some similar thoughts when younger. What I can say is: it was so worth resisting it!\n\nYou mention that we are all going to die eventually, right? So, why not make most of life? Its not the destination that matters, but the ride!\n\nSee, the things you mention are a big deal for you exactly because you care so much, which in the end is a good trait of you and one through which you can make the world so much better in your stay.\n\nNow, for the practical stuff:\n\n1- If you REALLY don't like these music classes, is it possible to substitute it for some other activity? Talk to your parents, tell you want to try something new! even if its something you can't change,  worst case scenario you will have to handle for just a couple more years, less than 5% of your ride\n\n2- you don't make people unhappy, that simply doesn't exist! Even if you were the worst person on land, someone's happiness depends solely on the person. Everything else just contributes to the effort they have to put in.\n\n3- You found some things you are into, awesome! Pursue that, not because you might want a career... But to satisfy your curiosity! The feeling of learning, understanding something you are excited to should be enough\n\nSo, if i could give any suggestions from a more experienced perspective: don't take life so seriously. Go out, focus on something you like or never have done. Distract yourself. Humans are creatures of habits, you won't lose the ones that you dislike if not putting something else to occupy that time.\n\nAnd finally, most of what you do now is not as determinant of your life as you're led to believe. Its an amazing privilege to be able to try new things and change, with minimum consequence; that is the sole piece of advise I really hopped to have had in the past",
                "Gonna pick up on some of your points:\n\n&gt; I play clarinet at school and I hate it\n\nI believe you have a choice of what lessons you take and can do something else. That said, playing an instrument well is a long term win in terms of picking up women, so think carefully before you drop it.\n\n&gt; I do not want to tell any of my friends how I feel.\n\nActually I think this is good. People do tend to avoid depressive people. What I would try and do though is try and get as much pleasure and happiness out of friendship as possible\n\n&gt; I cannot think of anything positive about the future\n\nYes you're right,  everyone **is** going to die. However, I think its worthwhile to get every moment of pleasure you can out of life before kicking the bucket\n\n&gt; why should I live if my life is so insignificant\n\nYou don't know if your life is going to be insignificant at 14. My life didn't start becoming significant till my late 20s when I became (moderately) famous in my field of work and also lost my virginity. Before then I was a withdrawn loner.\n\n&gt; My sister is better than me.\n\nYou have to stop competing with your sister. She's not better, she's different. I am ugly, terrible at sports, struggle to socialise, and not quite tall enough. My brother is 6'3\", fit, can sell ice cream to Eskimo's. I did things very different to what my brother did and as a result I don't compete with him. \n\n&gt; My parents say I have no other interests, but I do. I chose psychology as a GCSE option....\n\nCongratulations, you've found something interesting. Now find other interesting things. Life is about learning about interesting stuff and doing interesting things.",
                "Life will get better. I believe I suffered from depression in my mid teens. It was a horrible time for me but but I got through it and life is good. "
            ]
        },
        {
            "tag": 50123,
            "patterns": "I just need to vent, get support talk to others. ( if you get bored just skip to the bullet points)",
            "responses": []
        },
        {
            "tag": 50124,
            "patterns": "phobia of killing my self",
            "responses": [
                "You must simply lower your standards for what constitutes a decent life until life is able to meet your expectations."
            ]
        },
        {
            "tag": 50125,
            "patterns": "Do I have depression? What kind?",
            "responses": [
                "Hey man, just wanted to reply and let you know you're not alone here. Don't keep it all inside . That's what friends are for.. "
            ]
        },
        {
            "tag": 50126,
            "patterns": "4 C's as a junior in high school I feel like killing myself",
            "responses": [
                "I know medical doctors and nurses who got Ds or Fs in high school. A group of Cs is not going to ruin your life and I don't think it'll hurt your GPA too bad. My first semester in college I failed all of my classes and now I make As and Bs.\n\nMy advice to you is to just stop for a day take what I call Mental Health Days and just relax don't think about school don't think about anything but relaxation. This helps me when my depression starts making it hard for me to handle school. ",
                "Thanks I'll try that day of relaxation out.",
                "There is still time because it's half of the school year. I am in high school too, and I know how it feels to have low grades, it gives me severe anxiety. If you're struggling, try to seek help from your teachers or ask your parents to find a tutor? Do you ever ask your parents to help you out? \nA few good apps I use to help me in school is Quizlet and my Homework. In quizlet, you can create your own notes and there are a few ways to study, and you can even make a test from the notes and take it as practice. I highly recommend because taking notes and studying in different ways rather than just looking at them on paper has helped me by a long shot. It stimulates the brain and is better for memory. My Homework app is like an agenda, if you don't have time or like to write on paper, I recommend this app. You can divide into classes, add class info, list the priority of the homework, add the due date, and it just divides &amp; organizes your work for the week. I don't know what I would do without these two apps. Please try your best, I know you can do it! If you truly care about your future, change this, it's all in your power. You can change those grades. And do better senior year, just keep track of yourself and do your best, ok? ",
                "\"I feel if I keep this up my life is meaningless\" Please realize the power you have within you. You can achieve anything, ANYTHING you want if you set your mind to it. I know depression is tough, I have struggled with it myself and it sucks. It's like I feel like I'm a great person with potential but I sabotage myself. Trust me you have to win the fight between yourself. Don't let your negative side win. Work for your positive side instead. \n\nYou're in highschool. This does not dictate whether or not you will live a successful life or not. I FLUNKED high school but turned it around in college and now I've been given scholarships to play sports at a university. Things can and will get better if you work for it. Yes only if you work for it. Try to accept that sh*t is just plain harder when depressed, but it's important that you keep pushing forward because the storm will pass and the spring will come. \n\nIf your bad grades make you sad, do better next semester. Your solution is simple please don't dwell, it doesn't get you anywhere. Realize that life is LOOONG. 1 mistake doesn't dictate your future and neither does 1 success. Live life in the moment. On a moment to moment basis think to yourself, \"How can I create the future I want?\" Set goals for yourself than be proud of yourself for achieving them, big or small goals. The main tip: Believe in yourself, and don't give up. Those 2 things are unstoppable when put together",
                "Thank you 👍"
            ]
        },
        {
            "tag": 50127,
            "patterns": "Notes on being a Hermit, at times Bitterly Depressed",
            "responses": [
                "I can relate to your first paragraph. I have a hard time making new friends, and maintaining current friendships due to my life crushing depression/anxiety. I remain untreated medically for my severe depression and I grapple with the idea of going on meds (for multiple reasons).\nI often find myself wondering; what if I'm unlike able because of my depression, or worse, what if when I'm feeling better and being treated, I'm STILL unlike able.\nAnd a bunch of other scary thoughts. :(",
                "I feel you."
            ]
        }
    ]
}