{
    "intent": [
        {
            "tag": 20000,
            "patterns": "Hi, i’m Laura. I am a 14 year old girl from the Netherlands.\nLately I've been struggling with depression. I am becoming obsessed with facts and a lot of these facts are about death. I am very smart and I have an fotographic memory so I don’t really forget thinks. My mom thinks my feelings are fading away because of all these facts. I still do have feelings, but I never talk about them, I never show them and no one ever really notices if I’m feeling down. Everyone knows me as the happy kid. I always smile. But it’s never a genuine smile. My mom also thinks, because I read so much, I don’t enjoy life anymore. This is very true. I think that that is the reason why I’m obsessed with the death. I have suicidal thoughts and I want to die. I don’t think I want to kill myselI, but I do want that something bad will happen to me. That I die of a natural cause. This might be a bit weird, but it’s just the way it is. I’m also an introvert. I can overthink everything. I can stare at a wall for hours and just think about life without getting bored. My mom thinks this is weird. She wants me to go to an psychologist. Do you guys think that is a good solution? Does a psychologist really help? And, has someone maybe experienced something like this?\n\nIf you take the time to reply to me, thank you dearly!\n\nI’m sorry if I have made some mistakes in the grammar, I hope you’ll understand it!",
            "responses": [
                "Hey,\n\nYoung one.!\n\nSorry for those.\n\nYou know that you are smart girl and you always seems like happy.\n\nIf a smart girl wants to suicide, what about of other normal girls?\n\nCan you rethink once dear friend?",
                "Yes please go see a therapist. It seems to me you are very smart which can be hart as well as puberty. Together it can make it difficult to see the world clearly. If you like you can write me. I went through something similar when I was young.",
                "No worries on the grammar. I do think that it may be better to see a psychiatrist. They become psychiatrists for the sake of helping people. You should go see one and I thank you for posting in a time of such emotions that you might have.\n\nP.S.: Weird reply wording. Also, i hope this is how P.S. works.",
                "Laura I'm sorry you are struggling. I have removed your post because it appears to have your real name. It can be dangerous for people on Reddit to use a real name in association with their account. It can be used for harrassment or abuse of the user, and I would hate that to happen to you. Please consider making a new account, and copy pasting your post into that. I want the community to be able to help you but real names on this platform put you at risk. I hope you understand. AO."
            ]
        },
        {
            "tag": 20001,
            "patterns": "Decades of depression and CPTSD have worn me out and I am just so tired. Tomorrow I go to work and fake my way through another day of extroversion and normalcy. Every day I try to stay on top of the hardship and sadness. I know I am utterly accountable for this failure of a life, I had a chance at a good life and a PhD but I threw it away and instead made extremely poor choices, and twenty years later I’m trapped. About five years ago I worked at learning as much as I could about depression, betting it all on neuroplasticity and believing that if I just made enough positive changes and incorporated wellness practices, I could beat it. I took MBSR and developed a daily practice of meditation and yoga, I gratitude journal, I take supplements to reduce inflammation and improve gut health, I incorporated Morita therapy principles into my life in combination with Kanban planning to reduce procrastination and manage anxiety, I’ve read The Body Keeps the Score and Pete Walker’s books to help me with self-compassion (that’s a struggle), I had a good psychologist but he is nearing retirement and it’s not something I can afford to continue, I hike and camp and backpack to be immersed in nature and get some exercise, I drink water, I have a morning wellness routine, I just really thought I could finally turn this around if I just worked hard enough. But in the end, I’m alone and hurting. I don’t have family - my foster parents are predominantly absentee as they have many other priorities and I married someone with a drinking problem and refuses marriage counseling. Money is tight, I get by but it’s not pretty. I’m struggling with suicidal ideation, not because I want to die so much as it is just the only thing I can think of to stop hurting. I recognize the depression is getting more of a hold on me, but I don’t realistically have much to hope for or dream of anymore within the context and reality of my life, and no more energy to fight. Part of me wonders if I am not actually alive, if maybe I am in some sort of purgatory and I ended my life years ago. If so, I want to sincerely, deeply, and authentically say I’m sorry. I want to make amends. If this existence is a punishment for me, can I rectify my mistakes and have a chance at alleviating the depression and pain, or is this as good as it gets?",
            "responses": [
                "Wow looks like you are doing everything right. I believe neuroplasticity is a thing when you are young and gets difficult to achieve the older you get. I think neurochemistry is at the heart of many cases. Typical antidepressants work in around 40% of cases but Im not sure they cure anything only they lift the fog enough so you don't commit suicide and have enough juice to change your behaviour patterns. They say entheogens can help cure depression but there's mixed data and a lot of hype but it looks promising. Other than there are five things which are 100% proven to lift depression. 1. Excercise, I have had luck with this, at a minimum you should aim for 1 hour a day for at least three times a week. 2. Reduce ruminating - the brain enjoys chewing the cud of the past, try cordon this off and look to now and the future only. 3. Counselling - you seem to be doing this, maybe look online for Skype therapy? It's cheaper... Maybe look to friends and colleagues and be more open with them,",
                "Thank you for this. You are right, I can increase exercise, I’m getting in an hour 2-3 times per week but usually closer to 2 hours so that I can definitely improve. Since I hike after work and we’ve been getting an unusual amount of rain, it’s easy to make excuses but I can do better. I can also do better with working on present moment mindfulness and reducing rumination, it helps to just focus on the task at hand to reduce anxiety and I can do more of that. The challenge I have with being fully present is that I don’t want this life and I don’t have a future that looks any different; same hardships, triggers, and profound loneliness. I take similar supplements, Omega 3, D, turmeric, a probiotic - which B vitamin do you use? There seem to be several such as B complex and I’ve thought about it but don’t know much in this area. What has worked for me? Yoga and controlled breathing helps me with anxiety when it’s bad, Kanban helps me with managing daily tasks and some minimal self-care, I’m not doing good right now so I don’t know what has helped with depression. I don’t know for sure that this isn’t a horribly elaborate nightmare I’m having rather than a real life. But maybe that doesn’t matter.",
                "Don't worry, be happy and don't apologise for anything that you haven't done.\n\n&amp;#x200B;\n\nIt's your life mate. You get a single one and I wish I could comprehend that myself.\n\n&amp;#x200B;\n\nMaybe you've wasted some of that life and not taken all the chances you've been offered. Life is full of \"what if's\" for everybody and the only thing I can say is \"you can't change the past.\" (unless you have permission to edit wikipedia pages)\n\n&amp;#x200B;\n\nWhat I do when I feel like my life is meaningless is try and make someone else feel better. Seeing that I have the ability to improve someone's life even slightly is enough to make me happy.",
                "If it remains the same it's as good as it gets for now but progresses with time. Only you know if its as good as it gets.",
                "Thank you for this, you reminded me of something I can do and need to do today and each day - seek out opportunities to brighten the world for someone else. It’s easy for me to forget, and I am grateful for the reminder. Also, thank you for making me smile unexpectedly... I would like to have editing permission on my Wikipedia page for the past, but since I’m not an admin, I guess I can at least edit the page in the present moment. I like this as a reminder and metaphor.",
                "I want to believe that if we do all these things (I do them too!) that it will get better. If we take care of our brains, bodies, physiology and do the neuropathway building- it will build over time. We may still have episodes but we can get back into our bodies and will be better off. \n\nI appreciate you sharing- I came here feeling very similarly to what you've written (although I'm single and incredibly lonely vs with the partner, the rest is very similar) and reading what you've shared is helping me process where I am in this moment. \n\nThank you.",
                "You used a phrase that - the instant I read it - makes a huge difference and is helpful to me: “...will be better off.” So often those things I am supposed to do to manage depression, like exercise, meditation, self-care, eating and sleeping well... those are the first things I abandon. Sometimes it is not something I am aware of, but other times like this week I feel so defeated and weary that I think it doesn’t matter and it’s not worth it. But what you helped me finally “get” is that if I do those basic wellness behaviors, no matter what else and how bad things may be, I will be better off. Thank you so much for that. I hate the fact that you too are no stranger to depression and feeling alone, I wish I could make that better and take it out of the equation because I know how difficult it is. Thank you for your kindness, and helping me keep going forward and learning; it means a lot to me.",
                "Sorry to hear you are not doing good. I'm not doing to great myself, last year I had a similar issue and it helped by making a Kik group (anonymous chat room), I'm going to make one again this is my username if you want to hook up and join... http://kik.me/minisini123. \n\nI can relate to the horrible elaborate nightmare idea. Maybe it's true...?!!"
            ]
        },
        {
            "tag": 20002,
            "patterns": " I'm sure everyone gets these all the time. But. Maybe someone somewhere cares. I'm sorry. Just feel like I need to get everything out. The past few days I've been having a bad depressive episode. I'm alone. Almost all day. No one really talks to me but I guess I don't make the effort. I just feel like I can't relate to anyone or I open up too quick and doing something wrong. So I don't make friends. But here I am. Up at 1 in the morning crying my eyes out. I don't feel like I belong here anymore. I disappoint everyone. I can't do a single thing right. I tried to make friends and get back into the things that make me happy but I did it wrong. And they all just left. I was just put onto the earth at the wrong time and at the wrong place. I don't deserves to be here anymore. I'm tired. I'm alone. And I'm scared of my own mind. I want to die. I want to not hear my vocies anymore.",
            "responses": [
                "Don't give up you just haven't met the right people yet I'm here if you wanna talk",
                "Firstly, if you think you’re going to hurt yourself, you should go to the hospital. It’ll be scary, but in the long run you’ll be glad you did. \n\nBeyond that, you should look into therapy. If money is an issue, you can find therapists who offer a sliding scale who will offer discounted rates for people who need them. If the first person you try doesn’t click, keep looking. Seriously consider looking into medication. If the idea of it worries you, talk with your therapist about it. Actually, you can make the fact that you are uneasy about meds part of the things you mention while you’re looking for a therapist. If they do make you uneasy, you don’t have to feel like someone’s going to force you to take them. They CAN help, along with therapy (a lot of people forget they’re not a “cure,” they’re meant to help you feel a little more capable of looking at things in therapy, which can be hard), but it can take a while to find the right one for your particular brain chemistry. What works for some people is a mess of side effects for others. \n\nI know that all sounds like a lot. It can help to not look at the big picture for now, and maybe just break it up into smaller bits, like, today I’ll make a list of therapists to try and contact (Psychology Today has a good searchable database of therapists on their site). Just make a list. If you feel up to more, go ahead, but if you don’t, you still are closer than you were before. It might sound stupid, but I swear, it can help. \n\nLastly, depression lies. It tells you those things you’re thinking, and they seem like they must be true because it says them in your voice. But it lies. When it gets that loud, I try to distract myself however I can, like watching some series I’ve seen a million times, anything you can zone out to. It’s like a feedback loop, and anything you can do to sort of switch your brain off and back on can help you get some space between you and that voice. \n\nThere’s an other side to this feeling, and you can get back there."
            ]
        },
        {
            "tag": 20003,
            "patterns": "https://www.reddit.com/r/depression_help/comments/c7rumh/idk/?utm_source=share&amp;utm_medium=ios_app\n\nMy girlfriend came over and I begged her to stay. She ended up calling me a loser/finding her way out. She told me I could chase her if I really wanted her. I don’t know what to do. But I don’t feel like I want to die anymore for some reason. I just feel like she wanted to throw us away no matter what. Not going to go along with the plan.",
            "responses": [
                "Yeah don’t chase her. She sounds like a manipulator and you definitely don’t need that. Wish her well and block her on everything"
            ]
        },
        {
            "tag": 20004,
            "patterns": "I am terrified that I am alive. Everyday I am terrified that I have to stay alive.   Being dead is kind of the perfect solution for avoiding my emotions and what ever mental illness’ I have.   I just think if I stay rude with people again, everyone will leave me alone again. This time for good.   I am gonna move to a foreign country and if I don’t feel better without my family there (after a month or so) then I’ll do it.  I’ll kill myself (I’ll commit suicide). I just wanted to say this to someone, anyone (who wouldn’t look/say that I am crazy).   I don’t know what went wrong in my life, tbh anyone would have had a very comfortable and good life if they had my life. My family has had enough money for everything (until 2 years ago) but then again my dad never says no to me for anything (and yeah I probably am a bad person for  asking so much when I know that I’ll just commit suicide in a few months or a year or two).  My body is kind of shutting down (again) slowly. I have lost my appetite already. I can feel the pain in my body, it’s there, pressing everything down. And when I say my body is shutting down, I mean my depression is taking control of my body again. With depression comes my anxiety and anorexia as a bonus!   I am starting to ignore everyone again. I am being to rude anyone and everyone around me. I am going back to being the bad me, the defeated me.",
            "responses": [
                "First of all thank you for sharing because it takes a lot of bravery!",
                "A REAL person, too. Takes guts/balls to say what they just said (believe me, I’ve been there).",
                "I wish I can give you Gold for this post! \nYou are strong. Life has a lot to offer. I suffer from depression too, hell im on my couch atm alone in the dark wondering if I have to go how’d I do it, how will people react, if god will sin me badly.. idk \nI’m lost, my existence feels like poison for some people. I’m totally out of my mind atm but I have reasons for my depression. Maybe you need companionship, maybe you need to travel the world, maybe you need to do something you thoroughly enjoy and is not stressful and then you’d see purpose to life, I am trying too. But don’t give up.. please don’t have suicidal thoughts and if you must.. please don’t go through with it. \nFind out what drives you and do that no matter what anyone says. This is just a passing hard time In Life. There’s something you want and may not know what it is right now but it’s coming and when it does, you will be soo happy you didn’t end it. ♥️ xoxo"
            ]
        },
        {
            "tag": 20005,
            "patterns": "It's been ten years. Ten long years of anxiety and depression. I've been suffering since around the age of twelve. I'm now in my twenties. Nothing seems to help. I've tried self-help books, meditation, nutritional supplements, prescription drugs, and multiple rounds of therapy. My mental health has taken everything away from me. I dropped out of my dream college. I've lost almost all of my friends. I don't even leave the house from one week to the next sometimes. Everyday is agony. I'm always in physical pain that's probably either psychosomatic or because of my poor diet and fitness. I eat like crap because food is one of the few ways I can still enjoy myself. Insomnia and chronic acid reflux from my bad diet mean I'm always exhausted. None of my hobbies bring my joy anymore. Life is grey and meaningless.\n\nI have no reason to stay alive. It's not even that I want to die, or that I can't handle the pain anymore because I probably can, but being rational just tells me I'm not going to get better. If I'm like this forever, what's the point? Life without happiness is meaningless. Even if I did somehow get better though, it's too late now. I've lost out on so many experiences. I'll never get back my lost youth or the awesome college experience that I see everyone around me having. I took a distance-learning programme at a community college so as to have something, and to still get a degree, but it's not the same. I don't get to meet anyone or to socialise or to go partying or study abroad like everyone else does.\n\nIt's not like I have someone to be strong for either. There's no one I want to stay alive for. I've never dated anyone, never had many meaningful friendships, and I flatout don't care about my family anymore. A large part of this is their fault. I thought leaving college and returning to the family home would mean some support, but it hasn't. I don't know why I expected any different. My father was always, and continues to be, downright negligent. My earliest memory of him is his telling me that my birth was a mistake and that he wished he'd never had children. He's always dismissed my opinions as \"stupid\" or belittled my interests and choice in friends. Worst of all, he acts like a man in a perpetual midlife crisis; he spends money - including my own college funds in the past - recklessly. I grew up fearing homelessness.\n\nThen there's my brother. He's even worse. He's a drug addict whose illegal habits almost got us kicked out of our house. He got a teenage girl pregnant and leaves us to look after the child with no financial support whatsoever. All he does everyday is lie in bed stoned. At least my parents agreed to help, or they didn't kick him out anyway, but I didn't. I didn't ask to be looking after a four-year-old instead of studying the day before my final exam! I didn't ask to be unable to even call the few friends I have left because I can't even get that little time to myself anymore.\n\nMy mother is the last member of our household. She's the one decent person here. However, as I got into my teens, she has increasingly treated me like a personal therapist or a supportive friend and not her son. I hid my anxiety and depression from her for years because I didn't want to load her down with it. When I'm out or just not in the room with her, she texts me everytime she argues with my father or with how my brother is being problematic. I can't escape! Even at night, I'll be awoken by the noise from her arguing with my brother; her crying and him shouting (lying) that he's going to kill himself and it's all our fault because, for example, we refused to babysit his kid whilst he goes out drinking.\n\nI can't hold down a job because of my anxiety. My past experiences with seasonal jobs like Christmas or summer haven't been great. Medication makes me sweat profusely and one former boss said I look like a disgusting pig because of it. I sometimes stammer or tremble because of it too and my former coworkers used to all laugh at me behind my back. They'd infantise me as though I was some shut-in invalid. Without work though, I can never afford to leave my family. But even if I could, where would I go? I don't trust myself to live independently. One of the reasons I left college is because I wasn't eating, wasn't washing or attending class, or even getting out of bed. It was a path to death anyway!\n\nSo what do I do? There's literally no way out of my bad situation, no way to fix my broken mind that's constantly terrified, and no reason or nobody to stick around for. Ending it all right now will be a far less painful experience in the long run.",
            "responses": [
                "Your parents put a roof over your head and are feeding you even though you're in your 20s.  When will you start to take ownership over your life vs blaming others?\n\nYou have no idea how fortunate you are to have your family to depend on.  Some of us have been out on our beginning in our late teens."
            ]
        },
        {
            "tag": 20006,
            "patterns": "I’m finally going to a specialist on Monday, but waiting for so long has just killed me. My depression is at an all time high and I panicked and reached for the gun earlier. My boyfriend took it and hid it and unloaded all of the bullets and I know I’m not going to do anything, but he’s since fallen asleep (he stayed up and talked to me, it’s just really late and he worked outside at his job all day) and idk.....I’m just kind of alone and so sad. I want to talk to him but I know he’s so tired. :( I went into our office and I’m watching Grey’s Anatomy, I’m just......I want to die so bad and I know I can’t do anything about it.",
            "responses": [
                "Call 911\nRight now",
                "I know I’m not going to do anything bad, I’m so afraid to die. If I called 911 I’d get Baker Acted and that’s basically a felony",
                "Depending on the state, you may get involuntarily hospitalized for 72 hours max.  It is just that. A hospital stay so is covered by HIPPA and there is no police or criminal record. \n\nBut aside from that, GO GET HELP IMMEDIATELY!! It is better to voluntarily seek treatment than to be involuntarily hospitalized or worse, successful at your impulse. \n\nSource: I work at a said involuntary hospital and also battle severe depression often, hence why I’m here.",
                "Well I'm glad you won't do anything bad, you probably know more that I that things like this can turn fast so please be watchful of your thoughts and actions.\nI did a bit of reading on the Baker Act and in a very simplified version, the felony aspect is only pertinent if a person is arrested first for committing a crime and then during the arrest process it is  determined that the person needs mental health services."
            ]
        },
        {
            "tag": 20007,
            "patterns": "I am bored of everything. The only thing that makes me feel something are certain soundtracks and some tv shows. I want to know what is outside of the universe and if it is infinite and many other things that humans can never understand. I hate myself and everyone else hates me as well. I am seriously contemplating suicide. I hate that everything that makes me myself is just chemicals in my brain. I am having a really hard time deciding, what do you all think? Please give me honest responsess and not just the standard live because it's the right thing to do bull shit.",
            "responses": []
        },
        {
            "tag": 20008,
            "patterns": "Sometimes I think that maybe I don’t really know what I want. I hate it. I hate how I look at other people and hate them. I hate when they smile, I hate when they laugh I hate how fucking happy everyone else is. I’m being left behind. I know I am, everyone is so far ahead of me and I’m drowning in my own damn mind.\n\n I can’t keep this up. I can’t keep smiling and pretending I’m cool with being the lonely asshole who stays in her room all day. Who only goes outside to go to class or to get some unhealthy shit that she’ll feel bad about ten minutes later. I don’t think I want to die. I just... I want to be free. But maybe freedom is death for me. \n\nI want to hit something. I want to yell and scream but at the same time I just want someone to hug me and tell me that it’s okay and that I matter. But that won’t happen. Not in a way that’s genuine and real, it’s all fucking pretend to make people feel better and act like they actually care for the small lonely bitch who tries too hard to not care at all. \n\nIf I’m alone then maybe it’s better for me to leave anyway, fully embrace it instead of begging for some kind of helping hand. No one would really care if I go. I give them three months tops until I just become a distant name they remember every so often. Everything is so loud but painfully silent at the same time why can’t it stop I want everything to just fucking stop. \n\nI tried to get help last year but they just pretended to care about me to. They read straight off a damn script. Didn’t take long for me to figure out the pattern and say what I needed to get out. I don’t know what to do anymore. I feel like this my final chance to ask for help before I go back into a hole I may not be able to escape from again. I don’t trust anyone and those few that I do hole a level of trust for I don’t want to burden them so I smile and play it off as some edgy joke. I need help but I don’t even know where to start.",
            "responses": [
                "Honestly, I wish I could wave a magic wand and make those feelings go away for you. Trouble is, you’d have to get in a queue as I’d use it on me first!\n\nI barely speak to anyone nowadays simply because every other human I see is just another potential for heartbreak and/or disappointment wrapped up flesh and skin. I’ve watched too many Hollywood films which has made me expect that the “special someone” is just around the corner and they’ll be in the least place you’ll expect it! They’re not. They never were. The best you can hope for is you meet someone who sort of hits most of your wants and needs and you can tolerate the bits you don’t like. I really don’t want to make you feel worse than you are, but honestly, I wish someone told me this a long time ago. Then I wouldn’t have wasted so much time hoping to meet that special someone. \n\nMaybe it’s better if you keep your head down and do thing you want to do. In my case, I started going to the gym (I’m 68 kg now, thank you for asking! 😂), increased my knowledge for work purposes and saved some money to leave me in a better position. I’m not saying it’s completely replaced human relationships for me, but it’s certainly ameliorated the problem. \n\nIn conclusion, I really wish you the best and hope you find some happiness in your life, I really do. All I am saying is don’t be surprised if it doesn’t happen for you.....",
                "I'm sorry for what you're going through. I can relate.\n\nI find relief in pretending that I am the only person on earth. If I was, 99% of my problems would be solved.\n\nFor myself, an introvert from childhood, I find that the more things you can do for yourself, and the less you need other people, the happier you can be.",
                "Try to do a test of heavy metals. If there is something there you can remove it by chelations.",
                "Try to do a test of heavy metals. If there is something there you can remove it by chelations.",
                "You couldn't have explained this any better, I know exactly how you feel. \n\nI'm going through the same thing too, and although I'm still uncertain about many things, something I'm sure you could be reminded of is to be honest with yourself and those around you. \n\nDont pretend to be content, don't fake that smile. I feel like that would complicate things and you'd lose focus on what may lie ahead on your path. \n\nExplore any and everything that might be of interest to you. It's easier said than done, but the more you insert yourself to the world, the right people will come to you. As long as you remember to open up (to an extent you are comfortable with) you'll find the affirmation that'll guide you out from suffocation.",
                "I was in the same place as you last year. However my parents found out about my depression and sought out psychiatric help for me. I was drowning, I was; but somehow by getting professional help and going to therapeutic group lessons I figured out I wasn’t alone in  feeling hopeless about life itself. I would recommend going to a psychologist and getting all the help you can. \n\nI hope you feel better soon. \n\nRemember, loneliness is the opposite from connection.",
                "Honestly, reading this was spooky because of how similar your situation is to mine. So many of the things you mentioned, I know exactly how you feel because I have the exact same problem. Like not wanting to burden anyone with my problems so I smile and say I'm fine. I know, really, I do. \n\nSo if you ever need anything, help, advice or just someone to talk to then feel free to DM me and I promise I'll do my best to respond as soon as possible. I am not able to professional help like an actual psychologist, but I can do my best to offer my friendship and kindness. So like I said, if you need or want anything, feel free to DM me.",
                "Hey I just wanted to say I really understand what you're going through, I've been alone a long time and been in a very dark place for even longer, I'm still alone today but I'm finally starting to find happiness in what I still have. That all being said I just want to tell you that things will get better, even our darkest hours pass eventually.\n\nI also relate to the cookie cutter bullshit a lot of people who say they're willing to help you do, it's so hard to find genuine people and that contributes massively to the loneliness and I get that. But there's also so many good hearted genuine people out there, they exist, even if they're rarer than gold.\n\nIf you ever need to talk you can message me, though I can't guarantee I'll respond quickly since I'm busy often.\n\nDon't give up is my plead to you, I was in just as dark a place as you just a couple months ago and it passed, things can get better I promise. Sorry if I sound like a broken record haha.",
                "Hay you are not alone. I’m going through the same thing but I was lucky enough to have a small amount of friends who are there and listen to my rant all the time but even for them I didn’t go deep into my emotions. For the emotions that I can’t tell my friends I’ve been writing them down in my journal just so I have some of those heavy feeling lifted at least for a bit. And I know it’s not a healthy thing but another thing is j desperately try to distract my mind from going into my depressed episodes by watching something all the time or listening to “upbeat” music not the sad ones and dance along to it. It sorta help me for the times I’m awake. And before I go to bed I make my eyes as tired as possible (it’s not healthy either but) and I would just fall asleep while looking at my phone. This is what I’ve been doing so far to help me look like I’m ok. So this may not be a good advice for long term but I hope it helps you for the short term.",
                "I’m feeling similar at the moment. I just tell myself that I’m here to make an impact on the world not become one with it. I say that to combat my loneliness but that’s really all it is. Truth is, I suffer every single day and go through the motions",
                "I can really relate to these feelings.  I know when I'm in that place, there's not much anyone can really say to get me out of it, but just being around loving people helps me (even though my depressed brain says it won't).  Fully second the advice to explore therapy and a psychiatrist-- both have been game-changers for me.  Until then, be kind to yourself"
            ]
        },
        {
            "tag": 20009,
            "patterns": "I hate myself and I’ve always felt like I was ugly . When I think about my life , all I can remember is screaming , crying, and being mad and angry .\nI don’t have happy memories about anything , everything has been tinged with the shame and guilt or depression, even in childhood .\nI’m 27 now and I’m pretty sure I have cancer. I want to just let it grow. I want to die and I want to feed the cancer with cigarettes and energy drinks . I want to just wait until the cancer is so bad, that I qualify for euthanasia somewhere and can end my life without telling anybody .\nI have no motivation to get better because I hate myself . I hate my father , I hate myself for being like my father , and I do not want to hurt the world anymore by continuing this bloodline of fucked up people . I hate everything and nothing will ever change that .",
            "responses": [
                "Ouch... what if I said I cared?  Your life is so much more precious than you think, please keep fighting. Maybe we can make some happy memories together? I would love to support you in any way I can. Please fo the the doctor to get that cancer thing checked out."
            ]
        },
        {
            "tag": 20010,
            "patterns": "I can’t even bother to write anymore but this is how I feel",
            "responses": [
                "[https://www.youtube.com/watch?v=R5UXi9ptxY0](https://www.youtube.com/watch?v=R5UXi9ptxY0)",
                "I'm sorry. I feel much the same. I feel more ugly UK inside than outside, not saying im attractive or anything but I just lost the few friends I had by lashing out.",
                "If you want you can vent to me. And I doubt you’re ugly or disgusting.",
                "I'm fat and disgusting. Plus I'm highly judgemental about other drivers on the road. I'm doing my best to stick to a cico diet, but I can't excerise yet (per doctor's orders). Let's build each other up! Please pm me and we can compare eating habits and exercise habits! Even pacing around the house counts. It's what I do when I get nervous. I have social anxiety, so I'm mostly home bound. I could use a friend.",
                "I’m so sorry you’re going through this. Know that you are NOT ugly or disgusting. Depression is telling you these lies. I hope that you hold on long enough to see yourself in better light. ❤️"
            ]
        },
        {
            "tag": 20011,
            "patterns": "I feel this way far too often.... I’m 22yo and I want to die almost every day. As time goes on, the thoughts of suicide increased and seem more and more appealing. It started to get scary for me once I realized that the one thing stopping me from actually offing myself (the pain I would cause others around me) didn’t matter to me anymore and that dying would be worth it. Because id be dead and nothing would matter. The only thing stopping me now is the fear of becoming paralyzed or failing the attempt and having to live with that. So I just hope every day I get hit by a car on my way to work or die by some kind of freak accident. I feel so alone all the time even though I have supportive friends/family. While I’m not alone physically, mentally I can’t help but feel worthless and like people hate me. I know the cliche of people telling depressed people that they’re “not a burden” I just feel like that’s untrue. I feel like this issue is consistent enough that having to have someone help me and comfort me when I become this way prevents them from living their best life and it takes away from their happiness. I know that being around me is not easy when I am depressed or having an anxiety attack. I have a really hard time verbalizing my thoughts and feelings because I feel like if I don’t say them out loud then they won’t be as real. It’s something I’ve been working very hard on these last few years but it’s still a work in progress. I know that might sound crazy but it’s just how I rationalize my lack of coping mechanisms I guess. I feel like I can pinpoint all of my issues and I’m pretty self aware. I want to change desperately but for some reason I can never pull myself out of the void once I feel myself sink in. And it’s devastating. It’s hard for the close ones around me trying to help. I can’t let them in no matter how much I want to. I just feel like there’s only so much someone can do before giving up on you. It tears me up inside. I’m worried about my relationship failing because of my inability to fight the depression. We’ve been together nearly 6 years and he is the most amazing and supportive person I’ve ever met. But a person can only take so much for so long. In my opinion anyways. I lay in bed most of the day usually sleeping or watching videos when I’m not working my full-time job + a part-time job to just barely be able to pay my bills. The financial stress of being 22 years old, fully self sufficient, living in a big city is insane. I have a history of disordered eating that I’ve noticed resurface this past year. I eat, on average, maybe 6-8 small meals a week. I know eating helps stabilize mood but my ED makes me actually physically nauseous even just thinking about food. Attempting to eat triggers my gag reflex and I’ve puked on several occasions just trying to satiate myself. I just try to tell myself that these thoughts are temporary and that better times will come and make living worth it. I don’t know if I even believe that but trying to have some optimism helps a little. Ive used marijuana as a crutch to help deal with my ED/depression for years, smoking several times daily. I actually just decided last week that it’s time for a break (hopefully to quit permanently). I feel like it used to help but it has just started to hurt me and I haven’t even enjoyed smoking for a long time I just do it out of habit. I feel like it’s making me stupid. On top of my depression that I also feel makes me stupid. Obviously I know healthy diet, exercise/meditation/breath work help symptoms. But committing and forcing myself to do these things regularly seems nearly impossible for me. I can’t find joy or interest in ANYTHING. Which makes it really hard to distract my mind from my thoughts. Antidepressants/anxiety medications (viibryd) have also helped me in the past but I’m not financially stable enough currently to go see a doctors. And I’m not feeling this way every day, it comes and it goes. But it comes and goes fairly frequently. frequently enough that it gets insanely exhausting having to constantly regulate my thoughts and tell myself to snap out of it. If I repress, things get worse. If I let it out, I spiral out of control. I’m not looking for people to tell me that things get better, I’m hoping someone can offer useful guidance, tips or advice to maybe help me pull myself out of the void when I fall in. I hope someone can relate and find comfort knowing they’re not alone. Deep down I know I’m not alone but all logic gets thrown out the window once the cloud comes over my head.",
            "responses": [
                "Hey, I'm here to talk about it if you want. I don't want you to feel like this.",
                "Mathematically perhaps it would help you feel less alone to know I too, frequently contemplate my own death? I tried and failed to read that Camus book about suicide, the myth of Sisyphus that I've heard long story short he argues that it's the most rational patterns to ask yourself, and the best responses is to smile and amuse yourself as you walk your unbearable burden up the mountain, over and over.\n\nThe real problem, especially when you're talking to someone intelligent (and I get the sense that you won't want to agree with this, but you're clearly very much so, having thought out every aspect of this impasse you're at, and written about it at eloquent length), is that the only actionable advice, that dispenses with aphorisms about it vaguely getting better, is so simple as to be maddening and cliche. Take care of yourself, try to breathe or meditate, or at least go about what you mindfully. Exercise, blah blah blah.... I don't know, a lot of that stuff, once I get over how much more tortured and sad I am than your average guy, a lot of it does really help, but it's really hard to change your habits.\n\nI still decide that I want to live each day. And I fall asleep bewildered, wondering how I can improve, and sometimes it occurs to me I don't feel the weight as often as I used to. Good luck.",
                "I find myself slipping into the void and it feels impossible to pull myself out. It usually happens when im left alone, when I don’t have to go to work and have no plans with my SO. It feels like im cornered and have to face the reality that I haven’t, and probably never amount to much. I really relate to your post about staying in bed all day watching videos when you’re not scheduled for work. I relate to having no motivation or interest in learning anything or trying anything new. I relate to how it comes and goes. When it comes, I feel doomed and like a waste of human life. And when it goes I feel guilty and patterns if i just made up the depression in my head and i’m just being dramatic for attention.. \nI’m 19f I may not have much useful guidance to offer but feel free to message me if you want someone to talk to."
            ]
        },
        {
            "tag": 20012,
            "patterns": "This is a throw away account, obviously.. \n\nI don’t know what to do at this point. I do everything that is supposed to help me get better, such as eating 3 healthy meals a day, exercising, spending time with others, going to therapy, taking antidepressants ect.. yet I still want to end my life. I want to die.. Holding all of these suicidal thoughts in my head every day and hurting so badly feels like it is driving me insane. \n\nI’m so tired.\n\nI don’t want to live. \n\nThe last time I felt this alone was when I had my last suicide attempt.",
            "responses": [
                "My bestfriends wife took her life and his life has been in shambles ever since. What is so bad that makes you feel this way? I'm here if you need to talk I dont want to see anyone go through these feelings.",
                "That’s the worst part, nothing in my life is considered bad.",
                "Is it more of I need to feel alive. So there is a thought of hurting yourself.\nI get the urge to jump out of moving cars just to see what it feels like. I have never done it but there is always this lingering thought.",
                "I know the feeling of helplessness. Theres no real cure that worked for me at first. The antidepressants didnt do shit etc. The only thought which kept me going in very dark times was the memories of better times. (Doesnt really work when you are bipolar or have any other deeply rooted mental illness) I swam in the nostalgic mindpictures of my youth, teenage years. I kept coming back to the first time i fell in love. I tried to encapsulate that emotional atomsphere and tried to open it up when I needed to. All those words maybe dont mean anything to you. But for me the theraphy started being revealing when I knew the goal i wanted to achive. I still havent achived everything I set out to. Please keep going. I promise you, its worth it",
                "Are you part of any support groups or have friends/family to talk to? Confiding in others can really help to unburden yourself and find relief.",
                "I think you should look up a woman named Kelly Brogan.\n\n[https://kellybroganmd.com/](https://kellybroganmd.com/)\n\nShe has spoken on numerous podcasts and she is very enlightening to listen to.  I highly recommend her.",
                "We change with every season of life. The way we feel at one moment - or even a phase in life will not be how we feel later. Hang in there. Life has so much beauty to offer if we allow ourselves to be open to it. Life can and will change for you too. Keep talking to others, even if it is just reddit every time you are feeling this way. You probably bring more joy to the lives around you than you even realize.\n\nJust breathe, exercise, enjoy music, nature and just the state of existing and being a conduit in this crazy, massive universe that gives life meaning. \n\nWish you the best.",
                "I can't and won't speak for anyone elses case, but for me I think two things turned me around:\n\n1. Someone found something in my depressed nature/helpless outlook on life and called it attractive. Like, the burden I carried with me and tried to fight was instead a quality that made someone more fond of (or even hot for) me. To think that what I found so miserable to ring a bell for someone gave me a worth I didn't know I had. That opened the path for me, and every other thing I did wasn't to \"fix me\" anymore but rather to \"assist\" me in being the me I wanted. While still knowing that the mess I was - still made me valuable in ways I couldn't see before.\n\n2. I love games. Cute ones, fun ones, great story ones. And there's new and better games coming out all the time. Fuck me if I'm gonna bereave myself experiences that give me such joy (even if I'll have to tread murky waters to get to the \"next plot of sacred land\"). So yeah, finding that thing worth living for made it less desirable to submit to the eternal rest.",
                "Suicide is never the responses. Just remember that everyone's gonna die one day. This is YOUR videogame. YOU make the rules. If you want to be happy it's gonna take time and be a hard and challenging journey. Take it. Please 💓",
                "Who do you talk to about your thoughts besides your therapist? I agree holding them inside must be painful, so an outlet might be needed.\n\nAlso, what do you like about yourself? I've heard suicide described as a battle between the self hating and self loving parts of us. Do you love you?",
                "Go back to your doctor and read this post to them. They can adjust your dosage or change your medication. Talk to a therapist once or even twice a week, psychiatric professionals can help provide perspective",
                "&gt; nothing in my life is considered bad.\n\nPeople often kill themselves when things are getting better.\n\nThey say, \"This is the best it will ever be,\" since it's a bright spot, and then finally decide to exit life.\n\nThe patterns is what are you comparing yourself against?\n\nWhat is fulfillment to you?\n\nWhat \"makes you\" happy?\n\n/r/Stoicism might be a good place to start.",
                "Here's a sneak peek of /r/Stoicism using the [top posts](https://np.reddit.com/r/Stoicism/top/?sort=top&amp;t=year) of the year!\n\n\\#1: [A great reminder](https://i.redd.it/ozjljovn07d21.jpg) | [80 comments](https://np.reddit.com/r/Stoicism/comments/akp8v1/a_great_reminder/)  \n\\#2: [\"If a person gave away your body to some passerby, you’d be furious. Yet, you hand over your mind to anyone who comes along, so they may abuse you, leaving it disturbed and troubled — have you no shame in that?\" -Epictetus](https://i.redd.it/gkqbswxmi1921.jpg) | [64 comments](https://np.reddit.com/r/Stoicism/comments/adker1/if_a_person_gave_away_your_body_to_some_passerby/)  \n\\#3: [Breathe](https://i.redd.it/pzn2qaabqtl11.jpg) | [75 comments](https://np.reddit.com/r/Stoicism/comments/9f8m5t/breathe/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/afd0dd/blacklist/)",
                "Your life is not a joke , What’s real is real ?",
                "responsesed you in a dm. ❤",
                "Asshole Daddy Dom checking in on you. When I got back from Iraq I didn't know why I felt like blowing my brains out. Turns out I have survivor's guilt. If you need to DM somebody, I'm here. That goes for anyone who reads this. You may be a fucking piece of shit, maybe I am too, but I'm a really good listener.",
                "I know the feeling I feel like that to",
                "Loneliness is the worst feeling to have, to be surrounded by people all around you and yet feel as if you have noone. I feel it almost every day. Are there friends you can reach out to? I´m aware that sometimes we don´t have that type of friends or maybe we feel ashamed to tell them what we are going through. I did not speak to a single person yesterday so as you may imagine the loneliness by the end of the day was pretty overwhelming. I ended up having a couple of drinks and smoking. Right now it´s 3 am were I am and I have only spoken to the uber driver and the grocery store clerk. Oh and it was father´s day and I did not see my family today. It´s intentional I´m trying to stay away from their toxicity. So you are not alone, many of us have to deal with the weight of loneliness on our shoulders. Some of us are pretty good at hiding but it doesn´t mean we are not feeling it. Feel free to contact me and definitely talk to your psych, i mean you´ve already gone through this once and the meds they give you are not working? It sounds like your medication needs to be updated. One more thing, It would really break my heart if you harmed yourself in any way. The world would be a lesser place without you, even if you don´t know it. I care...",
                "Hey Rose, I was on the same boat as you a few years ago. I lost had my basketball scholarship after tearing my ACL and getting in a car wreck, shattering my hand, both within a few months of each other. I couldn't play the same game again. Two years after, I  lost my girlfriend of four years to suicide after she was raped causing a miscarriage of our 4 month-year-old. I can't say I never thought about suicide but I guess I loved myself too much to follow through with it. I'd cut my shoulder until blood dripped from my fingertips because it was easier to hide the mental pain with physical. I can't say there's a magical pill that will make the pain all go away but I do know pain is temporary. It may last for a minute, a day, or even a year but eventually, it will subside. I got up every day went to school, put on a smile and made it one day at a time. It wasn't easy but if I hadn't I wouldn't be where I am today and if I had to go through all the therapy sessions, if I hadn't stripped myself of my medication and healed naturally with the help of my psychologist. I would still be relying on those pills. Gotta take the bull by the horns and get up and show up no matter what even if it's just a baby step as small as making your bed in the morning. At least you can say you did something that day."
            ]
        },
        {
            "tag": 20013,
            "patterns": "I wish I didn’t fall for people so fast and I wish I could just be friends with people without “liking” them. It’s so hard on me and it’s because I’m always alone and I never communicate with anyone so any chance I get where someone takes the time to make me feel loved I fall for them. I hate myself for it and maybe if I wasn’t around I wouldn’t have to feel this way. Always I get turned down, because it’s creepy and then they move on. So I always fall deeper into the rabbit hole of depression the more I talk to them without being able to express my emotions without ruining what we already have. \n\nI’m depressed over everything and this is just another cherry on top stacked amongst other cherries that are making me feel like giving up. I wish I was normal so I didn’t love everyone who takes the time to care about me. I wish I wasn’t around to hurt anyone.",
            "responses": [
                "I have the same problem, going through something similar. I was going on a few dates with a girl I liked but she ended it about a week ago cuz there wasn’t a “spark”. My guess was cuz I’m clingy but distant at the same time, it’s a very weird combo. I’ve just got back on my medication maybe that’ll help me.\n\nTruth is, I realized something. You have to focus on yourself. Not to be mean, but that mentality will cause yourself to jump into a relationship you are not respected in. I’ve fallen for this and wasted many years cuz of it. You have to find happiness from yourself. \n\nNot only that, but girls are more attracted to confident, happy guys. You’ll noticed that girls might seem more interested in you the second you find a happy relationship.\n\nI know it seems like shitty advice but I hope it helps. Don’t set yourself up to be manipulated"
            ]
        },
        {
            "tag": 20014,
            "patterns": "I don’t know what to do anymore and nothing helps me, I want nothing more but to be dead.. \n\nI’ve struggled with depression/anxiety/bipolar disorder since I was 12 years old, I’m 19 years old now and I thought things would brighten up over time but I was so wrong. Since October of 2017 I’ve had it the worst I’ve ever had, I’ve completely forgotten what it feels like to want to live and what it feels like to be happy and what it feels like to want to wake up. I lost my job, I can’t get a license, I’m losing everything close to me, I dropped out of school, and I can’t eat anymore, I’ve completely quit caring for myself. I feel such an empty space in my chest and I feel like such a burden, I’ve attempted suicide more times than I can count since the age of 12. I sadly didn’t end up the way I wanted to. Nothing works.. I have every intention to end my life, I don’t want to be a part of this earth anymore. Even the thought of my loved ones being devastated doesn’t push me away from it. It’s a feeling I can’t even describe.. I can’t do it anymore, I’ve lost all hope for things changing. I’m giving up, I’m tired, and I’m weak. I can’t stand to wake up feeling the same way I feel when I go to sleep. Please help me.. I can’t stop it anymore, I’m going to kill myself..",
            "responses": [
                "Hey , here if you wanna talk"
            ]
        },
        {
            "tag": 20015,
            "patterns": "I’m typing this in the middle of a breakdown right now so bear with me. I want to die so fucking bad. I don’t want to be alive anymore. I hate life and I hate being alive. I used to take comfort in the fact that suicide was always a last resort option for me, but now I can’t. My older died in a car crash a month ago and I’m my parent’s only child left. I’m only 16, a 16 year old shouldn’t be this way. I shouldn’t be such a wreck, I shouldn’t need pills that help me just barely function and get me through life. My sister was my best (and for a while, only) friend, I feel like I can’t live on without her. I have to though, my parents pretty much depend on me and need me. Now the school year is ending, and I have so many things to finish and make up because I was gone for two weeks. The stress of school with everything going on in life is too much. I just want to swallow my entire bottle of pills, or find a nice tall building to jump off of, or just die while I sleep. I don’t want to live anymore. I’ve struggled with anxiety and depression for a while now, but it’s never been quite like this. I still put up a happy front for my friends because I don’t want them to worry about me, although sometimes I crack. They’re supportive and everything, but I still feel empty. I still feel like I have nobody because even though they do their best, they don’t want to deal with me. They’re done with me and I can tell. I’ve never fit with my friend group anyway. I have nobody right now. I don’t like talking to my parents because I don’t want them to worry about me. The person I felt best talking to was my sister. I’m sorry this is so rambly, I’m just completely breaking right now. I can’t believe she’s gone and I don’t want to continue anymore, not with the way things are going. I have such a void inside and no matter how badly I want to fill it, I’ll always be empty. The only reasons I haven’t killed myself yet is because 1. I’m too much of a coward and 2. My parents need me and I feel selfish for wanting to die. I just want the universe to take me though, my life is shit. Complete and utter shit. I’m sorry if this doesn’t belong here, I don’t know where to go. Please give me the will to live, or the courage to die. Please, anything to make this end. Please.",
            "responses": [
                "Time is a great for getting over your sister. You need to grieve, you need to get angry, you need to feel sad but you will get over her. You are so young and you are going to go thru lots  if journeys. But you need to give it time. \nI know how you feel about suicide. I'm alot older then you but I have had a hard miserable life.I also want to commit suicide and have had many attempts\nI understand your pain.  Mental pain consumes the whole body. You have to force  yourself to get  out of bed and move. I'm starting taking baby steps. I take just  little walks only for 5 minutes and sometimes in the 5 minutes I look around at the surroundings and forget for a few minutes\nYou will have good  times again I promise.  My father was my best friend too and he died when I was 16. I wanted to die so badly to get over the pain. But do you want to put your parents thru another  death of a child.\nOne day at a time sweet girl. You will get thru this. Baby steps. Think of the good memories you had with her. I really know you feel paralyzed me to. My friends keep telling me to turn to God . You probobly feel like he did this to your sister like I feel he could have protected me from molestation, a mother who abused me physically and mentally, then a husband that tortured me, and 2 children who hate me\nEverybody  has thier horror  story.  Please go thru the 5 stages of grief Google them\n And please please please just do one day at a time. You have so much time  to still have fun come back into your life. I don't know you but I care bc I know your pain. I am being abused by my son psychologically and I sit in one room and stare at r walls.  I can't socialize either and in excruciating pain\nBut each da I try a little. You also need to be careful. If you unsuccessfully try suicide they will put you in a psychiatric hospital with wackos who scream all night so you can't sleep, and won't let you off the unit to eat in the dining room.  Some places don't have doors in your room or bathroom so you can be watched.  If your parents don't  have good medical insurance they will put you in a state hospital. Sweet beautiful girl you don't want to go in one of them, they are worse  than death. I will be thinking of you and praying for you. I PROMISE YOU THINGS WILL GET BETTER.",
                "One more thing. Don't worry about your  friends right now they are still so young and immature and don't have the skills to help you. You need to tell your parents you need to speak with a trained therapist and there are grieving groups out there where people are going thru the same thing  as you. You can Google groups near your zip code for people are grieving or groups for people who listing love ones your better at this internet stuff than me. Or if you see a trained counselor will know if grief groups.",
                "Thank you🧡 I really appreciate it a lot, sorry to hear about everything you’ve dealt with as well, I hope things are getting better for you.",
                "Every day will be different. Every day you will practice a new way to live, a new way to move forward. \"Time heals all wounds\" is a bunch of shit. Time allows you to practice moving forward the best you can. You may always be tending to this new wound, manifesting in all sorts of different ways throughout your life. That's okay. You'll learn and become better every day. And all those precious moments you have with your sister will never fade. Especially if you jot them down, paint, or maybe even make a comic book. Even if you don't. Your favorites will stay, embedded into your mind forever. Practice makes easier",
                "Thank you❤️"
            ]
        },
        {
            "tag": 20016,
            "patterns": "I'm a 50 year old male with a 10 year old daughter (shared custody with the ex).  I spent most of my life as a high functioning person and was always in the top 10% of the population income wise.  I've had issues (depression, eating disorders) since I was a kid but I was always able to \"handle\" it and stay high functioning.  Then, over 6 months, I lost my job after 25 years and with the end of my paycheque, so ended my marriage.  That was it, I had no strength left to put up my front and I dropped quickly into a deep depression.\n\n&amp;#x200B;\n\nWell 5 years later I'm divorced, still unemployed, completely broke and barely surviving financially, have panic attacks when I try to job search, and have zero confidence left in myself.  I feel like a total and complete failure in every aspect of my life.  I even feel like a horrible father because some days I can barely handle the normal stresses of dealing with a young kid and I give into her too often which is leading her down some bad paths health and habit wise.  Almost all my friends are gone.  My supposed best friend left me not long after she saw me at my absolute worst when I was in the hospital after an aborted suicide attempt.   She decided our 20 year friendship meant nothing because I \"must always have been a secret narcissist\".  When she left, two of my other very close friends went with her since they were closer to her and felt uncomfortable staying my friend given her feelings.  Other friends I wasn't as close with disappeared when I was slow to reply to them during bouts of depression.  They decided I didn't care or wasn't worth it.  Some just didn't know how to deal with me when I was always down and they had known me as the up guy who was always there to support others.  \n\n&amp;#x200B;\n\nI have nothing left.  There is nothing inside of me.  I want to die all the time. I've been though treatment.  3 doctors, 2 hospital visits, multiple drugs, TMS treatments, ECT treatments, day therapy programs, DBT/CBT training, anything they wanted me to try I did.  Nothing.  I move between moderately depressed on the best day to severely depressed on an average day.  What joys I get last only for a few minutes before I go dead inside again.  My latest doctor when I showed some optimism about trying to change said \"its not realistic to expect you will ever be back to near where you once were again\" and that he discouraged me from even trying to find work.  I can't live feeling like I have no purpose but leaching off of society and not even having enough to do the things that are important to me.  No money, no job, no friends, what's left?\n\n&amp;#x200B;\n\nThe only thing that's held me back for the past year is my daughter.  She's 10.  She is all that matters to me.  I don't want to desert her, but I often patterns if I add anything to her life anyway.  And its hard to live for \"every other week\" with someone especially when those weeks can be so hard mentally.  \n\n&amp;#x200B;\n\nI don't know why I'm writing this except to vent.  The truth is I don't think its \"will I kill myself\" but when.",
            "responses": [
                "First off brother suicide hotline tel:1-800-273-8255 . Program it in your phone. Call it on those days you need help.\n\nI believe that all you need in life is God. He is always there for you and will never betray you or foresake you.\n\nI’m not a trained psychologist but to me sounds like you need start over. Replant those seeds of your life, tend to those basic needs to get your mind right again. Just when we think we have it figured out life tends to turn us around. \n\nMy aunt committed suicide and gave her daughter up for adoption without anyone knowing. If I could talk to her today, if she could see how wonderful life is, how much her daughter loves her and what a Joy she is to be around she wouldn’t have done it.\n\nWake up early, like 5 am early . Get your mind right , find something to be grateful for , find another , get your heart rate up. Really challenge yourself in your workout. This is the foundation for Attacking the day\n\nSomething that helped me https://youtu.be/UdhGTvuUOys",
                "Oh take your god talk and shove it.  I was a VERY observant member of my religion for a very long time.  Life has taught me that either god doesn't exist or he doesn't give a shit about individual people.  He most definitely did forsake me if he exists. \n\nAs for your Aunt, maybe her daughter wouldn't have turned out so well if she didn't kill herself and give her daughter a better place to live\n\nNo, killer workouts aren't the responses for me.  My heart doctor has prohibited new and increased exercise while a potentially life threatening heart defect is investigated (although maybe I should listen to you, it could kill me)",
                "I hate giving “advice” that everyone has heard before but i like to walk a lot when I’m having bad days. just forcing myself out of bed and outside seems to help me a lot, maybe it’ll help you (unless you’ve tried it) there’s an app out there where you can get paid to walk dogs, if your into that sort of thing. it’ll help you make some money while getting some sun, walking, and spending time with a cute dog.",
                "You’ve been through a lot and sounds like you’ve tried it all. I admire your perseverance. Not many could go thru all that in a 5 year period. The fact that you could succeed in the past means it’s possible again, so don’t believe that one doctor’s opinion. If you have had the stamina to try all these solutions it means you have it in you to fight for a better life.",
                "well if you have to wake up in the morning telling people to shove religion up their ass then there is a purpose to keep going. You are not alone though. Lots of people are miserable. I spent 25 grand and 5 years trying to get better. I still feel like shit most days.",
                "The depression detaches us from realities. The \"you\" that was your successful self is still there. You have the same brain that achieved all that. \n\nWhat has changed is that your head has slipped into a habit of over-processing and ovsessiving about the negative. We depressive have problems because of the way our heads process stimulus, not because of some crazy dumbing-down \"brain rot\". \n\nThe old part of our brain has a place called the limbic system. The LS is heavily involved in our emotional response. I have never figured out why the LS has such a command of language, but it come up with Automatic Negative Thoughts (ANTs) that we perecieve in the form of our brains being completely hijacked by hearing rentless things such as \"I'm a loser\" \"I am worthless\" \" I'd do the world a favor by just being dead\" yadda, yadda, yadda... That's the work of the LS. \n\nWhat happens in this horrible, soul-killing barrage is that our prefrontal cortex (the logic center, just behind the eyebrows) tries desparately to counter the ANTs. The PFC detects the ANTs and we percieve the ANTs like a voice of authority in our heads. The ANTs are are real as the math your 3rd grade teacher taught- to our psyche. The problem is, that the ANTs are complete fabrication and the PFC goes on a wild goosechase trying to are against them. But the PFC is pussing in the wind. If the ANT says \"I'm a loser\", the PFC gets caught up in a losing argument. There is no defination of \" a loser\". \"Loser\" is a taunt, not a real state of being. You can't make a single, iviversal defination of \"loser\" in the way you could define \"CEO\" or \"dean\". Defining \"loser\" is like defining the exact shape of a water drop. You can't. And neither can your PFC. But it tries. And tries. And tries. \n\nAnd befor you know it, the PFC that you used to run your past life is mainly preoccupied with dealing with the drivel the ANTs throw out. Ya, no, you can't get your old life back without your PFC focusing on the realities of real life- your job and it's complexities, your social life, being a dad. \n\nSO, what do you do about all this confrontaion between the ANTs and the PFC? \n\nStop the ANTs. It's like getting 2 old, bickering married people to quit with that old  roleplay and really get some life lived. \n\nI went through about 7 therapists and 3 Rx's and still had the same depression of 37 years. \n\nI won't tell you what to do, but I will tell you what I did. \n\nI identified that I needed to control the ANTs. They were crippling me, hobbling me, holding me back from living and being productive. (Via many ways).\n\nI felt like I had ZERO control over anything, really- not my in my ability to earn money, my finances, my kids, my household, traffic, nit even in contol of what was goi g on in my own head. \n\nSo, I deduced that creating some control in my life would, at the very least, serve to counter the feeling that nothing else was in my control. \n\nAnd I had little time to myself (overbearing, controling now ex spouse) and no money, of course. \n\nSo I created a little world for myself I called \"the power trip\". I had an old pair of running shoes. I'd go out for a jog alone. And I created an experience of COMPLETE CONTROL. \n\nI'd get out of earshot of the ex and start. I'd say OUT LOUD somthin like \"I am in control of running 3 sreps on the right side of the sidewalk\", and do it immediately.  \"I am in control of taking 2 deep breaths in a row\". \"I am in control of pushing my left sleeve half way up my arm\". \"I am in control of... \" you get the idea. I said it out loud because I that THAT much trouble otherwise escaping the ANTs. But during the full mind and body immersion od a power trip, my head did not have the capacity to speak, act and be creative for the next little control task to acknowledge any ANTs. I made time for my power trip about 5 of 7 days per week. About 20 minutes at a time. If I couldn't jog, I walked. \n\nIt worked. But in ways I never had anticipated. Sure I got a little break form my ANTs+my personal grade A anxiety. \n\nWhat also happens is that my PFC stopped playing it's stupid games with the ANTs. It's like my PFC stopped tolerating them. My PFC called their BS. \n\nAnd then the ANTs stopped. \n\nMy PFC is now free from dealig with the stupid Automatic Negative Thoughts endlessly spring from my Limbic System. I have the freedom to use my PFC as I chose again. Oddly enough, with the computing power of my prefrontal cortex in my control, my life is a millon times better than what it ever was as a depressive. \n\nMaybe my story will help you. Ypu have all my support.",
                "Where do you live? You can start over. You. An pick up the pieces. Would you like to talk? 832 794 1983",
                "I wish there was something I could say to take your pain away, but I admire your strength for continuing life through such painful struggle. I believe immense struggle builds us into better people because we can then relate and empathize with the darkness that exists in this life. Just know that you are not alone and better days will come. I believe there is a reason for everything that happens. What an amazing Dad you are to stick around for your daughter. I truly wish you peace and happiness.",
                "“Do I add anything to her life anyway?” She is your daughter. Your flesh and blood. She relies on you for everything. She looks to you for guidance and responsess and support. For food and shelter. For advice about why her friend decided to stop being her friend that day or maybe she got her heart broken for the first time or maybe she’ll become the next president or have beautiful grand babies. It’s up to you how you look at life but I definitely understand being fooled by my own depression. I know that it veils everything as being worse than it really is. It’s like one of those mirages in the desert in an old Disney cartoon. It takes a lot of strength when you are depressed to remain mindful and to count your blessings, but I know you have it in you. You’ve come this far. I think seeking a therapist on an often consistent basis would really help you, coming from someone who sees a therapist and has suffered from major depression most of my life. Someone you like who works for you, because finding a therapist can be like trying on the right pair of shoes. It can be hard to find the right fit sometimes but if you have patience it can be an amazing investment for your well being.",
                "Your daughter definitely needs you and would not be better without you.",
                "Unless you’re Satan.",
                "You absolutely add value to your daughter’s life. You are all that she has. You are her guidance and shield into the world and well, I’m sure regardless of everything, she loves you because you are her father. This is not me shrugging to your situation, because I know how it can come off from people who don’t know, but I have suffered from depression most of my life, so I get it. Most of the time after a dark episode, I always realize my own mind is what’s making everything so awful. I’m not being mindful and I’ve paused from living in the moment. People such as friends and fam often come across as not caring when really they do, they might just have their own crap going on that they are learning to emotionally handle, and they aren’t being there because they don’t even realize their own selfish behaviors and by default people are just naturally super selfish, not that that that justifies it or anything. But depression is like a huge toxic stain in your mind that blocks your clear view of things. We ourselves can be our own worst enemies. I honestly recommend, maybe when you find a job\nthat you like that offers insurance and benefits, you can find a therapist or even now there are things I’ve heard of that work well like TalkSpace which is therapy on your phone where you kinda like FaceTime or something with a professional, or so that’s what I’ve been told what it’s like. I’m not sure if the price of that, but with whatever you choose I really think if you found the right type of therapist for you, and it has taken me a few therapists to find the right one for myself, but I love her and I know I can always go to her for that type of support and for the guidance and tools they can help lift yourself out of the dark rut you’re in right now. I’ve been where you are, and I promise it really helps but you have to do it on a consistent healthy basis. It’s just baby steps and being patient with yourself, and also being gentle with yourself and rewarding yourself for even making it out of bed when you feel this way. That really is a difficult task when you’re feeling like you don’t want to exist, but not reeeeeally be dead at the same time. You just don’t want to feel the pain anymore. It takes time but you can do it. Some days might be worse than others and for a moment you may feel defeated but just remember there are people who care and who are thinking of you and wishing you the best. Please take care of yourself for your daughter and for yourself especially because life is still worth living and it can be great and that’s still worth hanging on for. Baby steps still count and be nice and patient with yourself. It’s gonna be okay.",
                "I am praying for you today.",
                "Thank you for saying this. You are absolutely right. OP has been burned by *people* in his religion before. But we know Jesus Christ, the true God will never forsake him. But he has to give his life to Jesus. God won't force him to do that. I know you are joining me in praying for him. He's in a lot of pain but I know Jesus can heal him and rescue him from this. He rescued me.",
                "I would shove it but my girlfriend tells me I’m full of it so probably won’t fit.\n\nHer daughter had everything against her growing up . Having a loving mother there for her of absolutely would have helped. \n\nOk workouts are out just get up and move to the extent your doctor limits you to. By chance did you watch the link I sent ?",
                "Be careful about throwing your number onto a public forum.....",
                "A 10 year old doesn't care if you have a job or are \"successful\".\n\nA 10 year old wants you to spend time with her, listen to her likes and dislikes. Watch shows together, go on walks together. Volunteer at an animal shelter together.\n\nYou must learn to redefine \"success\" for your new self, not cling to what your 30 year old self saw as success.\n\nWhen we are 30, we are at the height of our energy, are at our lowest weight, are probably married and making the most money we'll ever make.\n\nWhen we are 50, we've aged out of the field we gave everything to work in. We've put on a lot of weight, our hair has turned white, our face is covered with wrinkles, our skin has changed colors to possibly have spots, we need glasses when we never did before.\n\nYou can lose weight and dye your hair, but you'll never enter the job market at the same place you left. It's time to change careers. Learn to be humble, be content with nothing. Read Siddartha.\n\nThe fear, the desperation, comes from knowing you can't have what you once did.\n\nOur worth isn't from what our income is, it comes from serving others. Helping your daughter and being a rock for her will heal you. Help her with difficult school work. In your daughter, you have a treasure. She is the very thing most people strive for, a legacy. If you can instill in her a love of learning and confidence in herself before hormones and society make her feel worthless in a few years. If you can do that, you've given her more than what most parents are far too busy and tired to do, you have given her a lifelong skill and a reason to live herself, once she is very old and alone. What will happen to her when she is 50 and her marriage is over and you won't be there? How will she know she's still loved and loveable? Would you love her less if she doesn't make as much money as you did when you were 30?",
                "What's an PFC, ANT, LC?",
                "3rd paragraph: Limbic System is \"LS\". Automatic Negative Thought is ANT\n\n4th paragraph: Prefrontal Cortex is PFC",
                "I know you mean well but this irritates the heck out of me and you shouldn't say that to people who you don't know you share a religious view with.  Prayer doesn't help, at all.  You are probably even from a religion who has members that hate on me for my religious background.",
                "I'm in Ontario, Canada.  And I've tried, I really have.  In my stronger days I've applied for jobs and gone for interviews.  I went through the bankruptcy process to clean up my unmanageable debtload.  I've done the medical stuff.  I've even done my best to try and reach out to people.  But in the end I keep falling down. Something in me just isn't strong enough anymore.  Thank you in particular for offering your number.  I just don't know what I'd say to a stranger, although I suppose I'm talking to strangers now",
                "Thank you for your comments and support.  Intellectually I know and agree that stopping the ANTS is necessary and the mindfulness exercises you talk about are good ideas.  I try.  Sometimes I can implement those strategies for days, even a week or two, but when I fall its so hard to get up again.",
                "sometimes I can believe that, sometimes I can't",
                "I’m so sorry you’re going through this. I don’t have any magic treatments or prescriptions to recommend (I’m still trying to figure it all out myself) but I wanted to say one thing: I am 100% certain that your daughter needs you here. She doesn’t need the perfect version of you, but she needs you alive, just trying. Please hold on for her.",
                "Keep at it. Your depression, like mine, was years and years in the making and reinforcing. \n\nThe strategy I took is unique. After about decade of outside help, I asked myself, \"Doing what I am doing, am I getting the results I want to get?\" \n\n(At this point in my life I was barely making money, catering to every whim of an ogre narcissist, and on the verge of failing to pay my bills and rent, and would lose custody of my kids with no residence. My kids were no the ogre's kids. The ogre almost dumped me of at an ER to be commited for a sucidal breakdown once already, but chickened out because he wouldn't get access to my child support money any more.)\n\nThe medicine made me feel jitter and jumpy and caused a racing heart at \"regular doses\", so i was reduced to a bare minimun dose, so I don't think the drug manage my depression much. \n\nTherapy was a place I went to and he or she let me talk. I felt like 95% of the therapy was what I would say to the mirror after reading a self-help article of Better Homes and Gardens. \n\nI have a BA in psychology. I decided to add real beain science to my anti-depression crusade. \n\nI experienced my depression setting up camp in my brain as a 7 year old child, with a fairly simple life of school, a pet hermit crab, and little else. No friends a single toddler sibling , and hand-off, detachment parents. \n\nI remember distinctly the Automatic Negative Thoughts coming from the back/rear of my head. The part of my head the tried in vein to counter the ANTs was the front part, the Prefrontal Cortex, as I much later learned. \n\nThe back and front were at war. Every night, I'd sob in seething pain of hating to be alive and in shame and seering guilt of feeling the way I felt. I hid it from my parents, although it was not hard. \n\nMy mental picture of it all was like that of the \"Last Judgement\" with the horrors of hell at the bottom and the goodness of Jesus and heven up top, like the back/bottom of my head and front/top of my head. \n\nFast forward to my mid 40's and being on the bring of committed to an institution. \n\nI knew from my experience as a child, that the depression had a source in the brain. I looked at brain anatomy and best I can I dentify, it is from the area of the Limbic System and Dorsal Raphe Nucleus. (LS and DRN) \n\nIt was like the LS has a megaphone in my head and the PFC wispered. Or, as if in the war in my head, the LS had rocket laungers and M80's  and the PFC had bb guns. TOTAL IMBALANCE.\n\nSo, as I explained, I sought out to balance the volume of the LS and PFC. \n\nFrom my classes in college, I k ew about neurons, a bit about how they fire in sequence and wire together and how \"muscle memory\" can trigger reflexive firing, luke when we tire our shoes. With repetition, executing the action of tying our shoes does not require the step-by-step thought process.\n\nTurns out, it takes a certain number of hours of specific practice to get a certain chain of neuron to wire together. I. 10 hours, you have a pretty good wiring, and with thousands of hours you are considered a \"professional\" or a \" master\" at something. Well, guess how many hours in our lifetime we have spent \"mastering\" our depression? Especially in relation to hours spent on a specific depression counter-measure. It's numbers. 5, 6, 7 hours is nothing to judge success by when I know my brain has been actively supporting its own depressive habits for THOUSANDS of hours since I was 7 years old. \n\nSo, I took the approach of training like an athlete trains for an upcoming sports season. \n\nSuppose would- be soccer player \"Chris\" gets some shin guards and soccer shoes, reads up a bit on soccer rules, and practices moves 45 minutes per week in the 6 weeks preceding the first game.\n\nSuppose would-be soccer player \"Pat\" gets some shin guards, shoes and learns the rules also, but practices every single day. Time spent learning to dribble the ball up and down the field, defend around oponent, headiing an incoming ball, etc. If \"Pat's\" total minutes of specific practice on repeating a single move of maneuvering the ball around a cone in practice is a total of 15 minutes a day, times 4 days a week time 6 weeks of pre-season, Pat has accumulated 6 hous of specific practice on that maneuver.\n\nWho is going to be more ready to perform as a soccer player at the first game?? \n\n(The analogy is that I am the would-be soccer player and the 1st game is an looming depressive episode.)\n\nWhat I had to to was bring elements of purely OBJECTIVE reality into my anti-depressive crusade. \"X\" number of minutes doing my \"in control\" exercise was one of those objective elements.\n\nNothing from my verious therapists was ever that kind of specific. It was always \"well, how do you feel after.... \" \"how do you feel since...\" \"how are you feeling....\"  Newsflash: reporting a \"feeling\" is completey subjective. \n\nI needed balance in subjective and objective. Not all or nothing, just some of each. \n\nIt turns out, that is the key to overcomi g depression, too. Balance between the volume and authority of the various areas of our brains.",
                "I'm trying.  She is the only reason I'm still here.",
                "I understand. But when someone believes like me, that it does help, then it makes sense that they would want to pray for you. I want to pray for anyone who is hurting, it doesn't matter to me what religion they are or what they believe. But please don't judge me saying I'm from a religion who would hate on you. First, I'm not religious, I just have a relationship with Jesus. Jesus doesn't hate anyone so I don't hate anyone, regardless of your background. Why would someone hate you for that? I am praying for you.",
                "Christianity teaches that I'm going to hell no matter who prays for me.  That alone makes me resistant to Christian prayers.   It's also my strong feeling that prayer is something people do to make themselves feel better, it doesn't help the other person and its often done in place of actually taking actions that could help someone.  For example praying for a homeless person does ZERO to help that person, giving them money for food, or volunteering in a homeless shelter, those are real actions.",
                "I see what you're saying but you are not resistant to prayer just bc you don't believe. Also I agree it's very important to do actual tangible things to help people. I can't speak for others, but I have given my life to the actual work of Jesus. I don't just pray for people. I am involved and help establish programs for youth, feeding the poor, medicine for the sick, educating children, etc. I believe it's important to address physical needs. Jesus did this. He healed the sick and fed the hungry. He was also a teacher. But at the same time im doing these things, I'm praying for people. I've seen my prayers responsesed so many times, I can't stop praying now.",
                "*sigh* What you are doing is rude at this point.  If someone DOESN'T want you to do something for them then don't. You are proving my point you are just doing this for your own selfish reasons and not for me (or anyone else you pray for)",
                "You are a fighter mate, you have survived all this for something big to see. You have no were else to go but up from here. I cannot comprehend with you but I can see that you have been through a lot, beyond pain there is stillness. I would recommend meditation bro. You are a fighter, don't stop fighting. It is your karma and you have done it will the best of your ability. Don't give up man. Stay strong brother",
                "Thanks. I thought t was important enough. Didn’t think about repercussions.",
                "You’d say how you felt. Have you tried the self authoring suite? Have you done the strong inventory to tell you what sort of job you’d be suited for?",
                "You sound like a good dad. ❤️"
            ]
        },
        {
            "tag": 20017,
            "patterns": "I hate my life currently, have no job, no friends really since I stopped drinking a lot, even less friends since I stopped smoking weed. I feel so alone. My closest friend is an ex GF/old friend (dated for a few years on and off towards the end but known her for 10 years) and I still love her, sucks when the only person who can help you through hard times can potentially make them worse. I could definitely call her right now and she’d be there for me but idk. I was falsely accused of sexual assault a few years ago and even though i am proven to be 100% innocent some people still think I did it. Threatening phone calls, people talking shit about me, and sometimes I’m not invited to functions because of this. I don’t really want to die cause I want to believe things will get better and I’ll get happier but these past few nights when I think about dying it makes me feel calm. Like a weight would be lifted off my shoulders.",
            "responses": [
                "Whoa, hold on a minute.... can I celebrate your stopping weed and reducing drinking?  That's accomplishment in itself!\n\nYour brain is adjusting to cleaner living. Alcohol and pot definately affect the neurochemistry in your brain. While your neurons are thanking you for getting some detox time, there are probably some old brain habits still playing out.\n\nYour brain may be in the habit of holding on to negative thoughts for way too long. This habit is not your fault. However, this habit makes regular life and relations difficult to interact with in the way we expect to interact. We see \"others\" with \"normal lives\"- and that's not us. We feel left out of \"normal\" because of our depression. \n\nBut, hang in there. You are in a dynamic time of cleansing and making good decisions to quit the weed and alcohol. It took a long time to get to that point, and it won't magically be \"all fixed quick\". \n\nYou've make a great choice in hanging with community right now.",
                "Hang in there buddy!! You are actually making amazing process towards better life without acknowledging it....And about those allegations you know who you are true to your heart\n\nMight sound Harsh but really ignore those people who actually judge,you are better off without them\nHang in there man...",
                "I think like this at times, I picture I don’t have the guts to really go through but I picture, I ask myself is my life really bad I never had a girlfriend as a male that shit is taunting it literally makes you feel like you’re missing out on a universe that’s been here for so long and gets me hella upset. However I have tough times with myself for caring too much I hope everyone is safe.  I also hope that someday it’ll all change, I really do hope for a better future, and wanted to say that you’re not along we’re here sharing our thoughts through a screen don’t forget behind every comment and like is an actual human being is pretty easy to forget but hey we all share the same pain, pain is universal and we’re all getting through it. Stay strong my internet friend we need you here",
                "I would make your words mine if I could. I agree with everything you said.",
                "Don't give up! You have to take things one step at a time.  You are just adjusting to a major change in your life.  When one of my cousins stopped drinking a lot of his friends disappeared.  He was hurting and felt very alone for awhile.  However, he started getting new hobbies and trying new things and was able to meet some new and wonderful people in his life. He is much better off now and   gained some new prospective in his life.  Focus on your wellbeing right now and find happiness in yourself and your actions. Things will get better with time.  Best of luck!",
                "If you lost \"friends\" because of alcohol and weed, you may want to reconsider what you call \"friend\". Also making new ones ain't hard, keeping them is what's harder",
                "Thanks man, I never really took the time to realize that stopping that is something that I should be pretty happy about.",
                "Yeah I know now they aren’t really my friends, found that out when they stopped talking to me because of that. It’s hard for me to make friends cause I have this image around where I live where people think I’m this giant asshole because of some things I’ve done/said over the course of my life even though I’ve been nice to people for the last year or so.",
                "Yeah it’s just hard to ignore cause I feel like I don’t deserve to be looked at like that. Not fun having people think you did that kind of shit espeacially since those people tell other people.",
                "I tried to quit diet coke just for lent and lasted about 4 hours, so wow, ya. \n\nYes, absolutely it is something to count as accomplishment. And absolutely, take the happy feeling if you WANT to. \"Should\" be happy is putting the judgement of others on your accomplishment as an expected reaction, but \"they\" didn't do the hard work you did, so f \"their\" judgement of your accomplishment. There may not actually be \"they\" in your life, but I am no fan of the concept of \"I 'should' be....\". \n\nJust react the way YOU WANT to react. Be happy, be proud, be smug, be however you WANT to be. \n\nMe, personally, I applaud you!!!! If you want, take a bow."
            ]
        },
        {
            "tag": 20018,
            "patterns": "It goes from happy to sad to depressed then stays there all I feel is sadness all I feel is pain I'm only 13 and don't know what to look forward to in life I'm never happy anymore all I want is a little bit of happiness some hope that I'll find something to look forward to but it never happens I want to die and I swear to fucking God if you say it's just a part of growing up or that everyone feels like this NO THEY DON'T NO ITS NOT I'm different from everyone else having there happy lives yes many are like me depressed and wanting to die but not like I do",
            "responses": [
                "But why do you want to die what is different from everyone else? If you don't mine me asking",
                "Most people are depressed because life isn't how they want it or because of anxiety everyone is depressed because of something different I'm not sad because life isn't how I want it it's that there's no way I do want it and I can look every possible future of mine and see in none of them I'll never be everything I want because I don't know what I do want",
                "And yes I want to die not like full Suicidal but let's say I would be perfectly fine with me getting hit by a truck or dieing in my sleep I hope I never will commit Suicide",
                "Helperdroid and its creator love you, here's some people that can help:\n\r\n\r https://gitlab.com/0xnaka/thehelperdroid/raw/master/helplist.txt\n\r\n\r [source](https://gitlab.com/0xnaka/thehelperdroid/) | [contact](https://www.reddit.com/message/compose/?to=cancerous_176)",
                "People always think they want to die till it almost happens I think you should just work on your self and try to keep going till you find what makes you happy",
                "That's what I'm trying to do"
            ]
        },
        {
            "tag": 20019,
            "patterns": "My dad is depressed and stressed out. I'm pretty sure he's really close to having some serious health problems and his work environment is really stressful. I'm also sure that there is something happening in his family (with his brothers and such). I know what he does to me (for better or worse) is just an outlet for his emotions but growing up, there was a lot of physical abuse. It's not as frequent now (as in there hasn't been a serious incident in about a year) but when I was younger, there were times I'm pretty sure he wanted to kill me out of anger (chocking me and stabbing me with a kitchen knife). \n\n&amp;#x200B;\n\nMy mom grew up in a very sheltered environment and got married with very idealistic expectations. However, my wonderful dad being the amazing person he is, decided to abuse her. I was born a bit less than a year after they got married and I know that my mom sees me as competition for my dad's attention (which honestly, I'm fine without). She was slightly physically abusive when I was younger but now it's just her acting out for all that's happened to her. I don't know what to think about her, she usually took my dad's side when I was younger (probably in an attempt to diffuse his anger) but she also stood in his way.  \n\n&amp;#x200B;\n\nNow for my brother. When I was younger (around 6th grade, my brother was 6), my parents used to leave him with me for a couple of hours (while they got home from work). I tried my best to take care of him but I did at times resort to yelling and being slightly physical (slightly dragging/ shaking the chair he was sitting in around) at him, especially when he wouldn't eat (I didn't want my parents to think I didn't take good care of him). I have learned from all that and have much better techniques for dealing with children and my brother respects what I say and will listen (mostly). Anyway, my parents are a lot different with him than they are with me. They're a lot milder in their actions and do spend a lot of time with him (in a pleasant way and no, nothing sexual either). I still do think they are lacking as parents though and have tried to make up for them in certain avenues (mostly in terms of helping him with relationships with others). My only problem is that there are certain times I start attacking him verbally. I hate that my parents place his opinion higher than my own especially because it's about my life and I hate that he plays along. I know its not his fault and that he's just unconsciously doing what my parents do but I cannot seem to control myself. I hate it when my dad joins in and usually ends up telling me to kill myself/ they'd be better off with me dead. At this point, my mom usually comes in and makes a joke out of it. I know it's her way of diffusing the situation but I still hate when she does that. This usually leads to me attacking her verbally (and I just have to know everything that could possibly make her upset) and she ends up yelling at me and telling me she hates me and stuff. And this is usually with my dad either laughing or saying I'll end up dead. \n\n&amp;#x200B;\n\nAnyway, I'm not sure what to do anymore. I feel like I'm going insane. There are certain times my parents are nice. They buy me things and we can have civil conversations and even laugh together (which usually end with me doing something wrong and them yelling at me). I really don't know how to feel about them either. 95% of times I would say they hate me but the other 5%, I can say they at least tolerate me. And then there's the entire thing with teenagers hating their parents, I'm 17 so I'm not even sure if my feelings are just because of my age (there is a part of me that says it has nothing to do with my age but I'm not sure if its right, or that I even want to listen to it). I'm not even sure if everything that's happened to me is truly abnormal either. I mean, I do look online, I have done my research on child abuse but at the end of the day, it's all theoretical. There's a part of me that knows this is wrong but there's a larger part who has no clue (and my parents' gaslighting doesn't help) and I'm left trying to figure out what in the world is wrong with me. \n\n&amp;#x200B;\n\nI just feel like I cannot do this anymore, I'm drowning and there isn't much I can use to hold on. Every time my parents yell at me, I feel like dying. I really want to leave everything behind. And it wouldn't be that hard either. I'm pretty sure my parents would be fine with it (they've told me that a plethora of times already) and even if they aren't, I cannot say I care. In terms of my friends, I'm going to college soon and I can assure you none of us are close enough to even try keeping in contact (so I doubt they'll even know). And my brother, I'm not sure about him, he's the only one I really worry about but I'm sure I can get around that (probably just make him hate me or something). And it's not that I want to die, I can even assure you that I won't do anything drastic to myself (it doesn't make sense, I'm going off to college in a couple off months and I barely need to deal with them again) it just feels easier at times. \n\n&amp;#x200B;\n\nI'm just not sure what to do. I don't even think I ever seriously considered myself at this point (like I'm pretty sure I would be dead by now). I'm not even sure how psychologically messed up I am and I'm sure I have depression and PTSD. The worst part is, I'm not even sure if I'm just taking things too seriously and overreacting. \n\n&amp;#x200B;\n\nAnyway, thanks for reading, I'm sorry this was so long. I would usually edit this but I don't think I'd be able to post it if I re-read it so sorry for any errors in grammar/ spelling/ etc. Also, this is my first post on reddit and I want to apologize if I did/ said anything wrong.  Once again, thanks for reading :)",
            "responses": [
                "hey mystic,\n\nI think you're relatively ok and you will be completely ok as soon as you leave for college. Given that, it's up to you to decide if you're overreacting.\n\nMy advice would be: Minimize friction. Keep things typical if need be. Leave any thoughts of hate etc, obviously your parents have done lots of things wrong but don't let thoughts of hatred either towards you from your parents, or the other way around, have any negative impact on you and hold you back. Just hang on till you leave for college. Also don't erase your old friends as a self-fulfilling prophecy but at the same time try to meet as many people as possible in college, it will only do you good. Try to lead a healthy life, physically and emotionally (minimize contact with toxic people) and academically.\n\nRegarding depression and ptsd: since your life is going to be better in a little while I'd say avoid to put any labels, there's no use to it for the time being. Leave it at that for now and you can re-evaluate later. \n\nHow does that sound? If you have any patternss let me know.",
                "Thank you"
            ]
        },
        {
            "tag": 20020,
            "patterns": "Lately I've been feeling really down.\n\nI've been dealing with depression for years, and last year since my family moved from an abusive stepdad I started to work on self improvement, things are a lot better than they were a year ago, and while I'm learning to be more present, the last 3 months have been really overwhelming.\n\nI was doing so well, a guy decided to go after me and then leave me for his ex, even when he knew how much it hurt me and what it meant, he decided to keep quiet, now I have to live with that situation, and know that I wasn't good enough for him, or for anyone, everything after that just felt weird, since just before that happened everything was going so well, I went on a trip and I had so much fun and I discovered so much about myself, it felt amazing and at the moment it felt like maybe he was the next step, just keep moving and trying to become a better person.\n\nI didn't realise it affected me so much, not until very recently, I was trying to keep a positive mindset, and kept going out with friends and try new things, but when I had the chance I got high or drunk, alone. I didn't think it was a big deal, I thought that was just part of college.\n\nLast semester I skipped classes constantly, and I thought this semester I was better since this time I was early most of the time, but looking now, things haven't changed much, I've just been replacing it with other unhealthy habits.\n\nSometimes I wonder if I can really do something to change my life, I can't sleep, I have so many panic attacks and I don't really know if what I am is enough. Sometimes I want to die and be born again just to start over and have a chance to live.\n\nI don't ask for happiness, I just want to be present, I just want to feel over control over my own self, and have a normal view of the world, not this distorted, anxious view of the world, where I'm scared all the time, where I patterns myself all the time, where I'm ashamed of who I am, of who I try to be.\n\nMy family tells me that what I feel isn't real, that it will pass, that I have no right to feel this way because I don't know real pain, even when I explained what happened to me, even when I felt gross telling them what has been going on with me the past 15 years, they don't believe me, or they don't see how much it hurt me, and instead tell me I should love them more because I'm cold and ungrateful. I can't! I wish I could! And I wish I could love myself, I didn't ask for it.\n\nMaybe this is a long rant but I need help, I'm afraid I won't live long enough to see good things happening to me, or to live long enough to see I don't deserve them.",
            "responses": [
                "What country are you in?"
            ]
        },
        {
            "tag": 20021,
            "patterns": "I really don’t know how to keep going.. I feel worthless and I’m miserable I had a couple months of sobriety, I’m a heroin addict, but when my girlfriend who is the love of my life asked for space because she needs to work on herself I relapsed she tells me that she still loves me and still wants to be with me but I feel so abandoned, like in the hardest time of my life she’s just going to leave? How could she love me if she won’t be there for me when I need her support the most? I just want to die I don’t want to feel this pain anymore. I’m sitting here with heroin and a syringe about to do a shot that I know will kill me. I don’t know if I have the courage to do it.. everyone’s life would just be so much easier if I wasn’t in it. No one would actually miss me. No one would fucking care. I live a pointless life. I’m worthless. Unlovable",
            "responses": []
        },
        {
            "tag": 20022,
            "patterns": "So, I keep running into issues where I tell my boyfriend I really need to talk, but he'd rather play video games than listen. He runs to other peoples sides, though, when they are going through a rough spot, I finally asked him why he'll drop everything to talk to his depressed friends but won't for me. He simply said, \"Well, they are depressed, and you're not.\" First, observation is how the hell do you conclude that not having depression means I don't need someone to be there anyway. But secondly, I realized he really doesn't know... I didn't think I was hiding it so well... We've been together for about 1.5 years, and I'm a cutter only 7 months clean, which means he's been around them and he's seen them.  But he really doesn't know that just 6 months ago I finally attempted to kill myself, it was a first for me, the lowest I've been in my life. I was so alone then, no one to confide in, so worthless, so hopeless, so strongly believing it can't get better, and might as well end it now.  I have so many days where I have to fight with myself not to cut, try to convince myself it's not worth it.  Tonight it's so low again, and I want to cut to die... but he still tells me I'm not depressive... How do I tell him?.. How do I tell him without him not believing me bcuz I hid it so well?... How do I sit alone tonight with no one to talk to and not decide to die?...",
            "responses": [
                "You should find someone to talk to, a therapist or even someone here on Reddit. Your boyfriend obviously doesn't get it and probably won't, don't expect much support from him.\n\nI've been alone most of my life so I'd say hang in there, it gets easier. Distractions help. So does excersise.",
                "I'm sorry that really sucks. My last boyfriend was just as oblivious. I think you should talk to him about it cuz some people just need stuff pointed out for them, but then if he continues to invalidate you, you should drop him cuz then he's just going to continue to be detrimental to your health."
            ]
        },
        {
            "tag": 20023,
            "patterns": "I’ve been getting worse these past few months because of the new ‘job’ I’ve got (i work with my mum at her shop, but my life is just babysitting &amp; I don’t get paid properly) . Every morning when I get woke up I think about killing myself because getting out of bed is jus so hard for me now &amp; the thought of having a productive day &amp; socialising just kills me. I have no motivation to do anything I just cba anymore. I can’t talk to anyone because no one gives a shit and I don’t want to burden my family by telling them I want to die.. if anything, people say I’m faking depression cus I’m always posting suicidal memes (on my priv Sc story) but that’s just a cry for help cus I can’t just start a conversation with someone like ‘hey Im fucked up &amp; wanna die’ So I can only really talk about it when people ask but they never do and when they do i just push them away and say I’m fine.  I go to sleep every night fantasising about how I’m gonna kill myself  but I can’t do it yet cus of my family.  This post probably makes no sense I’m just rambling.  Really neeed someone to talk to about all this lmao I’m going crazy. Alsooo, I’m self medicating with weed and alcohol (literally every day).",
            "responses": [
                "Try making an appointment with your local GP.\nSometimes talking to a stranger is easier than speaking to people who know you.",
                "I will one day, just too scared of my family finding out.",
                "If you are of legal age, there's confidentiality regulations which state they cannot disclose information unless they feel you are in danger (harm to yourself or others)  if that's the case then you'd be informed before they disclose anything to your parents.",
                "I’m 17 so I don’t think that’s the legal age &amp; in the uk. &amp; if I tell them how I actually feel they’d definitely think I’m in danger to myself tbf"
            ]
        },
        {
            "tag": 20024,
            "patterns": "I'm basically a piece of shit",
            "responses": [
                "Says who?",
                "don’t think that, mental problems can lead to such blockades",
                "I can't help it I really hate myself",
                "This course about mental health really helped me personally\n\nI hope it helps you too!!\n\n&amp;#x200B;\n\n[https://human-happens.teachable.com/?affcode=327618\\_ytqi\\_guo](https://human-happens.teachable.com/?affcode=327618_ytqi_guo)",
                "Then try to picture yourself as being someone you can like and actively try to work towards becoming that person."
            ]
        },
        {
            "tag": 20025,
            "patterns": "I’m scared, I’m looking for responsess anywhere and I fear it’s left me in an extremely vulnerable state. Tonight I couldn’t sleep, I begged my SO to help me, I just needed some comfort. He refused, he’s bipolar and when I get like this he blames me for feeling south and it only makes it worse, but somehow I know this feeling is not because of him. \n\nI recently got a job I really like, but my self esteem is low and I find myself complaining often. I don’t know if it is because I cannot take the pressure or if it’s just a pattern in my life in that I do not deal with stress well. \n\nAnyway, as of late, I feel powerless. My one friend keeps sending me messages about how I don’t care. I do care, only I’ve been very busy with work so I cannot reflect on what she’s saying the same way I used to be able too. Maybe I am just overworked?\n\nLately, I feel like I want to die, I know I should seek mental health but I don’t have the resources or strength in self to seek guidance. My family life is lacking and I am worried I am too vulnerable to find a good therapist.\n\nWhat are my options? How can I begin to understand what is making me feel this way? Or better yet, what are some of the steps I can take to help myself?",
            "responses": [
                "Hello! \n\nMost of people here have the same feeling as you. When you are overwhelmed, stressed and you don’t know how to get better the first thought is related to death. \nStay away from these thoughts because you are going to get better, I'll be here if you need it. \n\nIt’s great you have a job you really like, it could be something uplifting. Don’t underestimate yourself, appreciate your job and your effort. Anyways, you can complain about it, all of us do it too.\nAnd don’t be afraid to go to a therapist, they are used to all kind of problems, you aren’t worth less than others.\n\nFirst of all, try to know yourself better. If you have low self-esteem you only see your worst qualities. Try to make a list (mentally or as an responses here) about your 5 greater defects and your 5 greater virtues. How could you improve these defects? \n\nHow is your relationship with your SO and your friend? What do you expect from them? Do you get what you expect? What about them?\n\nIs your family situation affecting you more than you think?\n\nTry to analyze all about your current situation, then you can try to responses your own patternss.\n\nAs I said, feel free to talk to me or anyone else here.",
                "Talk to me too! I may not be the best at advices but i will listen and i will be there when you need comfort or just to share happy moments whichever :)",
                "If you are not ready for a therapy yet, I suggest reading some of Freud's work. \n\nKnowing about the self, mental health and the work of a psychoanalyst may help you understand better what's happening and encourage you to seek the help that you need. \n\nAnother thing for when you are overwhelmed, mindfulness meditation. If you don't like meditation because is boring and difficult as hell, there are a few exercises that you can do. \n\n\nhttps://positivepsychologyprogram.com/mindfulness-exercises-techniques-activities/\n\n\nAnd the classic \"can I do something right now to deal with the situation that is killing me? No? So I will only think about it when it's the appropriate time. Worrying won't help me solve it.\"",
                "Like most things with depression finding the motivation to go out and get what you need is a mother f***ing struggle to say the least.  \nIt's great you have a good job and be proud of that 😊.\nIt took me months to finally go to the psychologist and it wasn't easy sometimes you need some to literally push you into it.  If you can ask a person to help you there it can help immensely. Maybe a new work colleague or someone positive in your life.  \nI hope you manage to get the help you need 😊 and take small steps to realizing your worth. \nAnd keep going with your job so happy you've found a place you enjoy working.  Good for you 🙌",
                "Thank you very much!"
            ]
        },
        {
            "tag": 20026,
            "patterns": "I’ve had suicidal feelings since a very young age. I live in chronic pain and I’ve lost the will to live, but I’m still capable of going through the motions of acting like I want to live. Every year around my birthday I become even more obsessed with suicide, I start to get my finances in order and try to pay of as much debt as I can, so I’m not a burden to anyone in death. Today is my birthday and I want to die more that ever, it’s not a birthday to me it’s a year marker of enduring pain. I primarily want to know that I’m not alone with this feeling?\n\n\nRant:  This year both my parents be have suddenly became disabled. My dad fell 30 feet and broke many of his bones and has brain damage. During his recovery he would call me often to get me to talk him out of suicide. My mom has a painful nerve lesion disease that has left her mostly paralyzed. It’s been hard to watch my mom slowly wither, but I have faith that she’ll get better. My brother married a meth addict and has 4 kids who all have different dads. I got engaged this year and I feel an impending pressure to be perfect for my future husband and also immense guilt, odds are I’ll end up like my mom or I’ll kill myself before the pain gets worse. Wedding planning has been stressful too. \n\nThanks for reading!",
            "responses": [
                "I’m so sorry. I can’t specifically responses your patterns, though I do think birthdays can be challenging and confusing for people who battle depression.  Wow, being engaged is an awesome big deal. I’d suggest a gratitude practice.  Wanting what you have (the stress of planning a wedding, for example) has been something that is helpful to me.",
                "Also, I hope you’ve explored therapy and ketamine infusions for chronic depression."
            ]
        },
        {
            "tag": 20027,
            "patterns": "Growing up I always thought depression was just being sad\n\nToday I woke up and just realised I have been depressed for years I wake up every morning wishing I was dead \n\nI even kinda know how I want to die rough plan is get a rope go to the middle of a forest burn and throw away my phone and wallet and hang myself I don't think it would be to pain full I have been choked unconsion it actually felt nice \n\nI think I will be losing the house I grew up in a few weeks at the very most and it feels like it may just be it then I lost everything \n\nI changed my phone number a few weeks ago not 1 person knows because nobody calls me and I don't call nobody I literally have no friends and no family \n\nEvery Tuesday at around 12am my heart rate goes over 230bpm even if I'm sitting doing nothing I have not gone to the doctors about it in the hopes it kills me somehow \n\nNow I just think what's the point I might as well find out what happens next if there is a God or nothingness I mean if there is a God fuck him guess I'm going to hell to suffer some more if nothingness I'm to dead to know better \n\nI will be going to work in 3 hours I will put a smile on act happy yet there will be a voice in my head repeating kill yourself\n\nI'm to broke to go to a therapist \nIt's a throw away account",
            "responses": []
        },
        {
            "tag": 20028,
            "patterns": "Okey so I have been bullied my whole live until now. I know nothing new but because of I have been scared of people. Mostly trusting them. I don't know to explain this but I got this thought I want to die I'm good for nothing all the time. I hate my past I really hate my old homelife,my old school, how scared I am all the time I would be beaten up. Being told to die,being told to kill myself to harm myself. I'm writing in tears. I don't know if I should kill myself or life this feeling. I don't know what to do. You may think I'm maybe overdoing it but I'm trully scared of what I will do without talking to someone. I'm sorry.",
            "responses": [
                "Where are you from friend?",
                "Actually you're making a pretty smart decision turning to the internet, you're right its always nice to talk to someone. And I was never really bullied but I was always an outcast since I moved around a lot. I can't really say that I relate to your pain, but I can say I know what its like to ahem no one to talk to, now I have a small handful of people that I'm proud to call friends but before senior year of high school I was all alone, and actually when I was alone, a lot of people in my hometown would deem me as weird and dumb, and what kept me going and still does to this day, is that label, cause one day ill be a big deal to the world, and anyone who ever labeled me otherwise will be proven wrong, and if I (just your average college kid) can do it, you can as well",
                "Thank you for your kind words.",
                "The Netherlands. Why?"
            ]
        },
        {
            "tag": 20029,
            "patterns": "Obviously, much Apologies if this kind of political-ish content isn’t allowed. \n\nOkay so I don’t typically even go on subs like this bc in my experience its usually either pointless platitudes or a circlejerk of how awful and hopeless life is. But I’m impulse-posting (aways a good idea, amiright?) because, well, you saw the title. I’m young, gonna be around for a while yet unfortunately (no matter how much I want to die i never go through with it) the world is falling apart around me, the environment is fucked, my country (usa) is fucked and I don’t know any other languages but English which kind of ruins my flee-the-sinking-ship idea. Best case scenario, I sell my soul to a shit job in order to pay the bills until the stress finally takes me out hopefully mercifully. I have no goals, no aims, nothing I want to achieve, I’m just hanging around. My psychiatrist wants me to try and find meaning in my life, but how can I? Human society is fucked from the base up. If I try to change things, it makes no difference. If I don’t, I’m the cause of the problem. I type this sitting on my fat ass using a phone probably made by child labor- how can I enjoy things ethically in this world I’ve inherited? I can barely afford my own rent, much less “vote with my dollars”. \n\nWhatever. That came out way more stream-of-consciousness than I intended, but I don’t feel like editing. Might delete this later. Probably.",
            "responses": [
                "With English, you go anywhere. I work to IT industry and we have people from Europe here. Some acquaintances are living on Europe, some down under, there are some people living in India.  In the beginning we work a lot with low salaries, but with study, in some years you can go anyplace.\n\nI’m preparing a farm, where I will continue on IT remotely while seeing birds through my window, my personal paradise.\n\nI understand your hopeless, and sometimes you just need to look outside.",
                "Have you tried r/CollapseSupport?"
            ]
        },
        {
            "tag": 20030,
            "patterns": "I can’t cope. Exams in a couple of weeks, parents I barely see and want to divorce, depression and anxiety. Alcohol is what I turn to but it has little impact if any. I need help. I want to die. This is a plea to anyone, help me",
            "responses": [
                "Don't let yourself think you are the reason for their divorce. You got exams coming up and you should focus on that for when you do see them you can proudly say you kicked ass on them. Stay focused and look ahead of what you can make your future be.",
                "It’s so difficult. I have so little support and I’m a lost cause by now",
                "It will always be difficult but you need to be stronger, it's not something that will happen over night but little by little you can get yourself out of the slump. Hell if I can do it I know everyone else in this world can."
            ]
        },
        {
            "tag": 20031,
            "patterns": "Backstory: I had a suicide attempt about a month ago, was sent to a mental health ward for a week, started taking bupropion, worked for a while and now I feel like I’m getting depressed again. \n \nSince I left the hospital, I started setting goals for myself and achieving them. I’ve been exercising almost everyday since I got out and I’ve been going out on dates with friends and yet I still feel like shit.  \n\nI don’t want to be depressed. I want to live despite the suicidal urges again. I don’t know what else to do, I’m falling apart. I don’t want to die regardless of want my mind keeps suggesting. Therefore I’m making this post. Please help, I feel like I want to die.",
            "responses": []
        },
        {
            "tag": 20032,
            "patterns": "\nMy best friend and I have known each other for 3 yrs. We met in jail and after we got out of treatments we met up went to meetings and talked all the time. Well after a yr of sobriety we relapsed for a little bit. He ended up going back to treatment and I kept using. He got out blocked me for 8 months then talked to me again and around that time i was doing heroin and meth all the time i overdosed lost 4 good friends and the other friends i had all grew up got married or had kids my best friend has 2 kids and is married as well.\n\nWell 2yrs ago I started suboxone was still using on n off then the start of this yr i really started to sober up and only take my meds. He helped me get into the best psychiatric doc in our area and I've seen her for about 4 months now and tried a couple meds.\n\nMy best friend has always been the one who tries to keep me going and sometimes I get angry because he always mentioned religion along with his words of wisdom. Over the last 4 months or so I've really hit rock bottom.\n\nI told him about how every bday since ive gotten out of jail ive stayed at home and cried alone and he offered to do something with me that day. Then went on vacation the whole week of my bday and I watched his dog. \n\nMy attitude towards him keeps going downhill because ever since I met him he always says well do this or that. Everytime I ask him to do something hes busy with his kids and wife. He doesnt work stays at home with the kids all day and she makes candy for a living. I know she doesnt like me and that probably factors in to his decisions.\n\nIdk the last 4 weeks I've been really depressed and told him about me figuring out how and were I'd hangmy self. He always says something that'll keep me going and say that we will do things and I snapped I said cuz I want to die now cuz i have no will to live or go on now you wanna do things what's different now then the past 3 yrs you were less busy when I first met you and only had one kid now your always busy and claim again well do things friends do? \n\nWell yesterday was his day and he was home with only his son and I offered to rent some movies and hang out celebrate his birthday because his wife is with there daughter at the hospital cuz she has a lung infection well he basically changed the subject and didnt reply for hrs so I freaked out on him and said you always say were going to do this or that but in the last 3 yrs we havent done anything except use drugs for a month together and you broke my car left the next day to treatment blocked mentor how long and offer to do something on my birthday and then go on vacation and I offer to see you on your birthday and you blankly decline.\n\n\nIdk lately I just want to say things to him that will hurt him because hes hurt me for so long and the things he did when to me when we used. Well I guess I'm asking is there any point in keeping a friend like this around even if it is the only person I talk to? \n\nI know me always talking about how I want to die and have no faith or joy in anything and being negative has probably weakened our friendship bit the more n more I think about it I feel like if he really cared like he says he'd make time to have a cup of coffee with me at least once a week. Hes mentioned coffee before and I agree and then something always happens. \n\nFuck i just want to make him cry and point out everything shitty hes ever done his life. Kinda like the time when we used and he begged me to bring him to meet this chick where when we hot there I got put in one room while they fucked next door and he got high and I ended up leaving him there throwing his clothes in the trash and telling his wife where he was.",
            "responses": []
        },
        {
            "tag": 20033,
            "patterns": "I know I'm not the only one.. There a times when I'm alone and usually something will trigger it, sometimes my own thoughts take me there, but its like the world is collapsing in on itself and imploding at the same time. Its like all the thoughts and feelings just bubble over and spill out into the world. There is a heaviness in my chest and it hurts so bad. I cry uncontrollably and I more often then not end up hurting myself. I recently ended up in the hospital because it. Unfortunately, I only got a traumatic experience and no responsess to this thing I carry around every where. It's always sudden and its horrible and lasts for hours or even all day, sometimes longer(the big sad sad). Is there a name for this? or what do you call it? I call it \"a moment\" or an \"episode\" if its longer. Usually surrounding these times are days or weeks filled with a bleak outlook and more sad thoughts but I'm calm on the outside. I describe it as feeling like I'm on the edge of a cliff and it feels like an unending raging storm of dark thoughts. It's not that I want to die or kill myself, I just want to not exist anymore. Care to tell me about your moments? I just feel so alone and I've never really tried explaining it. \n\n&amp;#x200B;\n\n\\*I am in the process of getting mental health and cognitive testing as well as help, dw.",
            "responses": [
                "I’m sorry for the trouble you’re having! I’m not sure what it’s called . Negative thoughts are self feeding. If we don’t take control and change our state it just gets worse and worse . I practice this every morning by getting up super early (like 5am) when the world is quiet . Gets me some extra peace . Work out get heart rate up and focus on three things you’re grateful for , truly grateful for. Then when you feel yourself spiraling you go back to your thoughts of gratefulness.",
                "that actually sounds like a good idea, I love sun rises and walks.",
                "I call it the emotion burrito",
                "Are you being facetious? If not, then why? I'm curious, lol.",
                "Its the way i describe it to my therapist. The metaphor really works for me too, though my experiences with mental breakdowns may be different than yours. But for me it starts with a bunch of different things (probably starting with an insecuirty or overthinkin) piling into my brain, like a burrito's toppings (i can't believe i said that, i'm trash, absolute garbage, not worthy, remember that one time I _____). Then i'm crying uncontrollably and i'm in a fetal position in my bed, similar to that of a burrito. \n\nHopefully that makes sense. I did not mean to sound facetious or patronizing initially lol, sorry if i did. \n\nI'm sorry you're going through a similar situation. I know how it feels, and i'm here if you need someone to listen",
                "It did come that way a little but I read it wrong and I'm super used to Facebook, so my bad. I just signed up and I'm quickly learning people of Reddit are much nicer, lol. \n\nAnd yeah, thats exactly how it is with me minus the fetal position. It usually turns self harm or I get so wasted I pee on things I shouldn't :/ Sometimes I end up with the shower just crying until the water won't stay warm. At least that's how it WAS, I've recently decided to try and not do the thing. I started noticing that I would try and reach out to someone before I spiraled too low and every single time, they didn't responses or couldn't help me. But they kept asking me about these moments when I was admitted to the hospital and I didn't know how else to describe them. They kept insinuating they were suicide attempts or trying to lead me into saying it was. At least it felt that way. I was hoping there was a word for it or something so they'd understand.",
                "Well I don't I have a name \nBut I keep saying  that my mask is slipping",
                "I’m waking up tomorrow at 5:30am ready to do this together?",
                "I'll be doing it an hour later when my husbands gets up but yes, lets do this!",
                ":)",
                ":) Due to my newly prescribed quetiapine I didn't even hear my husband getting up and getting ready. (This s t u   \nf f, I'm normally a very light sleeper) He didn't know. I sleep until a bit ago but I still went on a walk when I got up.",
                "Good start! 😊 I use one of those light alarms to wake up. Hard to keep sleeping with a super bright light on. Those meds can make you super sleepy.",
                "My husband said he tried to wake me up because he had a patterns but I was dead to the world.",
                "Happens sometimes! Tomorrow get to try again :)"
            ]
        },
        {
            "tag": 20034,
            "patterns": "I'm 17 and a full-time chef I live in England so I'm on minimum wage (I don't know if other countries have it) I'm the only person in kitchen staff on minimum wage and as a result of this I get the most hours (I've been here for 1 month) I was diagnosed depressed about 2 years ago back when I was at school and cutting myself I haven't done that in over a year and I feel like I will again \nThe hours I work are insane I don't see my friends or my family I get home at about midnight and even though I work kitchen staff I don't get to eat any of the food and because when I get home my younger sister is asleep I'm not allowed to cook anything because noise/smell \nI also hate my job it's stressful the hours are a lot the pay is £4.35 per hour and it takes a toll on me physically and mentally it's bad as for the last few shifts I've spent the entire thing rewriting a suicide note in my head it's to the point that suicide and cutting myself is all I think about and I haven't been like this in so long \nI don't take any medication other than strong painkillers for my back as I have a family history of back pain and I have got it bad \nA lot of my job is remembering how something is done and literally repeating. \nThe menu has a total of 40 items of which I've probably done maybe 15 and when something pops up I haven't done sends stress across my body \nI'm writing this tonight because I just finished a shift and it was a bad one a coworker asked me multiple times if I'm ok because I was very quiet and slow in movement but I in my head started thinking about my younger sister and parents reactions if I did kill myself and it made me cry not a lot just a few tears my coworker asked me what's wrong but I just said I don't know that's weird \nEven though I'm 17 the bartender's serve me alcohol and right now at 10:17pm I sit here with a pint of alcohol and genuinely considering going home in a few hours drunk and taking all of my painkillers and just going to sleep I don't know if that would kill me but I don't know I just don't know what to do anymore \nI can't even quit this job because I have to give my parents rent and honestly there is nothing I want to do obviously I'll work and make money and stuff I'm not out for handouts I mean I just don't care anymore there is nothing I actually want to do \nI can honestly truly say I want to die and have felt this way for a while but everytime I feel like I will actually do it I just picture my younger sister she means a lot to me and I can't do that to her she is like my best friend despite being 7 \nI don't know what I'll achieve by this post maybe advice or something I'm just writing it",
            "responses": [
                "Quit the job. I'm not sure what it's like in your country, but here minimum wage jobs aren't terribly difficult to get, especially if you already have work experience. If this job is causing you so much pain, quit. Move on. Your parents will understand. They would rather have an alive, temporarily unemployed kid than one who worked themselves to death. Please don't do this to yourself.\n\nMy favorite thing I did in high school was walking dogs for old retired people while they were on vacation. I wasn't exactly raking it in but old people pay well and I got to hang with dogs all the time. \n\nThere's no point in putting this much energy into something that's hurting you so much."
            ]
        },
        {
            "tag": 20035,
            "patterns": "I am currently sitting in my car in my driveway drunk. I am a father of a 4 month old girl I've tried to kill myself before she was born being a medical miracle I survived. Since then I've been trying to recover. I am currently dating a new girl she knows I don't get along with the child's mother in the slightest and I just had a hour long conversation with my baby's mother on the phone about co parenting and what to do. She is extremely mad at me and I can promise she will be moving out in the next few days. I want to die again and I need help please.",
            "responses": [
                "pick up the phone. they will help more than anyone on reddit.\n\n1-800-273-8255\nNational Suicide Prevention Lifeline. (US)",
                "Hi friend, I don't envy your position. That's so much to deal with. I think it's really awesome that you have been trying to recover and making the effort. That's more than a lot of people can say.  \n\nI have precious little life experience, so this might not help at all, but I can tell you that I have no idea who I would be if my dad weren't around. Stick around and watch your little girl grow up. Memorize the sound of her laugh and the way her feet slap against the floor when she first learns to walk. Buy her cute pajamas and help her with her homework. Intimidate all her boyfriends.  You've made so much effort to stay these past 4 months, you owe it to yourself to stick around. This squishy slobbery little thing is your legacy.\n\nYou're not an awful person. People say irrational things when they are angry, don't take them personally. Focus on the people who bring positive things into your life. And please, please stay alive.",
                "STOP DRINKING ALCOHOL!! It’s a depressant, you lose the logical part of your brain. I would guess you were drunk when you attempted last too. It might sound like a good idea to mask the pain but if you can’t control your environment it’s a dangerous game to play. Sober you can control that by not getting drunk in the first place. This is your life, this is the situation you are in. Im sorry it’s not what makes you happy. You’d leave a little girl behind without a father. If you don’t wanna live, live for that. She should not be a victim of your situation. Manipulate the way you think about suicide as now NOT an option. If it’s not an option, the options you do have now are to be depressed anyways and expend all your emotional energy on how hard life is, or come to terms with the fact that being sad about your situation even if it’s fully reasonable to be upset about your situation doesn’t benefit anybody involved, least of all you. I know it isn’t that simple, but really it is. Whole heartedly make the decision to be here and make the best of what you have because that’s the ONLY sustainable option you have. I’m the new girlfriend of a dude with a crazy baby mom and a lil kiddo, and he’s shown me that it doesn’t matter whether you have the right to be upset or not, it only matters how you handle it. Your choice."
            ]
        },
        {
            "tag": 20036,
            "patterns": "I want to die. I cant stop crying I feel so alone",
            "responses": [
                "I've been there I know how you feel. I can tell you that only you yourself can get out of this mindset. Know the way you feel can go away. You need to will yourself and force yourself to do something. I know when I was feeling this way I felt like I was stuck to the floor. I couldn't move. Everything was too much for me both mentally and physically. There's comes a point though where you have to force yourself to change this. If you stay where you are it will continue. You need to set yourself micro goals and build on them slowly. Set yourself small goals to achieve and force yourself to do them, do not let yourself not do them under any circumstances. I know this will be hard but it will become easier. \n\nI started with breathing exercises then 10 min workouts, cleaning, going for a walk.\n\nSorry if you feel this doesn't apply to you but I remember 2 yrs ago I was probably right where you are. Laying glued to the floor crying uncontrollably, full of loneliness and despair."
            ]
        },
        {
            "tag": 20037,
            "patterns": "I wish I was never born , just want to die I hate my life I'm just irritated being depressed I want to die",
            "responses": [
                "Aw, sorry to hear that mate.\n\nIs there any particular event in your life that made you feel this way?",
                "Life is completely messed up with betrayals , depressions, failures  , left alone just being irritated because im lost im afraid to move out of my room can't face this world",
                "The world is crazy and scary but you can't let it beat you, bro you can do it",
                "*hugs*",
                "I hope you hang in there. I've asked God to lill me more times than I can count but I'm glad he hadn't yet. Please look into getting help, you deserve iy"
            ]
        },
        {
            "tag": 20038,
            "patterns": "Hi I am depressed because I feel like I am a failure and I am just killing time every day I am a 11 year old kid I say it’s ok you can just kill your self when you grow up then I think then every thing they have done for me is a waste so I want to kill my self now and as I rite this I am crying  and I want to die",
            "responses": [
                "If you are close with your parents, then I’d advise speaking with them (if you haven’t already) about what you are feeling. Things can seem worse when you are younger and feel a little powerless or uncertain about life. Getting help early could allow for things to get much better moving into adulthood. Therapy now could mean you can have a good chance at contentment in life going forward. I never use the word ‘happiness’ as it’s a fleeting thing. Happiness comes and goes relative to what we are experiencing in the moment. What people are really striving for is actually contentment, whether they realise it or not.\n\nSpeak with someone you trust, or  perhaps a doctor directly, if you feel uncertain about telling a parent. Things can get better. Being young can be really tough, but a lot of the time, adulthood brings confidence and determination, hobbies, relationships, goals, etc that can bring a level of contentment and makes life worthwhile. As I say, getting the right help now gives you a good chance at a contented life.",
                "I am 11 as well and am depressed to u can vent to me if u like i might understand",
                "I felt like this at your age. For me, these feelings never went away until I began getting help. But for the longest time, nobody took me seriously. \nI’m deeply sorry that you feel this way, because I know how hard it is when they tell you life will just magically get better.\nPlease don’t end your life. I know it feels like you’re wasting it, but there is literally so little you can do as an 11 year old. There’s a world waiting out there for you in the next few years. People you’ve ever met, sights you haven’t seen, things you haven’t gotten to do. I definitely know just saying that doesn’t help, but I hope you can keep that in mind when you think about suicide. \nIf these thoughts get even more intense, don’t do what I did and hold back on your parents. Be vocal. Tell them exactly what you’re feeling. They should take care of you. You’re worth it.",
                "Hey I’m a 12 year old and I know what it’s like. I’ve been depressed most of my short life and all I can suggest just listen to certain types of music that give a vibe of some type. The ones I listen too are Neffex, and things of the such. That’s all I can do to help.",
                "Omg thank you I learned that people other than my parents care about me thank you bro/sis",
                "Yea so the thing is I am just scared to talk about this to my parents",
                "But thank you for your help I will try my best for you",
                "Vent you?? Can you clarify what you said (I know I sound like a idiot )",
                "I am scared to talk to my parents about this"
            ]
        },
        {
            "tag": 20039,
            "patterns": "I understand just how pointless it can be to post this kind of thing on the internet but honestly I Just have no real desire to talk in person about this so hooray anonymity. \n\n&amp;#x200B;\n\nI am a senior in high school and I'm just done.\n\n&amp;#x200B;\n\nI have had moderate clinical depression since 1st grade, asperger's my whole life, undiagnosed ADD until recently, imposter syndrome, painful constant stomach cramps, IBS, and anxiety to form what I like to call a fine fruit salad of problems. Recently 4 years of work and dedication in a competitive event I've participated in for all of high school ended up going down the drain. It really hurt but what hurt worse was that 1. I came in literally 1 ranking away from success in three different ways, and 2. all my friends succeeded. \n\n&amp;#x200B;\n\nI feel bad because my friends are all talking about it and I just hide and cry while they do. I resent them for their success yet know I shouldn't. I also am arguably the least liked member of the friend group so that's just peachy. For 4 years this has all been my priority and now it's over. I don't have anything anymore.\n\n&amp;#x200B;\n\nI want to say, I'm not fully suicidal, it's not that I want to die, it's that I don't want to be alive. I really just wish I could simply freeze the world and remove myself from it, and then have the world just continue on. \n\n&amp;#x200B;\n\nI'm bad at actual school while everyone around me gets great grades, I'm going to college and my roomate is getting thousands to go to the school whereas I can't get a single scholarship. I have no motivation anymore while my friends get extra credit for how good they are in class.\n\n&amp;#x200B;\n\nI don't have any extra-curriculars left, I, again, annoy my friends, I'm not good at anything, I hate my job so much I've legitimately considered wrecking my car so I don't have to go in for my shift but I can't quit because I need money and have been denied every other job I've applied for. I know it's stereotypical to say I've got nothing but I legitimately have nothing, there's nothing in my life that motivates me or makes me want to live. \n\n&amp;#x200B;\n\nFailing the way I did in the one thing in life I had just broke me, it's been nearly 1-3 weeks (depending on how you count it, it's complicated) and I have not recovered, I've just gotten worse. I sit in class and can only picture that failure, I try to do my homework and there's just no point. \n\n&amp;#x200B;\n\nThe last thing I want is the \"take a deep breath\" advice, it just doesn't work for me, my depression is and always has been constant, it never goes away, it's with me constantly, anti-depressants haven't worked. \n\n&amp;#x200B;\n\nI really don't know what I'm looking for because I don't know if anything can help. I just don't care anymore, the only reason I didn't kill myself earlier this week when I was next to a bridge was because I just really want to see how game of thrones ends, so that's a thing I guess.\n\n&amp;#x200B;\n\nIdk, do what you can, or don't? This wasn't written very well so I guess I'll just see what advice I get.",
            "responses": [
                "I’ve been struggling with similar feelings for a long time. Something that really resonated with me is that you don’t know when or how things will get better, but ending your life guarantees it never will get better. I don’t know what’s in store for me or anyone but I want the opportunity to find out. It’s hard to verbalize these feelings to friends and family but I thinks it’s worth it. You are so young and there is so much more you will experience and enjoy."
            ]
        },
        {
            "tag": 20040,
            "patterns": "I cant tell my friends or family I cant tell them that I want to die right now, and how awfully I'm crying, that would be too much \"craving attention\". I dont wanna see like I want attention. I just want support, I got a little better but now I'm back to crying rivers. I dont have the motivation for anything. I just want leave everything. I'm so afraid to be so weak and annoying it hurts.",
            "responses": [
                "You’re not a burden for going through depression, that’s just what your mind is telling you and it’s part of the sickness. Taking the time to write this is a good first step. If you don’t want friends or family to know you don’t have to tell them, but you do have to get help. It’s never going to get better if you don’t get help. What you should do is call your insurance first thing in the morning and ask about coverage for mental health help. They will be able to steer you in the right direction for what is covered, who you can go to, etc.  Some insurance requires you first get a recommendation from your doctor, so don’t be alarmed if you have to go through that extra step. The important thing to remember is that you can do this! It’s not easy, but it’s worth it."
            ]
        },
        {
            "tag": 20041,
            "patterns": "I feel like my husband and daughter would be better off without me. I barely do anything around the house. I feel I can easily be replaced by daycare and a maid, who would do a better job than I'm doing.\n\nWhen I talk to my husband about my depression, he gets stressed and usually blames it on my being on the phone (or other screens) too much. Which I definitely, definitely am. Hours too much.\n\nIf I tell a professional, I don't want to be put away in a hospital for a week or something like that. My husband would need to stay home from work to watch our daughter.\n\nI'm not good enough, I know that. How can I change it. (I know I'm addicted to my phone pretty much. And advice on that would be appreciated as well, as long as it's not \"just don't use it\".)",
            "responses": [
                "Hello. I am in the same boat with over-using technology. For me, it's to avoid sinking into deeper, darker places that I don't want to go back to. I don't know if it's the same for you, but if it is, maybe you could explain that to your husband. It sucks being unable to properly explain what's going on to people you care about or feel like you are adding stress to them, but the people that care about you usually want to understand and help, even if they don't know how to. I actually usually feel worse thinking about that, but it does give reason to stick around. \nIf it is avoidance that leads to overusing your phone, try mixing that with being productive. Put on an audiobook and start the dishes or run a load of laundry. Sometimes accomplishing one small thing helps.\nI don't know too much about professional help, sorry. I hope this helped at least a bit.",
                "I could've wrote this, it seems we're in the same boat. I decided to finally reach out to an outside source, because it feels like no one in my circle wants to deal with me. I went to psychologytoday.com and found a therapist in my area that stood out to me and we talked on the phone today... I have to say, it hasn't felt so good to talk and cry to someone in a long time. I'm hopeful for the actual sessions. Maybe this is something you could look into? \nI wish you luck, it's a dark place."
            ]
        },
        {
            "tag": 20042,
            "patterns": "Been on 10mg of lexipro for a while. It’s clearly not doing it for me anymore. Feel hopeless and that I want to die. Thinking of upping to 20mg. I’ve gained a lot of weight lately. Wondering if lexipro dosage has anything to do with weight. Ie should I be on more amount of meds bc body mass is much larger now. \n\nAlso would love to hear from anyone who has tried ketamine or believes they’ve gotten tolerant of their meds over time.",
            "responses": [
                "Been upping my meds every two years since 2012. Now I’m at the point where it’s too much, and I’m having a few too many side effects. Had ketamine at the hospital when I broke my back. Don’t know how to go about getting it right now. Going to visit a new private psych clinic and see what’s up with some different types of meds."
            ]
        },
        {
            "tag": 20043,
            "patterns": "I have constant, confusing emotions, but I don’t know what to call them.\n\nI hate the word depression, for some reason. When it’s used to address my feelings by my therapist, I find myself cringing — because I don’t feel that it’s depression, but at the same time it does. I’m not in any way suicidal, even if I get those “I want to die” feelings. I’m a fourteen year old girl, no surprise there, but I also hate just blaming it on “hormones” and shrugging it away.\n\nI’m told to find people I can talk to, but I don’t really have anyone. I can’t dump it on my friends, my parents aren’t much help, and everything that’s suggested I block with logic. Even to my therapist I will say, “I don’t know that it can be helped.”\n\nIt’s a constant feeling of nothing sometimes, like I want to be sad but I’m not. I still find joy in things, but the feeling doesn’t go away fully. Sometimes it gets worse — sometimes I get internal emotional breakdowns. One day I was so desperate to go home that I fully wanted to walk in front of a car, and probably would’ve if I wasn’t stuck in school.\n\nMy social life is fine, I have friends and I’m not near unpopular. (I’m neutral.) I am new this year, and I skipped a grade, but I’m so used to being new that it doesn’t ruffle me anymore. I love talking to people, I’m a total extrovert, and I get lonely easily. And yet, it persists.\n\nSometimes it’s a feeling like I’m made of lead, like I have a desperation for something, but what?  I can’t say. I want to die, but I don’t actually want to by any means. I’ll be miserable, and what makes it so much worse is putting on a brave face. Homework and small tasks feel like a mighty challenge, and I often feel like I can’t take things.\n\nI will get not-yet overwhelming desire to cut myself, and once I even played with it, but our kitchen knives were too dull to break skin. It’s not like I’m crying over how dramatic things are, I don’t have a tough life, I’m *happy* — and yet, I’m not.\n\nIf my mind isn’t engaged for even a few seconds, the feeling will worsen. I need to be really thinking and talking to dull it, even if it still lingers. I have misophonia, intolerance of sound, and certain sounds like my mom’s repetitive mucusy asthma cough enrages me and makes me (in that moment) fully want to die. I also have auditory hallucinations, although all this comes with perfect pitch. Could this be hearing related? I don’t know.\n\nIt’s just a constant confusing feeling that I don’t know what to do with. I’ve worked through a lot of anxiety and self-hate with my therapist — I used to be borderline suicidal in sixth grade — so it’s not like I’m hating myself and wanting to die. It’s like now that that hole of expression has been filled, the feeling just sits there. I can’t really talk to anyone, my parents are useless and I can’t dump these feelings on my friends. (Besides, all I ever get are people trying to solve my problems or saying “haha same”.) My therapist has pointed out that, even though I feel like I can’t take things, I do them. And yes, I do, but I’m not sure I can keep doing this for three years. I’ll reiterate, there’s nothing wrong in my school life. I get terrible paranoia about other people, but deep down I know I’m fine.\n\nI’m sorry about my rambling. Does anyone else get this? I feel suicidal but don’t want to die. (Apparently that’s a thing, I read an article when I doubted my feelings were real.) I really can’t describe that constant feeling, but it’s like I can’t emotionally handle anything. No one is really any help. Is this depression, or am I just... I don’t know.",
            "responses": [
                "Please ensure you have selected a flair for your post. Flairless posts do not receive as much attention as flaired posts do; we may remove posts without flairs.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/depression_help) if you have any patternss or concerns.*"
            ]
        },
        {
            "tag": 20044,
            "patterns": "I need help.   I need help.   I need help.   I have tried and tried to figure out chatrooms for depression and it is miserable I want to die",
            "responses": [
                "Please ensure you have selected a flair for your post. Flairless posts do not receive as much attention as flaired posts do; we may remove posts without flairs.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/depression_help) if you have any patternss or concerns.*",
                "Please don’t do it! I was close to doing it recently and realized I needed help.\n\nNational Suicide Hotline: 1-800-273-8255\nCrisis Text Line: 741741",
                "What??? What happened??????"
            ]
        },
        {
            "tag": 20045,
            "patterns": " \n\nI don't know what to start to honestly. \n\nI'm a dropout and I'm turning 19 this year and I got severe depression + anxiety and I can’t stop thinking about killing myself. \n\nMy family is tearing me apart and they don’t realise it or they won’t accept that they’re the cause of me feeling this way.  \n\nMy family is one of those families where they think they are never wrong and always target me for everything that goes wrong when I completely had nothing to do with it. The same family that told me when I was 16 with suicidal thoughts, that I shouldn’t complain because other people had it worse than me. I’m constantly being picked on for the way I look and how I act and they’re constantly yelling at each other each day which fucks with my anxiety. I can’t even make eye contact with them before they think I’m giving them the dirty look and will start an argument. Just last week, my mom bluntly said that my cousins are doing so well in school and asked what happened to me to become a dropout and stay in my room all day. And I told my mom so many fucking times I want to die and this family is horrible but she won’t listen to me or she thinks it’s just a silly phase. \n\nI haven’t showered in months because my family convinced me I was too fat (which was true, I gained like 30 kgs from all the stress eating) but it had such a negative impact on me, I couldn’t stand to see my myself naked and I’ve lost about 10 kgs from starving myself. I pull out my own hair and chew on my fingers and take joy from the pain, I keep having nightmares each night that fucks me up like that one nightmare where my family roasted my cat in the oven and it felt so fucking real that I stayed up for days after that. \n\nMy whole family knows I want to kill myself. But they don’t care or they keep triggering it and they laugh at my face for being weak. \n\nI’m struggling to get a job because my anxiety fucks me up in the interviews, I got no money, I can't move out, I can’t escape from my family. I’m trapped.  ",
            "responses": [
                "Please ensure you have selected a flair for your post. Flairless posts do not receive as much attention as flaired posts do; we may remove posts without flairs.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/depression_help) if you have any patternss or concerns.*"
            ]
        },
        {
            "tag": 20046,
            "patterns": "Ok edgy title I know but I’m desperate. I have i good life I’m not living in poverty or being abused. At most a little neglected but I’m mean my parents have to work. Anyway I suffer( if that’s the right word ) from depression and anxiety ( probably more but those are the only ones I’ve been fully diagnosed with ) I’m twelve year old and in the seventh grade, so basically middle school musical. In sixth grade I tried to kill myself by drinking nail polish remover and also for a little period of time I had an eating disorder. I have a lot of fucking counselors and I take medication i I’m taking 30 ml of Prozac right now.Anyway I hate myself I want to fucking die. I have all of these weird patternss that no one will responses and When I try to talk to someone about my feelings they always give me some weird pep talk far from what I was trying to get at or giving me so fortune cookie shit. I understand that a lot of people have it worse then me and I’m just bitching and some adult is reading this and is all like “haha fucking faggot that’s just puberty” or some shit like that and yea it might be be the fact is that Im,,,sad and i don’t know why I feel this way I’m just a kid. There so much that I want to add because there are so many layers but I’m just derailing, any way, for now I just need some advice and some where to vent, where people will just call me a faggot and not try and tell me how “important your life is “ or some shit but for now here’s the main plot short and sweet. i basically have really shitty grades and I don’t want to get held back ( if they even do that in seventh I’m not sure I’m fucking stupid ) teacher have basically given up on me and i’ve slipped through the cracks so like What should I do? how do I get better?  And bonus patterns, if any has any advice on what I should and should not do as I proceed to get older and if there’s anything that I can do to feel better. I could probably use something like that right about now. Thank you.\n\n\n\n\n\n(Also I’m so sorry for the bad grammar As i said I’m really stupid, also this my first time using reddit so I just fucked this up completely I’m so sorry )",
            "responses": [
                "Please ensure you have selected a flair for your post. Flairless posts do not receive as much attention as flaired posts do; we may remove posts without flairs.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/depression_help) if you have any patternss or concerns.*",
                "You’re not stupid. How you feel is not puberty related. I hope it goes when you leave puberty but it may not. My partner was diagnosed age 8. I’ve been suffering with Depression since about 9 myself, my point is puberty does tend to kick start depression.\n\nThe decision with all depression episodes is always the same: is there anything worth living for? Ask friends and family, even if the reason your living today is to not hurt them. \n\nOnce you’ve decided to live, the next step is to decide not to live like this. That means talking to your drs honestly and openly. I’d recommend talking about the thing you don’t want to talk about the most. \n\nI also recommend journalling. What are your problems and what are possible solutions then get rid of the quick and easy ones ASAP. Don’t be afraid to destroy relationships and bonds etc. You need a fresh foundation to build from the ground up.\n\nAlso I’m assuming you’ve been on Prozac for a while, go back and tell them it’s not working. If it’s not been that long then wait it out.  ",
                "Hey. 30 years ago I was you. It's wasn't easy. And it doesn't go away. You will always have your disorders, sometimes you will be in control, and sometimes not, but these feelings are you, they aren't going anywhere.\n\nSo we cope. Meds don't solve anything, but they help clear the fog in our heads a bit. We have to learn to cope and exist with all the happy platitudes and expectations of people who don't actually give a shit. You have to give a shit for yourself. You are the only person who you need to prove anything to.\n\nSo, cope. \n\nFind support you trust. People that will not judge or patterns you. This might be a friend, an adult, or a professional. Maybe a redditor. Identify to yourself, what does a healthy, supportive relationship feel like? Got that feeling? Good. Do NOT accept any relationship that doesn't feel that way. You don't have the energy for anyone that doesn't bring you up.\n\nIf your meds don't help don't take them. Doctors are stupid weak humans just like you and I and they have no clue what works and doesn't because every human body is different. They just throw pills at us and hope we get a good mix going. DO tell your doctor the truth about how your meds are going. Hate your meds? Tell him. Not taking them? Tell him. Want something more or different? Tell him. \n\nThis is temporary. We don't live in the past, and we can't see the future. We have now and that's it. Stay in now. Don't leave to visit the mistakes in the past, and don't invent terrible futures to have anxiety about.  These are the lies our mind tells us to trap us in our pain.\n\nWrite. Doesn't matter if your grammer sucks. Write about your feelings, dreams, fears, about you. The act of writing these out allows you to better understand what you are thinking.\n\nHere is a simple exercise that I have recently learned, it is from a book called battle of the mind. The three C's.\n\nCatch: recognize your trigger responses and bad thoughts. \n\nCheck: patterns and challenge these thoughts. Are they fact or feeling? What is the evidence for it? What is the evidence against it? Are you leaving something out or exaggerating another?\n\nChange: what can you do or think instead of this? Try it.\n\nAnother good exercise is to write down your trigger responses you can remember. Then write down what would calm you, make you feel safe during those responses. This gives you more awareness of what to avoid in life.\n\nPlease don't die. The whole world might hate you but I want you to stay. I'm no one special but one person is enough to stay one more day right? See you later space cowboy.\n\n",
                "Thank you, that means a lot to me.",
                "It’s ok, as for the grades. I was a serious nerd in school and it didn’t make me happy at all,\n\nStuff the grades put your happiness first , if you have to repeat a grade then change schools. You’ll get through but remember you can’t learn unless you’re happy and safe.\n\nTake care",
                "Thank you, so much "
            ]
        },
        {
            "tag": 20047,
            "patterns": "So I had a happy childhood had good grades and a bunch of friends too I was happy and without a care in the world but then fifth grade came it was in math and I wanted to doodle some my little pony characters my teacher we will call her Mrs.Bitch came up to me and told me to go to the front of the room and proceeds to yell in my face in front of the entire class and she would do every time I would draw it got so bad that I scream into my pillow say \"I WANT TO DIE!\"my parents found out but they did not care that much this year it was getting better but then it got so much worse when I came out as pansexual my parents don't exactly like that fact so it got so much worse the only one I feel like I can trust is my best friend they also have depression so what should I do to make the fucked up mess somehow better?",
            "responses": [
                "Please ensure you have selected a flair for your post. Flairless posts do not receive as much attention as flaired posts do; we may remove posts without flairs.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/depression_help) if you have any patternss or concerns.*"
            ]
        },
        {
            "tag": 20048,
            "patterns": "Yesterday I broke up with my girlfriend of over a year because I didn't want her to find my dead body I want to die but I don't want to kill myself ",
            "responses": [
                "Please ensure you have selected a flair for your post. Flairless posts do not receive as much attention as flaired posts do; we may remove posts without flairs.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/depression_help) if you have any patternss or concerns.*",
                "So why bake up maybe she could help u with what ever is going on",
                "Everyday my desire to die grows I can see the pain it's putting her through and I love her to much to see her in pain",
                "Everyday my desire to die grows I can see the pain it's putting her through and I love her to much to see her in pain",
                "I don't thinks u do if you did you would use that love to fight this and get help or do what ever it took to get better",
                "I understand what you're saying and trust completely that you love her. But I promise you she will always want to be there for you even if you push her away. It will be just as hard for her and she will be in more pain if you don't allow her to go through the things you are \"putting her through.\" You're important and she definitely cares about you and has to understand to some degree if she has been with you for over a year.",
                "If you truly love her you wouldnt do this to her, pls you know you love her, talk with her, ask for help. Don't let it all in you, give up controlling, let it be, observe your feelings as they are you.\nIf there is love you cannot kill the body, imagine what you will put her through, breaking up and then suiciding, she will cry. We can talk if you want:) ",
                "It's good to talk it out",
                "Regardless of what you do with that situation, you deserve to be happy and I hope you are able to reach out to someone and get   \nthe help you need and deserve. "
            ]
        },
        {
            "tag": 20049,
            "patterns": "About a month ago me and my other friend noticed our \"friends\" were toxic so we stopped talking to them about a week later we forgived them. Then around last week we unforgived them and our other \"friend\" made life worst they are one of the main reasons i want to die. They go to my school and try to act like i will be there for you when they are on my depressions side (btw they don't know i am depressed) How do i get away from this i can't deal with it????",
            "responses": [
                "Please ensure you have selected a flair for your post. Flairless posts do not receive as much attention as flaired posts do; we may remove posts without flairs.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/depression_help) if you have any patternss or concerns.*"
            ]
        },
        {
            "tag": 20050,
            "patterns": "[removed]",
            "responses": [
                "Please ensure you have selected a flair for your post. Flairless posts do not receive as much attention as flaired posts do; we may remove posts without flairs.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/depression_help) if you have any patternss or concerns.*"
            ]
        },
        {
            "tag": 20051,
            "patterns": "It’s starting over again! My mental illness cycle is starting over, I thought I was crazy the second time this started and now I am sure this is just a cycle. \n1. I start at a point where I think I am a bit sad\n2. I dwell on it\n3.I feel crazy\n4.I start feeling so damn depressed \n5. My anxiety increases\n6. I start thinking about died\n7. I get obsessed with death \n8. I start feeling like I am gonna die if I stay so fat \n9. I stop eating\n10. I become fully suicidal \n11. I have probably stopped doing a lot of work now\n12. I can’t leave my bed\n13. I can’t stay alive, I don’t eat anymore, I don’t sleep anymore, I am fed up of being so useless \n14. I start writing suicide notes\n15. I try attempting but I just can’t bring myself to it\n16. And then I attempt (happens in the first cycle)\n17. I still stay depressed and suicidal for a long time \n18. I get angry when I don’t feel suicidal or depressed and get into bloody fights \n\nThen it starts over again ",
            "responses": [
                "Please ensure you have selected a flair for your post. Flairless posts do not receive as much attention as flaired posts do; we may remove posts without flairs.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/depression_help) if you have any patternss or concerns.*",
                "It takes a lot of conscious effort to stop the cycle. A lot of times, we need professional help to break out of that repetitive train of thinking. I hope that you have an opportunity to get help so you can be happy."
            ]
        },
        {
            "tag": 20052,
            "patterns": "I don't know anymore. I think I'm depressed. But something is always telling me that I just want attention. It's not even other people, it's just.. Me. I'm telling that to myself, in a way. I'm so alone. I feel like it. I always act so happy... Yet I'm actually screaming for help. I noticed that I use a lot of words associated with sadness when we're supposed to come up with some random words and stuff at school. I noticed that I tell myself that I want to die and that I don't care anymore, but I know I do. I just feel like I don't. I feel like I'm worthless. I just want to stay in bed forever. I want time to stop. I want to be the only person on Earth, so I can cry in peace. That's the thing. I need help, I want help. But I'm afraid to get it. I oh so many times chatted with a friend online, wanting to just type in all caps that I need help. I looked at my mom so many types, pleading for her to help me, but she never notices. Because I never say it out loud. I want to talk to someone about what I'm feeling. But\nIt's so difficult to explain what I need to explain. I don't like discussing my problems. I just want peace. But\n\nI want to scream so much. Please. I'm begging, anyone. Please. I can't talk to anyone. Even now I just want to delete everything I just wrote. It feels so detailless. It feels like you won't even be able to understand what I need you to understand. I'm so lost. I've been crying for over an hour. I can't stop. When I do, I start again soon after. I want to sleep. I'm so tired. This is so long, but I don't want to stop typing. It's like life in a way. It's so long and so sad and meaningless, but I need to hold onto it, for whatever reason. ",
            "responses": [
                "Hey, I just wanna say that the fact that you took the time to write it all out, post it here and all in all, reach out for help shows that you want to become better. It is a good start. \nPersonally, I can assure you that I've gone through similar feelings where I wanted to talk to someone but at the same time, I felt awkward in doing so. I had this constant feeling of wanting to die. It was because I felt incompetent and that I wasn't good enough and I fought that depression and anxiety attacks for more than four years. Trust me when I say that I understand how you feel right down to the letter. You need help.  At the least, you need someone to talk to...\nFor that, you *HAVE* to make an effort yourself. Go up to someone you really trust and tell them everything that's on your mind. If you don't make that effort, you won't be able to fight it. Just talk about it. It makes you feel better. Maybe to your parents , relatives , friends or anyone else you trust. Now, if you feel like there isn't anyone in your life who'd want to listen to you, you can either search for such people or reach out online like you just did.\nThere are a lot of people (including me) who'd be happy to help you out. So, if you feel like it , we can talk about whatever is bothering you and I'm sure we'll be able to relate to each other's problems.\nOverall, just know that you're not alone. Just have a positive mindset, believe in yourself and keep that feeling inside that one day, everything will be alright and you'll look back smiling and say \"I survived.\". \nI sincerely hope everything turns out good for you. :)",
                "We're complex beings, you are the one you describe but also you are a person capable of so many great things, you're just letting this \"dark\" person take control. No shame on that, but just don't give up, there are things in life that makes us happy, try to stay positive, grab those little everyday happiness!\n\nYou are not alone, millions have depression too, millions feel worthless right now, you may be screaming for help inside you, you seem to be faking laughs and smiles but don't worry, embrace your darkness, it's part of you, but try to find balance! Try doing small and simple things and slowly changing to a better day! "
            ]
        },
        {
            "tag": 20053,
            "patterns": "We were happy then he just up and leaves because he’s depressed. \n\nI’m also depressed and I want to die.",
            "responses": [
                "Did he leave and not say anything? Was there any other reason? I am so sorry your going through it. If everything dont work out just remember there ARE other fish in the sea. Yeah that mightve been your fish but maybe that fish didnt match your energy. The universe works in mysterious ways. I would recommened some self-care. Draw yourself a bath, get a bath bomb or essential oils, watch a motivational video, eat a good meal, get a massage. Get your head out of the gutter if its truly over. It willl 100% hurt.... but it gets better",
                "Someone leaving you because of your mental illness is not someone you want to be with. I know that is hard to hear, but it is true.\n\nDepression is not something that just disappears one day when you fall in love, and many people think they can love their SO’s mental illness away, and when they realise they can’t, and it’s going to be a long term struggle for both of you, and you will require lots of support, they might leave.\n\nThat is not your fault. That is their fault. Someone who truly loves you will love you with your illness and not despite it. I hope you find them soon, friend ❤️"
            ]
        },
        {
            "tag": 20054,
            "patterns": "I've never been a bad person, i've never hurted anybody or anything, yet i've been miserable my whole life, my life hasn't even really started yet, i'm not even 20, and i want to die, i feel burned out, today, i feel like killing myself more than any other day, i've done nothing wrong, and now, today, my tooth fell out, it was already hollow, and the dentist just pulled it out like it was a piece of popcorn kernel, my wisdom tooth broke it, and then it slowly died, i woke up today with the hope that my life would improve just a bit because they where removing a wisdom tooth that had been annoying me for a while, and now this, i'm deeply, deeply hurting, i feel like everything is falling apart, nothing ever goes the way i want it/need too, i really thought this year would be great, and now, now the little hope i had left is completely gone, something broke inside me, i don't know what, but it did, the tiny flame that was keeping me going, has faded",
            "responses": [
                "I may get flamed for this, but this hit me like a ton of bricks: https://youtu.be/h194kSmK3SQ",
                "It' so, sad that this is so very accurate",
                "According to the Buddha, all life is suffering, but that suffering is also transient - that is why even at funerals, people can remember good times and laugh in the depths of sadness. If you're depressed, it can seem unending. I just turned 60, and have far fewer teeth than I started with - very much a result of untreated depression. Get yourself the care you need - now - so that you can have the life you deserve.",
                "As long as you have a heartbeat, and can communicate, your soul is more than just a little flame. Every day, you can do little new things that reinvigorate you. \n\nAnd remember that failures don’t define you if you don’t let them. If you keep going.",
                "I have a lot of health conditions but none that stop me from everyday activities (allergies, autoimmune). I accepted that sometimes you have to suffer the bad to appreciate the good. I appreciate the good times when I’m not breaking out from my autoimmune, and when I am breaking out I trust that it will pass, and I’ll feel better soon. \n\nI’m not sure on your beliefs but I’m spiritual and I believe I go through physical pain to teach me how to appreciate and grow with the better things in life. "
            ]
        },
        {
            "tag": 20055,
            "patterns": "I've lost too much in my life. I lost another boyfriend an hour or so ago. I've been starving myself. I don't want to live in this hellhole anymore. Every day is suffering and I find no reason to wake up. I lose everything close to me and just want to die. It's useless to me and I don't want to live. I just want to be happy, but I can't feel that anymore. I don't like this world, I want out of it. It hurts too much to live with this pain and guilt. Everything is painful to me, and I want to die.\n\n&amp;#x200B;\n\nThis isn't a cry for help, it's a cry for forgiveness from the people I've hurt in the past.",
            "responses": [
                "You are not useless, you can beat the depression, what have you done to people in the past?\nDon't ever give up. ",
                "I just feel like I've hurt everyone I meet, since I have anger issues. I always get mad easily and take it out on them. It hurts them and I feel bad doing it. But thank you for the encouragement.. I truly appreciate it.",
                "[removed]"
            ]
        },
        {
            "tag": 20056,
            "patterns": "I feel like my depression will never get any better. I can't get out of bed, yet I feel guilty for not working. I've barely eaten - the idea of food makes me feel ill - but I feel bad for not eating. I'm failing my exams and have no long-term goals, because even as an \"adult\" at 19 I don't know what I want to do with my life. I've spent most of the last couple of days staring at the ceiling feeling terrible in every way.\n\nI don't enjoy anything anymore. And my parents don't think that my disorder/disability ([Tourette's syndrome](https://tourette.org/about-tourette/overview/what-is-tourette/#1461071540054-f0944fbc-3f2b)) exists, so I get told off regularly for something I physically cannot control.\n\nThoughts of wanting to self-harm have come back after a few months of not harming, and I just feel like I want to die. Just this morning I was looking through the medications we have at home to see what sort of thing could kill me with an overdose. The flair is \"requesting support\", but I only put that because it needs a flair. Just ignore this, it doesn't matter. ",
            "responses": [
                "At this point the only one who matters is yourself. My saving point is my pet. People like us are the strongest because we deal with the pain and depression everyday. Do not forget you are strong for it, if you repeat this to yourself it may help you to get going. Even something as small as making the bed each morning will get you going, repetitiveness helps. I may be a random person over the internet but i believe in you.",
                "I'm 29 and I still don't know what I want to do with my life. You're not alone.",
                "I've been in this position... I was diagnosed when I was 17 and I'm not 22... I've not had it for at least 4 months not but there were times where I don't know where I wanted to go or what I wanted to do... but just take it day by day, small steps at a time and you'll find you'll get better slowly :) try thinking positive and going for a walk or something, try eating food that's healthy for you :) this will help with your moods and motivation :) try and think about stuff you want to achieve and want to do rather that what not to do :) ",
                "That... kinda scares me tbh. I don't want to get to 10 years from now and still not know what I'm doing",
                "Could be a good motivational point to help guide your decisions. =)",
                "I am 28 and still have no clue. I know what i would like to have or what i am Aiming for but for me its just not in reach and i guess it will never be ",
                "I’ve been there, I’m 21 now and when I was 19 I didn’t know what to do with my life and I was also failing school, I’m still dealing with depression and possibly borderline personality disorder, and now that I’ve finally gotten my grades back up and figured out what I want to do in my life, I don’t have enough motivation to do so, and my parents think that depression is caused by just sadness so they just tell me I have nothing to be sad about and it frustrates me because they don’t get that it’s not that I don’t want to do things, it’s that I lack strength to do so. My best coping mechanism is honestly just talking to my friends because they are the only ones that have been extremely understanding and extremely supportive and are still here to help me out ",
                "Man I wanted to post the same thing a couple minutes ago, man I realized that I don’t know what I want to do with my life, today I went to an IT job interview and I realized that I don’t want to work in IT, although I’ve been studying and practicing for like 3-4 years and only now I get that, and that’s not really not the point — I just think that there is nothing in the world that I would like to work 9/5 on, but I will have to... 9 to 5... Goddamn, I am only 18, I have a gap year, and I live with my parents and only a couple months left before I should start study and work, and man I can’t handle that pressure"
            ]
        },
        {
            "tag": 20057,
            "patterns": "I had an amazing week where did'nt just pretend to be happy. Now i don't see any point in my existance. I mean, like why the fuck would i want to live when everyone i know just see me as that weirdo that sits alone in the corner? My so-called \"friends\" only keep me around to fill the quota of that one gay best friend. (I'm bi, but it still counts apparently.) I really think everyone would be much better off without me. I'm a nuisance. Not even my family wants me around. If this keeps up i guess i'll see you soon.",
            "responses": [
                "so what was the biggest change from last week to this week?",
                "Nothing really. Just sorta lived my life."
            ]
        },
        {
            "tag": 20058,
            "patterns": "I feel so low, I've split recently from my partner of 6 years, we have three children together and shit has got heavy. For me. I'm finding it harder to care about the impact my death would have and the more nights I spend alone crying, well, I still care enough to be worried. I don't know what to do and I'm waiting for a phone call from the local quacks, but that won't be until the 24th. I'm alone and I'm scared and I want my mummy. I haven't had one since I was three and I don't know what ok feels like. ",
            "responses": [
                "I don't know if this will help. And i don't want to put a feeling of guilt on you, but leaving your kids to be motherless/fatherless is out of the patterns. Maybe one day one of your children will go through this and they will long for their mom/dad.  If you decide for them that they also have to  suffer on their own without your comfort you are putting them in your position. If you can't find it for yourself find a reason to live for them. \n",
                "Holy shit. Thank you. ",
                "I hope it helps put things in perspective. And you are loved and needed in this world.",
                "It's so simple. I can't thank you enough for that. You kind stranger are loved and needed in this world. "
            ]
        },
        {
            "tag": 20059,
            "patterns": "\"I'm so alone, nothing feels like home. I'm so alone, trying to find my way back home to you.\" *Alone* by Marshmello. I like this song, because it describes how I feel. Not exactly the \"alone\" part, ill get to that in a minute, but the \"nothing feels like home.\" I don't feel at home anywhere. For months, ive just been feeling so empty, and here recently, my family just makes it worse. The last time I felt at home anywhere was at my ex GF's house a couple weeks ago.\n\nOn the topic of my parents;They aren't bad. They aren't abusive. They are good, Christian people. Not the \"Trans people are going to hell\" christian, the \"help the homeless guy\" Christian. The \"treat others as you yourself want to be treated\" Christian (And trust me, they take that seriously). They do their best. They try, they really do, and I can recognize that. But, something broke inside of me. I can't accomplish anything around my dad, because i'm afraid he'll say \"Good job, son.\"\n\nI don't know whats wrong with me, but any words from them that would normally be encouraging to other kids, those words seem to hurt me. I don't mean just mentally, but i can feel it. It gets harder to breath, there's this new weight in my stomach on top of the already present anxiety and stress.\n\nEvery time I talk to my parents, I die a little. Every time I talk to my parents, I want to die a little more.\n\nI can't feel joy anymore either. It started when I realized that things that used to be enjoyable and fun just weren't anymore. I tried to find new things, but nothing is anymore.\n\nThe only thing that calms me down is nicotine. its the only thing that keeps me from knocking someone out. But I can't keep going with that, i'm a minor, and i don't make enough money to pay that damned fine when I get caught.\n\nI remember my love for Planes. Cars, trucks, motorcycles, you name it. Does it have a motor? Does it move with that motor? I loved it. I also remember my love for Military. I got one of those Facebook Memory things from my mom a few days ago, and it was pretty much my mom asking how many times I can say \"Tactical Nuke\" coherently in a sentence while playing barbie with my sister. I remember the dreams of joining the fight, of coming home a hero. Now I dream about how little of my body they can recover if i go.\n\nAnd I say dream, because it plays into the title of this post. \"Passively Suicidal.\"\n\nI don't find joy in anything I used to. Tearing down a motor with my friend? Not anymore, apparently. Playing any of this ridiculous amount of video games I have? Nada. My life has come down to lying in bed, thinking about the bliss of death, or lying in bed, thinking about when I was able to hold the only person I care about anymore in my arms and just be happy.\n\nI'm in between houses. Currently renting from a family friend. We left a house that was too expensive to live in (Probably because of how long my showers are, jesus christ thats a big water bill) guided by my parents dream of building a little house thats just big enough for our family out in the woods. I'm in between houses, not sure if we have the money to find a new place to live before the house we are renting gets sold. Because apparently we are renting it till it sells, sheesh.\n\nAll of my friends are in the old town. I don't have anyone here except the parents make me hate myself, because i'm homeschooling.\n\nThe scars stay longer every time.\n\nI have a good life. But apparently my mind can't take it. Apparently I can't be happy. Because I would be happy if there wasn't something wrong with my head.\n\nI was told that the feeling of emotionlessness and emptiness comes from you having too many emotions to handle. I was told so many things. No matter how much I want to cry, I can't, because i'm a boy! i'm a man! and men can't cry. I guess im the pinnacle of man, huh? Because no matter how much I want to cry, I can't. No matter if ive been sitting here, remembering every single goddamned good thing in my life, sitting here with red eyes and tears building up, I still can't cry. I guess thats whats keeping me from ending it. Because im never emotional enough to pull the trigger.\n\ni need someone to tell me its going to be okay.\n\nHeres to another night of blazing through my e-juice and downing a whole bag of fun-sized kit-kats by 5 am, I guess.",
            "responses": [
                "Even though I don’t stop myself from crying, I’m a male, I find myself unable to actually cry even though my eyes are really teary to the point of a film. I don’t understand why I can’t cry, I just can’t somedays and it’s a shitty feeling. I’m so emotional and yet I can’t even cry?\n\nI understand what you’re going through, I’ve lost all motivation and joy from the things I love to do. When I play games, I’m just playing to distract myself and it’s not fun anymore. Hiking? I love to hike but I never have the motivation or energy to do so.\n\nTalk to someone, anyone. It helps me, it may help you. We get trapped in our mind and can’t get out of it. If we talk to someone, that helps get rid of those trapped emotions and thoughts.",
                "[removed]",
                "I try. I cant talk to my parents, and none of my friends are able to text when i need them",
                "Find someone that you can talk to, your friends will most likely understand when you need them. Just tell them you need to rant."
            ]
        },
        {
            "tag": 20060,
            "patterns": "I just don’t know what to do anymore. In a matter of months I’ve lost everything. Everything. This is going to be long winded.\n\nIt actually started in 2017. In order, my girlfriend of three years leaves me — just out of the blue. Says she doesn’t love me anymore. Leaves. A few weeks after that, my grandfather/father figure dies. Shortly after that, I lose my apartment because my roommate screws me over and moves out of state with little to no warning. I have no choice but to move in with my father, who I do not have the best relationship with and our personalities just fucking clash. He’s an obnoxious, retired, over-the-hill frat boy and I’m a sensitive, anxious, depressive INFJ. It’s a cramped, small apartment where I have to sleep on two sectional couches pushed together in a back room and I also have two cats. Just when I think things can’t get any worse, my favorite client (I work in the group home field) dies in my arms; she was only 34. That was 2017.\n\n2018 rolls around and I just hate life and everything else. I hate my situation. I hate everything. Summer comes and I meet this girl and a spark lights up inside me — something I haven’t felt in a very long time, maybe ever. I fall for her very hard and very fast. We end up moving in together and everything is just great. It’s everything I’ve ever wanted in a relationship, and in life. Things finally feel good. I planned on going back to school in a few months and I saw a real future in us. I was walking on clouds. The darkness seemed behind me.\n\nThen, late November (week after Thanksgiving, I believe), she begins acting very weird and very distant. Pushes me away, says she’s depressed about stuff, needs her space until it passes. I oblige at first but, from my experience, this is how girls act when they’re about to leave me. So I keep prying and kind of won’t leave her alone...until one night I kind of just emotionally explode. Long story short, she leaves me on a Sunday night, and is back with her ex mere days later. Did I fuck something up or was that just going to happen anyway? I have no clue...but I beat myself over it constantly.\n\nIn any case, this absolutely destroys me. I talk to my therapist and what I’m saying to her convinced her that I need to be admitted to the psych ward of a local hospital (not my first stint; spent two weeks there after a suicide attempt as a teen). I spend a week there but feel worse after getting out. End up having to move back in with my father because I have nowhere else to go; I’m literally living on a fucking couch. I can’t sleep. I can’t eat; I end up dropping 20 pounds. I start drinking very heavily. I start getting fall down drunk at bars, literally sobbing on the floor like a child — not a 30-year-old man.\n\nI ended up falling asleep at work in January since I hardly sleep at night anymore and it cost me my job. So I became a miserable lonely heartbroken suicidal drunk with no money, no job, no real home, hanging on by a thread. All I can think about, still...is her. And how she’s with him and how he has money and his own place and how she has a good job and I’m this fucking nothing. I feel like I’m going absolutely insane.\n\nI found a new job but it’s shit and it pays even less than what I was making at my previous job. I’m about to be kicked off of state insurance because I “make too much money” now so I have no fucking clue how I’m going to get my meds. I feel like an incompetent child. All I think about is dying, ending it, being dead. I want to die. I’ve struggled with depression and mental illness my entire life and this is the lowest, darkest place I have ever been. I don’t know why I’m posting here, to be honest...I just think my friends are sick of me and I feel like a burden to everybody around me. I feel like I can barely function. I’m so tired. I’m so fucking tired...I don’t want to do this anymore...",
            "responses": [
                "It does feel old. Especially when you are dealing with Depression, anxiety.\nI have borderline personality, Bipolar, PTSD, panic attacks, anxiety all day long and I don't sleep much either. I even take 300 Trazadone, doesn't help much.\n\nI have noticed, for me that bad luck happens in three's.\nAnd then I'll do ok.\n\nRollercoaster.\n\nPromise it will be get better..."
            ]
        },
        {
            "tag": 20061,
            "patterns": "Summer is approaching and I'm almost done with my online school. I never wanted to dp online school but my mom made me do it and made me live with my dad. I hate my step bro and step mom so I dont like loving here but being at my mom's with 4 other siblings two older two younger isn't much better. We moved alot so I was never really bothered by having to make new friends and I'm pretty outgoing. But recently it's been really depressing since I cant even go to school and I have two friends who live on this street I have nothing to do all day and nothing to do outside. I noticed summer is approaching and I dont want to be bored. But I have nothing I can do. But I fear my mom is going to make me do online classes again and I might kill myself. I really dont know what to do but I want to experience things other teens do. I sit at home alone NC my friends cant come out and just get really depressed. I feel trapped in a corner and I think I might kill myself after summer.",
            "responses": [
                "Also I'm pretty sure this is common butnwhenbi think about this my chest and stomach physically hurt not like I feel like I'll throw up but they hurt alot."
            ]
        },
        {
            "tag": 20062,
            "patterns": "Whats the point? can't i just starve myself to death already. \n\nanxiety makes me queasy all day of course i dont feel like eating, please dont make me \n\ni want to die",
            "responses": [
                "I know.",
                "I know depression can make it so nothing tastes good or even has any taste and it feels like it takes too much energy to eat. But it's so important to try to stay at least physically healthy and it can help with mental health. I'm not saying it will definitely make you feel better but it just might. \n\nOne of the most important things is to stay hydrated. Keep a bottle or glass of water near on your night stand if you have days where it's too hard to get out of bed or as a good habit even if you don't. If it gets hot and you sweat when you sleep, a second bottle of Gatorade or something similar might be a good idea. \n\nYou could try going for liquid meal replacements like soylent to make sure you're getting enough nutrients. It's also a little easier to hold down and you can take small sips. It's a little expensive but so much easier if you have the funds. \n\nIf you have good friends, you could always ask them if they want to eat together with you. Personally I find it encouraging and much easier to eat more when I'm around close friends. ",
                "Try keeping small and easy to access snacks around the house. Nothing too spicy, salty, or sweet.  Do you have any favorite foods or something you know you could keep down?  It can be as simple as buttered bread or a cheese sandwich.  Also make sure to drink fluids or you could end up in the hospital with dehydration. ",
                "I hear you, some days I felt like I knew the 'taste' of cortisol better than anything else and even the idea of eating made me nauseous. The weight loss made my self esteem plummet further and lowered my energy levels, the spiral got worse, and most people didn't know how to react in any other means than exclaim how skinny I am and tell me I need to eat something. Of course this lead to greater self isolation in an effort to avoid such comments and judgements and the spiral  worsened. \nYou need to live. If you die, bad results for others are a certainty but if you live, there is the possibility for greatness to occur by your actions,greatness for yourself and others. \nLiquid meal supplements were the easiest to stomach, but keeping active made the biggest difference for me, going to the gym or going on a long walk or distracting myself in the garden helped my mental state and my appetite. \nI hope at least one of these posts makes a difference for you. The pain and the anxiety will end in time, it won't last forever. \n",
                "Post this to r/TealPill too, I think it would be good there for help."
            ]
        },
        {
            "tag": 20063,
            "patterns": "I don't know if this is the right sub for this I just assumed it is. I feel stuck. I want to die (I won't) but not because I don't want to, but more because I don't feel I even have that choice. My biggest regret is that I didn't die when I had the chance and that having hope was my biggest mistake. I'm not normally the type to ask for help and I'm not sure if this counts as asking for help, but I'm just having some really intense feelings right now. This is embarrassing to write.",
            "responses": [
                "This hit me where it hurts. I truly hope you can find something to help. In searching, too. If I find it, I'll share. Take care of yourself, you truly do matter.",
                "Sorry you're suffering too. I prefer the numb part of depression not this part. We'll probably make it out of this eventually.",
                "I think we will, the interim is just so painful. ",
                "Glad to hear you're fine. The painful part is definitely worse than the numbing. During the numbing g there are so many things you can do to feel: go outside in the rain or snow, take a hot shower, listen to music, watch your favorite feel good tv show or movie. However, it's so hard for me to find non-hurtful ways to cope with the pain. \nI think I might try writing or crafts to help. I hope you find something that helps as well. ",
                "I sleep If I get overwhelmed by feelings. "
            ]
        },
        {
            "tag": 20064,
            "patterns": "A few weeks ago I posted saying I was pinned down and a girl made out with me at school. It has been and still is tearing me up inside. I was told to tell a trusted adult, last night I was at a party with my sister and the girl who made out with me was there and I was terrified. My sister asked me what was wrong when I said nothing she pushed the subject and I told her. She's still mad at me. She yelled at me in front of everyone \"What the fuck is wrong with you\" and \"You just let it happen\". I'm disgusted in myself I can't eat and every time I look in the mirror I wan't to throw up. I can still feel her on me. I can't take it anymore, I want to die so much. I'm terrified to go to school and terrified to see my sister. I just don't want to live anymore.",
            "responses": [
                "Have you told an adult? If you haven’t you need to. ",
                "She is an adult, the only one I really trust.",
                "How old are you,gender,sexuality and why was it disturbing to you?",
                "I know hearing this advice sucks, but what about a teacher you're neutral about? ",
                "I’m so sorry this happened to you. And I’m so sorry that your sister reacted the way that she did.\n\nWhat that girl did to you was wrong. It is understandable that you are feeling scared.\n\nPlease talk to a teacher or the counselor at your school. If you are able, go early before school when there aren’t as many people around. Even if not much can be done about the situation, at least talk to someone who can help you with these feelings you are having.",
                "One of my teachers knows she says school wise not much can be done ",
                "I’m 15, female, and heterosexual. It was disturbing to me because I had no control over the situation. I tried to push her off and I told her to get off me over and over again. She didn’t listen. People saw it happen and no one did anything.",
                "Frankly, your teacher should be able to do more to help you and I'm sorry the adults in your life have disappointed you. "
            ]
        },
        {
            "tag": 20065,
            "patterns": "I was always a black sheep everywhere I went. I was hated by my classmates and teachers in every school and I never knew why. \nI used to spedning times with myself,  my imagination or tulpas.  Since noone really wanted to spend time with me anyway. I was bullied on daily basis,  I was even beaten few times. \nI am first to cry. I cried almost every day of my life.  Even in the middle of the class.  My parents always hated me because of that,  they were telling me my tears were fake and I just want everybody to pity me... My grandparents were worse, I often heard from them,  that I am a slut (because I wore a light dress)  or a pest. I tend to get into psychosis,  I hurt myself in hopes physical pain will releive the mental one. I screamed my lungs out and the only thing my parents were doing is threten me to put me into asylum. Later on I was diagnosed with Schizotypal Personality Disorder. Because I tried to help people,  now I am scared to go on any convention in my country,  because people from communities that once gave me some comefort stabbed me in the back... \n\nEven so,  I always thought it's going to get better.  I had great grades,  I scored highest in my school on finals, got to a great university. I had a lot of talents in art and acting,  won a lot of competitons.  Everything seemed to be going better right? \n\nWell now I want to die. \n\nI have 20 years now and every single day it gets worse. I realized how shitty the world we live in is. And there is no escape from it. I think about death ever single day.  I am scared to die yet I dont want to live.  \n\nI failed my first year at uni. My parents were furious. I moved to a different course - IT,  on weekend studies. But my uni still expects too much from what I am able to offer. And I need to pay horrendous amount of money. So much I got a note few days ago that they want to kick me out  because I am not able to pay for everything. And to make it worse I fail classes after classes, and I cant quit because I dont want to hurt my parents anymore. \n\nOr right,  I discovered my parents were swingers. It disgusts me.  I feel betrayed,  I feel like I dont have a family anymore,  even those tiny bits they were before.  \n\nAnd guess what. All of those awesome grades and prizes I won at school?  They does not matter now. I feel useless.  I dont have any skills that are valuable to a recruiter.  Some say my art is great,  but I am turned down everywhere I try to apply. Right now I work as a game tester. It sounds like a dream job untill you barly earn enough to make a living,  and your boss is constantly lying to you and overlook everything you do.\n\nI think my schizotype is turning into schizophrenia. I spend more time with my tulpas or talking to myself than with other people. And I prefer it that way,  but the thought of it all being fake,  being only in my head scares me,  because it makes it so I need to accept the world I live in as true. And I dont want that. I feel like everything resolves either around sex or money. Right now I feel like I am watching a movie. My internal feelings do not match my physical reactions. \n\nMy fiancee promises that he's going to arrange it so we can live together even this year (I live in Poland,  he lives in Norway,  so its not an easy thing for us. ) But I fear it wil change nothing... I will just be a pest again.. \n\nAnd now I am laying in bed. Wishing I could go to sleep and never wake up. I have exams on weekend,  but I barely have strength to type on my phone. I feel thrown somewhere where I dont want to be...  I just want to go home...  \n",
            "responses": [
                "Hey I’m sorry you’re feeling so down. I would strongly urge you to look into r/maladaptivedaydreamimg to see whether or not maladaptive daydreaming better describes you. \n\nThere seems to be this inner struggle between you and society going on?  I would urge you to stop thinking about the evils or meaning of the world and instead just focus on yourself. I truly believe that beauty begins the moment you decide to be yourself. So what? Be the black sheep. The black sheep is still more than capable. ",
                "ur good at drawing jhin tho",
                "Lol thanks ;w;",
                "Uhm, I am having troubles with ignoring it all, it gets to me really easly... I'll take a look at the subreddit, thank you very much"
            ]
        },
        {
            "tag": 20066,
            "patterns": "I'm trying to do all the right things. I exercise. Have a regular sleeping routine. I try to eat... though that's becoming more of a struggle. I have a good life. A roof over my head that I pay for at a job I don't hate. Good friends, a boyfriend I care about. I make an effort to stay in touch with them and do things with them. I have cats. Thinking about getting a fish.\n\nI've also lost 15lbs in the last year. I wasn't trying to nor did I need to and I'm still losing. I struggle to get out of bed most days, though I am managing it mostly. I started taking some SNRIs my PCP prescribed me, which is stabilizing my mood and helping me focus, but I'm still struggling to find something to focus *on.*\n\nI've always had trouble finding meaning in my life. Now that I'm getting older, it's gotten worse. I feel like there's nothing left for me. Nothing new under the sun and a lot less hope that that will ever change. Even with the drugs, my mind keeps drifting to the simple conclusion that I want to die. Just go to sleep and never wake up.\n\nI can't afford therapy, and yes I've checked. EAP was a waste of time and I can't afford the specialist copays even if I could find someone who accepted my insurance. \n\nPlus I don't know what I'd talk about. Nothing's really *wrong.* \n\nI'm trying everything every book tells you to do. I try to focus on the moment, on the good things in my life, but there's still this niggling little thought that it's all temporary. Good things always end. None of it means anything anyway. Might as well die now.\n\nI don't know what else to do.",
            "responses": [
                "The eating may be something else . I personally have gastroperisis and that will make you lose weight (and feel bad in general because you’re not eating enough).\n\nThink Tony Robbins breaks it down well. 6 needs and we all have one that we value more than the other but they all have to be met.\n\nExample if you find “comfort” in your routine “Certainty” but you don’t show much value added to yourself you may need to look to other areas to fulfill those needs\n\nI believe the strongest need of all is contribution, helping others gives you personal growth, love, signifance , uncertainty a lot of your needs are met by helping people! Some people say when you live your life for others you’ll find strength you never knew you had \n\nNeed 1: Certainty/Comfort. The first human need is the need for Certainty. ...\nNeed 2: Uncertainty/Variety. ...\nNeed 3: Significance. ...\nNeed 4: Love &amp; Connection. ...\nNeed 5: Growth. ...\nNeed 6: Contribution.",
                "Unfortunately depression is a lot of management and coping. Even with medication and therapy people still have to deal with the symptoms. Maybe see if you can find any online therapy groups or go online to NAMI.  Also research your local area to see if there are any support groups or an online list of therapists in the vicinity. Maybe if you explain your current financial situation  or insurance they could put you on a pay scale.  It may take a little work, but there should be someone or somewhere you can go.  Sometimes universities will have students learning therapy that can and will practice for cheaper than certain mental health institutes.  It really sounds like you need to talk to someone to pinpoint what is causing your depression. Best of luck to you and keep fighting.",
                "You know, as a defense mechanism, people tend to isolate feelings and call them \"demons\". I used to feel really bad about injuring people and other mischievous thoughts. But in the end, You is You, there are no demons, no curses, no possesions. What you're feeling is yours, it's not part of you, it is you. I believe this kind of thoughts make up for some really great Stephen King'esque kind of writting, have you thought about it? Maybe writting could be a great hobby you haven't tried yet"
            ]
        },
        {
            "tag": 20067,
            "patterns": "      I recently have been feeling lost with everything crashing down around me. For reference when I was in high school I was diagnosed with social anxiety and clinical depression. I took pills and they never seemed to work. I stayed the overweight quite kid throughout my entire high school experience. I talked to next to no one. I felt like dying every moment I was awake. I think this stinted my social growth.\n\n        Shortly after high school my life started to change I grasped onto cooking as my passion and began the process of getting into shape. In a year's time I went from 315 lbs to 200. I was improving in everything around me except my social skills seemed to still be lacking. At heart I was still the same quite kid. \n\n       I'm now 21 and I still feel like I'm slowly improving but, I still see that I almost can't conquer feelings of self loathing about my overall social capability. I still struggle to build and maintain relationships ( friendships and otherwise). I've never been able to be in a loving relationship with someone, I've had flings but nothing more. I actively want to do something with my life, such as going to culinary school, but I feel like I would move and be friendless the entirety of the time I'm down there. \n\n        I'm wondering if anyone has had similar feelings of fear and loathing about their situation. I no longer feel like I want to die, I want to improve but have no clue how to approach it. Im willing to try anything to conquer my social standing. I'm a lonely person by nature and I want to fix it and expand my social circle. Help...\n",
            "responses": []
        },
        {
            "tag": 20068,
            "patterns": "Everything is worse than it has to be. I make one fucking mistake and I want to die. I'm so ridiculously sensitive when it comes to bullshit that I feel like I can't even function. I forget to take my medication sometimes, and it gets so much worse when that happens.\n\nI feel like I'm not even allowed to make a misstep, or a mistake, and everything has to be account for. I feel like I annoy the shit out of everyone and everything that has the misfortune of being around me. I obsess, I'm too sensitive, I take things too personally. I don't know how to fix it. God, tomorrow I know I'm going to delete this, but I don't know what I'm supposed to do right now. It's the middle of the night.\n\nHow am I supposed to function?? I can't work, I just spend my life drawing and painting AND I'M NOT EVEN GOOD AT IT. I have NOTHING to show for twenty-one years on this planet. Feels like I'm having a mental breakdown. The medication effects my memory, which makes it difficult to remember to take it in the first place. I don't know what I'm supposed to do. I don't even know what the point of writing this has been. I want to cry. ",
            "responses": [
                "I think like this too last time, but i told myself not everything is about you. Sometimes, you just have to force yourself not to care what others think and just do what you want. Why bother worrying over the smallest thing that you have done that you're scared that it has offended people. Most of the time, people don't notice or care about it. Everyone only worries about themselves only, surprising not everything we do matters. Don't think so much about it, cause it doesn't matter in the end. We are small compared to the universe so, lets not worry."
            ]
        },
        {
            "tag": 20069,
            "patterns": "I have been very depressed today and last night, sobbing uncontrollably, I haven't eaten in 2 days, and I really like this other person who doesn't like me, and I just don't know what to do anymore, I want to die, but I don't want to leave this world, I am so scared of being alone for the rest of my life, I'm scared he is never going to want to date me, but I can't stop thinking about him, please help.",
            "responses": []
        },
        {
            "tag": 20070,
            "patterns": "For the longest time I hid my depression in order to not 'cause a scene'. but it weighed too heavily on me, so I started opening up more and more, and after a year I'm at the point where if someone asks how I'm doing, I'll say exactly what's up. And I feel more lonely than ever. Not only do most people laugh it off and ignore it, the people who actually respond and try to help will give it 5-10minutes, and then pretend everything is normal, and then not talk to me for a while. \n\n&amp;#x200B;\n\nI know depression lies and tells you no one cares, but I'm having a very time arguing against it anymore. Almost everyone I know (except my parents and grandma) know I want to die everyday, yet there'll be weeks where none of my so-called friends will ask me how I'm doing. I don't reach out to them, cuz like I said I'm done pretending, and I don't wanna always be a downer, especially for people who haven't asked. So like, what?   \n\n\nI just feel so lonely all the time. A 10minute conversation with a friend is helpful, and at that time I do believe they care. But I can just feel myself getting more and more bitter and resentful towards them, pretending to care for 10minutes and then don't check up on me for weeks? It gets me hopeful only to be plummeted deeper down.   \n\n\nThoughts?",
            "responses": [
                "I told my friend about my suicidal ideas. Now they dont talk to me at all.  When talking about it no one ever really cared. I think they just try to ignore it untill it happens. People alway say they would support and help others with mental illness but they just say it to look good. In reality they wont help you at all. In this world no one cares. ",
                "Yup. Same thing happened to me. But keep being open! There are people who actually understand out there who will love you through it. I promise. These people are not your friends but it’s their loss, not yours. You are not just your depression and if they can’t see that then screw them! You are 100% worthy of friendship and compassion. I’m not saying mental illnesses don’t make some people uncomfortable. They do. But so does every other illness. You’re not responsible for that. Their behavior is reflection of them. Please take care of yourself, for yourself! I know I’m a stranger but I’m here for you!",
                "so your advice is?"
            ]
        },
        {
            "tag": 20071,
            "patterns": "My life over the past month and a half has been hell on earth. I just feel so empty and lonely and sad all the time. Home life, social life and personal life is all shit. \n\nA little background about me. I’m 17 and I’m transgender (Female to Male) this will come into play later. I also live in Scotland\n\nALL NAMES MENTIONED ARE NOT THE NAMES OF THE PEOPLE IRL. \n\nIt all started late November, I just started to talk to my friend again after I left the friend group because of my social anxiety - which I’ll go into further later. We hit it right back off and everything seemed to be going fine. The friend group consists of my best friend, Amber, My friend and Ambers boyfriend Jake, Paul and Tom. Everyone in my friend group apart from Paul and Tom know I’m trans. We were back on track and were being a normal group of friends when suddenly Amber breaks up with Jake. When I ask her why, she said she was being abused and cheated on by him - I felt so sad that I didn’t help her and I blame myself for not noticing earlier. We tell Jake he can’t be friends with us after he did that...\n\nAs I said, I have really bad social anxiety and I am really bad in any social situation with friends - I get really paranoid about if people are actually my friend, or if I’m being too annoying. I get these thoughts everyday and it sends me into a state of panic. \n\nNovember 31st: So I was sorta paranoid after Jake left as I thought he would spread around that I’m trans and Out me when I really don’t need to be. To get our minds off the situation me and Amber went into town and just bought some games and food. It was fun and probably the last time I was genuinely happy.\n\nDecember 5th: Amber keeps on joking about ODing on pills and she is an avid user of morphine and uses it to numb the pain when she cuts herself. I ask her to stop and I want to help and she pushes me away. Her jokes about her suicide seem real and I hurts me when she actually DID take pills - came in the next day and bragged about it knowing full well that I was trying to stop her last night and I was having a severe panic attack thinking my best friend was gone. I get really depressed after that.\n\nDecember 14th: I get invited to a New Years Party at Jack’s - I’m really excited, this is my first party I’m evER going to and we are planning what to do and what to bring, though the same day I fail my math test.\n\nDecember 18th-20th: Amber Outed me to Tom, he is transphobic and Homophobic which make me nervous. My Parents keep on fighting and fighting and fighting and I try to drown it out with musicals.\n\nDecember 22th: Jack messaged me the day after school finished for winter break saying that I can’t come to the party because I might try to rape Amber, let’s remind you I don’t have a dick, yet, and I don’t have any interest in Amber. So I was left really shaken up. I asked amber if she thought this and she didn’t reply. I was really hurt.\n\nDecember 26th: My Parents told me they are having a divorce, I had to sign a lot of paperwork, I cry myself to sleep every night. \n\nDecember 31st-Jan 1st: I see all the posts about the party - everyone looks so happy and I feel so left out and alone. I want to die. I was planning to come out today but because of the divorce I don’t want to do it...\n\nNow: The first day back at school and I walk straight past my friend group and I just feel their glares and them talking behind my back. My anxiety and stress get to much and I almost have a panic attack in the middle of the class. I feel like they will put me to the whole school soon\n\nI just feel so empty, so alone and unloved my life is just hellish and with my parents divorce, my loss of friends and my anxiety and depression is just too much. I tried getting in contact with a therapist but I asked Amber and she didn’t care. I just don’t know where I can go.",
            "responses": []
        },
        {
            "tag": 20072,
            "patterns": "Idk how to feel better. I want to die, but I have no reason too I just want to. I feel ready. Idk how to feel better, I'm engaged and I want to pursue my career and have kids and love with him but I just have the urge to kill myself. Idk how to get out of this. I see a psychiatrist and a counsler and I've been in a psych ward, I just feel ready to go. I have no hardships, no aloneness, and I used to be in a lot of physical pain but I seen Dr's and now I'm no longer in that. What else can I do to help? ",
            "responses": [
                "Live for other people? Like your fiance and potential kids.",
                "That's what I think about when I feel close to the breaking point but then I think about how when it's all over I dont need to think about the after effects because they wont apply to me. It's just I'm so ready to go, I don't want to be here but I do. Like I feel like im going to keep going but when something happens I'll just go through with it. I'm prepared for it",
                "I get it. I'm at a point rn where I don't feel like I have a ME reason to keep going, like my only purpose is to try and be there for others. But I also carry around a lot of guilt. Like how I feel guilty for being like this and my husband having to deal with me (though he says I'm worth it and that he wishes he could do more to help). But, when the suicidal ideation kicks in, my brain always jumps to after. Even though I won't have to deal with it after (though we don't know what happens after death, so maybe I would still have to deal with it?) I feel guilt over the ones my death would impact. Like, who would find me? And how that wouldn't be good for anyone. And if I try and fail, how I would have to deal with the guilt of disappointing everyone, including myself. And how everyone would either walk on eggshells around me or get irate. \n\nRight now, all I can do is keep going. I hope neither of us get to the point of going through with it.\n\nAlso, therapy is helping me to keep going. Maybe it could help you too?"
            ]
        },
        {
            "tag": 20073,
            "patterns": "I have NO ONE to help me out of this.   NO ONE.   People come ovwer and dump their dogs and kids here.   I have tried to make it clear that they cannot.   I want to die very very soon.   I cannot take it anymore.   They LAUGH.",
            "responses": [
                "Tell me what's going on.",
                "i really can't do this anymore.   I am utterly hopeless and I really,   really need to die but I can't even get to jump off a high place right now because FIRST I have to fucking find a place for my fucking dog.   Seriously maybe I should just have her jump with me.",
                "Eh, take a deep breath. ",
                "Saying that you are hopeless is not what's going on. You're desperate right now, I get that, I've been there. You feel something that won't go away, and that feeling wants you dead: You are not that feeling, ok? You are life. You are love. You are that which pushes the darkness of this world aside, and you're going to make it. You're going to be fine, really. I can help. Like I said, take a deep breath. Let's work through this together. Tell me what's got you fucked up.",
                "Your dog loves you unconditionally. You are her human. Just knowing she needs food, love, and that you are THAT person she knows. You do not want to harm her. \n\nYou can go to the ER if you can get someone dependable to watch your dog for 72 hours.  They will help you. Just go in and say you are suicidal. I did it and came out with medication, appointments for therapists, and it was free because I am low income. \n\nI’m not sure where you are, or what country your in but let us all help you. I’ve been where you are. \n\nDo you know anyone that can dog sit while you get help? \n",
                "you know you need help and reddit isn’t going to give you the help you need!  find a good therapist nearby and if you don’t have gov insurance then get it asap.  plot the road ahead of you and start walking it.  do the things that need to be done in order for your life to be easier to live.  nobody is going to do that for you ",
                "It sounds like you are going through an immediate crisis ! If you haven't already, please get off the internet (it can make it worse) and give someone a call. There are crisis lines easily available on google . ",
                "Please, friend. Do not make the mistake I did. Jumping from a high place...not only will it not guarantee your death, but it will harm your body and psyche forever. Your loved ones will remember the very day you jumped and it will scare them every year. \nAnd please do not drag any animal into your self harm. ",
                "if you need somewhere to put your dog there are a decent amount of subreddits for it"
            ]
        },
        {
            "tag": 20074,
            "patterns": "I never had the best relationship with my dad but there were good things about him and I love him. I have no beliefs about the afterlife and I just wish I could be comforted by something. What if I never see him again? I’m exhausted going up to the hospital everyday to feed him (he has dementia). Yesterday he slapped me in the face because he can’t help it from the dementia. I wish someone would be there for me. I feel so alone. I just feel like I want to die myself because life feels like nothing but pain for me. I’m rarely happy or excited about things and the pain doesn’t seem worth the few fleeting moments of joy I occasionally get. I just feel like giving up. My boyfriend made a point of telling me how my grief is negatively affecting him. He later apologized and said he was just explaining himself. That really hurt. I don’t know why I’m writing this maybe if you’ve experienced grief or something I’d like to hear from you",
            "responses": [
                "Hey there, I\"m really sorry that you're going through this. While I have never had to care for a dying parent (yet), I do know from other peeps who went through a similar situation that caregiver burnout and depression are very real. Are there any support groups in your area? Or a trusted friend/family member that you can reach out/vent to? Maybe look at respite programs in your area, even if it's just for a day. \n\n&amp;#x200B;\n\nSidebar, I lost my brother a little over a year ago very suddenly. Grief is incredibly hard/complex. But, it is survivable. The biggest piece of advice that I can give is to take it literally a day at a time if you need to. I\"m sorry that your bf made you feel bad, that's never fun, I wish I had a piece of advice to give to you. Best of luck. \n\n&amp;#x200B;",
                "Please talk to a professional about your pain. It’s actually even more painful to care for someone you love deep down but hurt you deeply when you were growing up. You love them but you don’t like them very much.  Accept that he is a dead man walking and work from there.\n\nTake a break from going to the hospital everyday if you have to. Maybe ask your bf to go on your behalf for the days you take a break. Don’t bear this on your own. It’s not worth it. These terminal illnesses can last for a very very long time. My friend’s dad took 5 years to die of cancer... \nOnce you work through your issues with your dad with a therapist, you can maybe talk to him about how he hurt you before. Not for him to apologize but for you to get some closure. Accept that he may never apologize or be remorseful for what he did or said to you. And accept that you can’t be there 24/7 for him, whatever will be, will be. Don’t be hung up on being present for his passing, no one can predict it and the anticipation and expectations just make it worse for you. \nStart making arrangements for his funeral, get his will in order, get that out of the way so you won’t be overwhelmed by it when it happens.\n\nYou can do this. You are stronger than you think you are."
            ]
        },
        {
            "tag": 20075,
            "patterns": "Where do i even start. I dont even know why im talking about this. Fuck it here we go.\n\n I've been dealing with severe depression and anxiety for the majority of my life. I have my usual up and down days. But this year has but all down. This year has been so unforgiving. The beginning of the year was semester 2 of 9th grade. I unfortunately caught the flu not once, not twice, not three, but four times. I missed a lot of school. Work piled up and i couldn't finish it all. Even with school help. Suffice it to say, i ended up failing. Thats where things got fucked.\n\n The fact that i would be doing the year over just killed me. And on top of that, in late April, i visited my mentally ill mother at her house (provided by the government) and it was traumatizing. She had no furniture, broken front door, barely any food in the fridge, one very small bedroom and a futon. That's it. Anyway, i was exploring her house and i checked under her sink. There was moldy food, roaches and flies everywhere, 3 very large empty bottles of vodka. I had no words to describe how i felt, i still dont. I left her house feeling empty inside. \n\nSummer this year was a rollercoaster ride. A very dark and rainy ride. Shortly after the last day of school. I hit rock bottom. I locked my bedroom door and didn't come out for days. Thoughts of suicide racing through my head, fuck that they were attacking my head. I had a plan and i was about to follow through when something pulled me back. I dont know what or how. But it did. So i walked away. My parents found me in my room. I was a total wreck, tears covering my entire face. I was taken to the hospital that day. And i spent 3 days there being evaluated. It was one of the most traumatizing and scary things ive ever experienced, not knowing what was in store for me.\n\n I got sent home and i got even more therapy (i had already been seeing a therapist for 6 years). Things got better and i had hope for a future. My plan was to kick ass at school and pass. But, my depression came back. Hit me like a truck. Though not in the way that you or i would expect. I didnt even realize i was depressed. I just slept all day (15-17 hours a day) all day everyday. I missed over 2 months of school. The entire first semester. Fucked. I thought i had a sleeping disorder at first. I went to see doctors and professionals about it and they said i was perfectly fine other than some easily fixable health issues. \n\nAround november, it hit me that im most likely going to be doing the 9th grade over again for the third time. I should be in 11th grade next year. Then the original symptoms of depression came back. Suicidal thoughts, hopelessness, no desire to do anything. December rolls around (merry and jollyness right?) and i had a new sense of hope. Christmas time was always my favorite time of year. Gifts and things that i want under the tree. That gave me a reason to keep going. I came to school more frequently because of that. Then winter break came.\n\nA few days ago (saturday), my grandma told me we dont have enough money for presents this year. I felt destroyed. I felt obliterated. It hit me like a nuclear bomb. Hiroshima in my head. The past few days ive just been laying in my bed not doing much. \n\nI dont feel like doing anything. I want to die, but at the same time, My birthday is in 3 months (tax return time so guaranteed presents). I want to keep going not only for my parents and the people who love me. But for myself and for those presents. I just dont know how im gonna make it through. My usual antidepressants havent been working. So i have a psychiatrist appointment in a few weeks to get new stronger meds. I have no idea how im gonna make it till then. While all my friends are super excited for Christmas tomorrow, im dreading it. I dont want to hear about their presents, that will destroy me. \n\nThere are many other factors that play into my depression that I'm experiencing right now. Too many. But i just wanted to say this because ive already told everyone i can. Everyone knows how i feel, its just a matter of me hanging on until i get new meds. ",
            "responses": [
                "I totally understand what your going through. I've been dealing with major depressive disorder for close to 30 years. I wish i had something brilliant I could say that would help. My daughter is probably around your age (16) and she is going through a lot of the same things you are. I know how it feels to be both in it and on the outside looking in. I know that struggling with depression makes everything in life sooooooo much harder.\n\nI don't know how i can help, but I want you to know you're not alone, even when you feel overwhelmingly alone, you're not. They say \"one day at a time\" if that's too much take a moment at a time, a second at a time even if you just go breath by breath. I'm sorry for everything you are going through, if you need someone to talk to you can reach out to me if you want.\n\nI know school is going shitty and Christmas sucks and then to see your mom struggle like that, it's all so hard. But it won't always be like this. Things get better. Maybe not tomorrow or next week but you've got to find that thread of hope and hold on with everything you've got. Your life matters. &lt;3",
                "Thank you for understanding. I am trying very hard to hold on. Only a few more weeks until i get some new meds. "
            ]
        },
        {
            "tag": 20076,
            "patterns": "First, for months I have been thinking about opening up and telling my story on social media by the end of this year/beginning of the new. There are some close friends who know everything, well of what I will allow them to know. My mom knows I was hospitalized twice and has tried to be supportive. My dad and brother also know I was in the hospital. Other than that, a lot of my friends and family members do not know anything about it. \n\nThese past couple years, this past in particular, has been the most I have ever struggled with suicidal thoughts and attempts. I have had anxiety and depression since I could form my own thoughts in my head. I’ve been on different medications since I was 13, to make a long story short.\n\nThere is so much I could dive into to possibly try to explain why I want to die, but that’s not my intention for posting.  I want to post for myself. It may be selfish, and I am in no way looking for pity from others. But for some reason, I feel if I speak on social media about everything I’ve been through, if everyone I know hears my story and what has happened, that I will be free. I will be free from having to lie and explain why I missed a week of school or why it took my an extra semester and a half to graduate. It will be all out there in the open. For everyone. And that relieves me and terrifies me at the exact same time.\n\nI will be vulnerable in front of everyone in the world. I will be most vulnerable to my family, who have trouble understanding depression and suicidal ideation. I guess the reason I am confessing this on here before posting on other outlets is because I’m just scared. I think about doing this all the time and i really want to, I almost need to. But should I? Should I really burden my grandparents and younger brother and friends and everyone with telling them that I almost didn’t make it? I almost went through with it so many times? Is it necessary for me to worry them with this confession? This may seem trivial to some, to post on social media, but for me, it’s not. I need to do this, but I honestly don’t know if I can.",
            "responses": [
                "It is ok to feel terrified about speaking your truth. The topic of mental health needs to be addressed rather than left in the dark. A burden would be lifted off your shoulders once it is over. Imagine how many lives you can change just by telling your story. Prerecord it, and once you find the courage to, then post it.  YOU ARE NOT ALONE",
                "Hmm you know your own situation better than anyone else, so my opinion on things shouldn't count for much. \n\nThing is, I wouldn't do something like this. There were some brief moments where I made my mental state somewhat public and attached my real name to things, stuff I've said personally to people when I was mentally fucked up, stuff I've said out of anxiety, a deep need to communicate, calls for help basically, and I regret many of them. Three people decided they'd rather not know me as a result. All three were different, but their reasons were similar. I've embarrassed myself a number of times. Sometimes those embarrassments are amplified in my memory more than anything changes concrete in reality. The times I judiciously decided to censor myself, hide my problems, and the people I've deliberately kept in the dark, I'm grateful for. I've learned just because I have the urge to say something doesn't mean it should be said. Just because it is honest and natural doesn't mean it's the right thing to say. \n\nStuff that is said publicly with your real name attached can follow you a long time. On the flip side, the reaction could also be underwhelming or misunderstood. Even anonymously, I've said some things I thought felt right in my head, only to have them received poorly by others. \n\nI don't know. Again don't take me too seriously, use your own best judgment, but I refer to these things as \"crying in public\". Of course you'll get some degree of attention, but at the same time, you're also revealing your vulnerabilities to everyone you know. Once the information is out there, you can't control it. People you'd prefer not to know may indirectly find out. \n\nThe way I go about things (or at least learned to) is to treat yourself privately, professionally, and keep your public perception stable. It's okay to reveal your deepest secrets to those you can trust, but the level of sharing should be proportionate to the strength of the relationship, as well as the character of the recipient. \n\nFor problems that basically \"blow over\", it's even better to keep them private. For example, I've had marital problems. I told people I could trust about it, but advertising those problems to the public or being loose with whom I shared it to could've had lasting negative consequences. I'm glad I kept it on lockdown, because I was able to resolve the situation privately anyway. \n\nAnother example is sharing my health condition with coworkers and my boss. I never did, because I'm worried I'll be seen as unreliable, less capable, or handicapped. Until I'm actually unable to do the work, I plan on keeping it that way. It also separates personal drama from a professional environment.\n\nIt all comes down to sharing judiciously. Is mental health a part of your identity you'd like to showcase, or is it a health condition you battle privately with the aid of those you can trust? Both good and bad can come from this. I won't tell you not to, just how I handle this topic.",
                "Thank you so much. This means more than you can imagine!! It’s been a long year to say the least.",
                "Thank you for your honest and well written responses! I can see where you’re coming with certain things and it makes a lot of sense. \n\nI’ve definitely done similar things, only allowing others to know what I want them to and what i think is appropriate for them to know. I did have to tell my old boss (it was a work study through my school but I’m graduating now) at my last job at a nonprofit about both of my hospitalizations this past year because obviously I missed those weeks. I was worried they’d treat me differently or fire me as well. Luckily, they were the most understanding and even shared their own struggles. I was blessed to work at an amazing place like that because not everyone is so understanding. But then again, I don’t know if I’d want to work somewhere that belittled me or let me go because of my mental health.\n\nAs for going so public with this information, you’re definitely right about a lot of things. Once it’s out there, literally everyone will know everything about it and I can’t unshare it with people I don’t want to see it. But like I stated above as well, if I have friends, family, professional opportunities/colleagues, now and in the future, who decide to not be in my life anymore or not hire me because I struggle personally with depression, anxiety and suicidal ideation, do I really want those people or opportunies in my life anyways? \n\nI do worry people will take it as looking for attention on social media. Heck even I have thought that about people I’m friends with when they continue to post depressing things. I have realized I know that there are people who will think this about me once I do this. There are always people going to look down on you for using social media as an outlet to tell your story about your struggles. But I’ve also realized that I need to forget about those people. My story could really help someone else, even someone I don’t know. It could help someone decide to go to the hospital instead of going through with it, or help someone open up to their parents and friends like I did. \n\nAgain, thank you for your response. I love communicating with others and seeing situations from both sides (I graduated with a Communication Studies degree so this is good!). \n\nHope you have a great new year!",
                "To be honest I've felt the same way at times. If people are going to reject you because you have problems, are they even worth keeping in your life? I'd responses \"no\" too. At the same time I don't feel I have the confidence or stability to make calls like that. For me dealing with my problems internally or with those I can trust is enough to keep my hands full, let alone everyone else's opinions on the matter. Plus in my experience I've mostly encountered apathy, if not judgement and misunderstanding. You seem to possess the confidence that I lack. I'm glad despite all of the potential negatives I brought up you're still resolute. I hope it goes well for you.",
                "Confidence is definitely something you can learn and work on! I’ve found it amazing to see so many more people talking about their stories today, through social media, the internet, and in person, than there was even 5 years ago. I think the more we talk about mental illnesses, the more it’ll become accepted as legit. It’s still hard though, people will always judge. But thanks again! I still haven’t decided whether I should tell my story or if I’m even ready to, but I’m glad for conversations like these!"
            ]
        },
        {
            "tag": 20077,
            "patterns": "My depression has been getting worse at first it was bearable and it stopped for a bit but now it’s back and it’s worse than ever I have no idea what to do but I want to die I can’t see a future for myself living is so hard I want to give up I don’t want to deal with this alone but I have no one I don’t think I can keep going like this and yet I don’t know what to do every little thing makes me burst out in tears what do I do?",
            "responses": [
                "I’m feeling pretty much the same. they say those feelings don’t last forever, I wanna believe in that. I wanna believe that someday we could feel normal again. ",
                "Yeah me too but I’ve been holding out for a bit hoping things would get better but they haven’t and at this point I don’t think they ever will"
            ]
        },
        {
            "tag": 20078,
            "patterns": "I'm starting to think that i'm depressed, i feel so alone and helpless that lately genuenly i've been thinking a lot about suicide. I want to reach out for help like everyone on the internet says you should do if you are in this situation but i don't know how to start a conversation like that without  it sounding selfish and like how do you say \"i think i'm depressed, i feel alone and maybe i want to die\" without it sounding like you just want attention. I know for a fact that my mom won't listen i don't know how to tell my dad, i've recently just started to know my friends in uni and why would i bother them with that, i told my brother i felt so alone and that i feel like i would always be alone and he told me that maybe i should make a tinder account if i felt alone and that maybe i was being kinda childish in my way of thinking. So yeah i'm running out of ideas here, please help me I don't wan't to die but i don't think i can take this pain anymore.\nThanks",
            "responses": [
                "You aren't alone. Over the past 2 years my depression has downward spiraled to the point that I completely isolated myself. I have no contact with people I was friends with and very minimal contact with family. I could be in a room full of people and still feel alone. If there's anything I can do please don't hesitate to reach out.\n\nAlso if you feel like you need to talk to someone you can text \"home\" to 741-741 and a counselor will text you back. You can also call the national suicide hotline at 1.800.273.8255. I believe you can message them as well from their website\n\nhttps://suicidepreventionlifeline.org\n\nI hope this helps, let me know if there is anything I can do for you. Your life matters!",
                "Does your uni have counselors or mental health services of any sort? That's a good place to start. \n\nYou can bring up to your friends in uni that you're feeling lonely/homesick/just don't have as many friends as you used to before you started. If they're your friends it won't be \"bugging\" them. "
            ]
        },
        {
            "tag": 20079,
            "patterns": "So it pains me to even call her my ex because I truly do love her with everything in me. She broke up with me a few months ago and things have been really frosty for the past month or so. Every time I talk about suicide with her she takes it as “gaslighting” her and trying to hold it over her as a reason why she should be with me. It’s not my intent at all, I was depressed before her and have been since. She ended up blocking me on Facebook and I emailed her what I was going to say on Facebook. She basically said it’s not her responsibility and that I was toxic and ended it with “who fucking cares” she’s my only friend and the only person I’ve spoken to in a long time outside of my family. I really don’t know what to do anymore and I just want everything to stop.",
            "responses": [
                "Mate, I’m just gonna say it how it is. An ex is an ex for a reason. If you’re still wanting her the it’s obvious that she’s the one who gave up on the relationship. I don’t know how or why but I know you need to speak to someone who hasn’t broken you. You can’t heal in the same environment as you were injured. Trust me, talking from first hand experience. I ran myself into the ground trying to love someone who didn’t want to love me. Did everything I could whilst she didn’t lift a finger for me. She even ignored me because I said I was depressed and this was just after explaining that I felt no one was there for me. The more she treated me bad the more I started to fight to feel like I meant something to her which ultimately made her leave because I was so depressed at the hands of her actions. She tried to be there for me at first but the more I got over her, the further I sank into my pit and the worse I felt about her. To this day I can’t figure out why I was treated so bad when I tried to do everything I could to make her feel special and loved. To an extent she is correct. It’s not her responsibility for your mental health and feelings. She can influence them but ultimately it’s down to you to find yourself again. Good luck bro",
                "You’re absolutely right about it not being her responsibility and I’ve told her that dozens of times. She interprets me talking about being suicidal as blaming her",
                "She won’t see it the way you do, no words can make her see that. Nothing you do or say will bring her back to you. You need to accept the loss and move on. I know it’s hard, it’s not going to happen overnight either but the tighter you hold something, the more you suffocate it. It’s shit and it shouldn’t be this way but people find it suffocating when you talk to them about suicide. It pulls them into a world of hurt that they can’t express, takes them away from their own things they got to deal with and I imagine it’s very emotionally taxing trying to talk someone out of it all the time. You need to talk to a professional, someone who deals with this stuff on a daily basis because the average person can’t relate to how you feel",
                "There’s some context missing with that first part so I’ll avoid touching on it until the morning when I wake up. \n\nShe’s suicidal herself though, I was legit there for her on nights when she was talking about being low and wanting to die. I helped her through asking her doctor for better medicine and anti depressants, like that’s the thing. It’s like people want you to hear they problems but when you got your own, who there for you ? ",
                "So you’re telling me that you’re talking to a suicidal person (your ex) about killing yourself? There’s your problem... you’re making her suicidal tendencies worse doing that and you wonder why she wanted out? How is she gonna feel better about herself and her problems if you keep throwing yours on top of them? Sorry to be a dick but that’s how it is haha How could you actually expect her to put you first when she’s on the edge to? She was right to leave, she wants to mend and she felt she couldn’t the whole time you were making your suicidal thoughts her problem when she’s already battling her own. I genuinely got reddit to distract myself from my problems and help others but you’re not helping yourself. You’re gonna end up pushing her over the edge because she’s battling two peoples bad thoughts",
                "But it was fine when I was helping her with hers? That just seems shitty. She didn’t consider that when I was helping her",
                "That’s a shitty thing to say, just because you helped her doesn’t mean she has to help you. Tallying like that in a relationship is not healthy. Love is supposed to be unconditional, not ‘I done this for you so now tho have to do this for me.’ I’m not defending her either. She should know how much telling you ‘who even cares’ must hurt. Yeah it is a problem, but it’s not hers and she doesn’t have the responsess to your patternss. I can tell why she ran, you think the world is in debt to you. You need to find yourself and help for yourself by yourself. No one can make you feel better until you make yourself feel better. The whole time you think ‘cos I done this so this should happen’ you’ll never get better. It doesn’t matter what you do, it won’t change what’s going to happen. When people are sad and want out they don’t tally up and see if it’s worth it or not. If you’re unhappy with not receiving help from her because you helped her then don’t ask for the help from her. It doesn’t matter how good you are to someone, it won’t make them good to you"
            ]
        },
        {
            "tag": 20080,
            "patterns": "It's funny how the Bible (I'm Christian) tells us to love one another no matter what, but never once does it say love yourself because already assumes you do. But I don't. I don't love who I am. And I'm not happy. I SHOULD BE HAPPY....right? I have a great life, mother, father, sister, people who love me. my problems are so insignificant, I'm insignificant. There are so many people in the world who have nothing or who have serious problems. I should be happy. I should love myself. So why don't i? Why do I want to die. ",
            "responses": [
                "The Biblical teaching to \"love thy neighbor as thyself\" I think does go both ways. Yes, the assumption is that a lot of us are more loving towards ourselves and need to love others and be less self-centered. When I get depressed I'm often much more nice to other people-- so sometimes I need to raise up the loving myself part and treat myself like I try to treat others. I think showing love to others can help with depression, though it's certainly not a magic fix.\n\nMy therapist often tells me not to \"should\" on myself. I often say \"I should be happy.\" Why? Because it's expected? Because things are going well? I do **want** to be happy. I try to do the things that help. I don't think think we need to put the burden/expectation of being happy on ourselves when we aren't able to, though. We can have it as a goal/hope. And I hope that for you, friend"
            ]
        },
        {
            "tag": 20081,
            "patterns": "I'm very bad off right now. How do you distract yourself from the spiral of thoughts? Every time something happens to me, good or bad, I want to die. I'm so, so sick and so tired. I can't even function any more + half the time I forget to eat, let alone take my medication. I'm a fucking mess and I wish I'd never been born. Feel like I can't change anything, I'm stuck forever. I have been the same since I was about twelve years old, depression started when I was around ten (which is ridiculously young, but you know) and I found out this year that I'm bipolar 1. I'm also a type 1 diabetic and I'm so sick of everything. The balance, the maintenance, it's just not worth it any more. Everyone thinks they understand but they don't. I don't want an insulin pump because I'm sick of being reminded every second of every day what I am and what I cannot change. Those inspirational stories of people who overcome their illnesses through exercise? Good for them, but I sleep all the time and feel like I'm about to pass out whenever I stand up. Nobody understands. They think it's simple, like watch what you eat and you'll be fine. No, Carolyn, it's stabbing yourself with a needle five plus times a day and checking your blood sugar constantly. It's remembering to take medication on a daily basis when I can't even remember what I did yesterday. I go through this so often I don't even know what to do with myself. I wish I was dead.",
            "responses": [
                "Have you tried distracting yourself with some hobbies? TV, movies or video games to take your mind off things. ",
                "Please stop for a second and take a breath. I do understand, I live with a spinal injury that has me close to paralysis. They go in dec 10 to hopefully \"fix\".\nI'm bipolar schizo-effect with multiple personalities disorder. I understand your fight. And I agree, it is tough. The toughest battle I could ever imagine. \n\nAnd you have done the hardest thing possible, make yourself vulnerable and open yourself up for help. And that is commended. It takes a very strong person to take that step. \n\nThose inspirational stories have always made me laugh, like \"I took this magic pill and all my cares and depression have disappeared and I'm 100% better\". We both know that's not how life works. But depression medicine can and will help if you find the right stuff and find something to help balance you out and a hobby or something. \n\nThe first thing I do daily, whether I want to or not, I force myself out of bed, I take a shower, I dress in clean clothes, fresh socks and put shoes on, my deodorant and even fix my hair. Then I dont sit down for the first hour or 2 of the day. As soon as i feel exhausted or tired, i do some dishes, laundry, sweep, or even alphabetize my canned food cabinet. This keeps my mind busy and the thoughts of feeling useless becUze i couldn't get up are no longer part of the battle. \n\nI'm sure you have a smart phone, let's take the first steps of taking meds daily. Set a simple alarm that says something silly like Elephant Nuts or something. Each time that alarm goes off, it is a smile, that smile will remind you that it is time to take meds and/or insulin. Naming the alarm something stupid stops nosey people from looking and seeing \"take meds\" or whatever. It gives you some privacy. \n\nI want to help you. I'll listen to whatever you need to talk about and at whatever time. I'm stuck home and stuck on the couch, I cant leave, i cant really do anything. So just know that when I day I'm here for you, I truly am. ",
                "Thanks for the advice. Sometimes I'm lucky if I can get out of bed. It feels like all the maintenance is too much effort for too little payoff, so to speak. I don't have any kind of a life. I'm too exhausted to have any real hobbies, and my mind is always racing so I can't even bring myself to read like I used to.\n\nIt's nice to know I'm not alone because some days it really feels like it. I have psychotic features as well as OCD and to doubt your own reality constantly is exhausting. I would never talk about this with someone else in person because I don't want people to hear me complain, but thank you for reading and giving me some tips. I really appreciate it.",
                "I have tried but it's very difficult. I can't really read or focus enough to watch TV, I like video games so that's a nice escape sometimes. ",
                "You are never alone, you always have this sub,and you always have me. I'm always in here and on here. \n\nI understand the maintenance feels like little pay off, but it is a start. And that's what is needed, is just a start. \n\nAnd I completely understand doubtin cn tour own reality, it is exhausting. It is infuriating to think the loved  ones that promised to be there you aren't. But I won't let that stop me from trying to help every person I possibly can. I am taking my own depression and making it a catalyst to help others, including yourself.  \n\nMore people.deal with this than they admit. Because they think it makes them weak or whatever. I look st my depression and have learned thay it is killing me but I feel I'm making a difference. "
            ]
        }
    ]
}